/* automatically generated by rust-bindgen 0.69.4 */

pub const __BIONIC__: u32 = 1;
pub const __WORDSIZE: u32 = 64;
pub const __bos_level: u32 = 0;
pub const __ANDROID_API_FUTURE__: u32 = 10000;
pub const __ANDROID_API__: u32 = 10000;
pub const __ANDROID_API_G__: u32 = 9;
pub const __ANDROID_API_I__: u32 = 14;
pub const __ANDROID_API_J__: u32 = 16;
pub const __ANDROID_API_J_MR1__: u32 = 17;
pub const __ANDROID_API_J_MR2__: u32 = 18;
pub const __ANDROID_API_K__: u32 = 19;
pub const __ANDROID_API_L__: u32 = 21;
pub const __ANDROID_API_L_MR1__: u32 = 22;
pub const __ANDROID_API_M__: u32 = 23;
pub const __ANDROID_API_N__: u32 = 24;
pub const __ANDROID_API_N_MR1__: u32 = 25;
pub const __ANDROID_API_O__: u32 = 26;
pub const __ANDROID_API_O_MR1__: u32 = 27;
pub const __ANDROID_API_P__: u32 = 28;
pub const __ANDROID_API_Q__: u32 = 29;
pub const __ANDROID_API_R__: u32 = 30;
pub const __ANDROID_API_S__: u32 = 31;
pub const __ANDROID_API_T__: u32 = 33;
pub const __ANDROID_API_U__: u32 = 34;
pub const __ANDROID_API_V__: u32 = 35;
pub const __ANDROID_NDK__: u32 = 1;
pub const __NDK_MAJOR__: u32 = 26;
pub const __NDK_MINOR__: u32 = 0;
pub const __NDK_BETA__: u32 = 0;
pub const __NDK_BUILD__: u32 = 10792818;
pub const __NDK_CANARY__: u32 = 0;
pub const INT8_MIN: i32 = -128;
pub const INT8_MAX: u32 = 127;
pub const INT_LEAST8_MIN: i32 = -128;
pub const INT_LEAST8_MAX: u32 = 127;
pub const INT_FAST8_MIN: i32 = -128;
pub const INT_FAST8_MAX: u32 = 127;
pub const UINT8_MAX: u32 = 255;

pub const SCNoFAST64: &[u8; 3] = b"lo\0";
pub const SCNoMAX: &[u8; 3] = b"jo\0";
pub const SCNoPTR: &[u8; 3] = b"lo\0";
pub const SCNu8: &[u8; 4] = b"hhu\0";
pub const SCNu16: &[u8; 3] = b"hu\0";
pub const SCNu32: &[u8; 2] = b"u\0";
pub const SCNu64: &[u8; 3] = b"lu\0";
pub const SCNuLEAST8: &[u8; 4] = b"hhu\0";
pub const SCNuLEAST16: &[u8; 3] = b"hu\0";
pub const SCNuLEAST32: &[u8; 2] = b"u\0";
pub const SCNuLEAST64: &[u8; 3] = b"lu\0";
pub const SCNuFAST8: &[u8; 4] = b"hhu\0";
pub const SCNuFAST16: &[u8; 3] = b"lu\0";
pub const SCNuFAST32: &[u8; 3] = b"lu\0";
pub const SCNuFAST64: &[u8; 3] = b"lu\0";
pub const SCNuMAX: &[u8; 3] = b"ju\0";
pub const SCNuPTR: &[u8; 3] = b"lu\0";
pub const SCNx8: &[u8; 4] = b"hhx\0";
pub const SCNx16: &[u8; 3] = b"hx\0";
pub const SCNx32: &[u8; 2] = b"x\0";
pub const SCNx64: &[u8; 3] = b"lx\0";
pub const SCNxLEAST8: &[u8; 4] = b"hhx\0";
pub const SCNxLEAST16: &[u8; 3] = b"hx\0";
pub const SCNxLEAST32: &[u8; 2] = b"x\0";
pub const SCNxLEAST64: &[u8; 3] = b"lx\0";
pub const SCNxFAST8: &[u8; 4] = b"hhx\0";
pub const SCNxFAST16: &[u8; 3] = b"lx\0";
pub const SCNxFAST32: &[u8; 3] = b"lx\0";
pub const SCNxFAST64: &[u8; 3] = b"lx\0";
pub const SCNxMAX: &[u8; 3] = b"jx\0";
pub const SCNxPTR: &[u8; 3] = b"lx\0";
pub const __GNUC_VA_LIST: u32 = 1;
pub const JNI_FALSE: u32 = 0;
pub const JNI_TRUE: u32 = 1;
pub const JNI_VERSION_1_1: u32 = 65537;
pub const JNI_VERSION_1_2: u32 = 65538;
pub const JNI_VERSION_1_4: u32 = 65540;
pub const JNI_VERSION_1_6: u32 = 65542;
pub const JNI_OK: u32 = 0;
pub const JNI_ERR: i32 = -1;
pub const JNI_EDETACHED: i32 = -2;
pub const JNI_EVERSION: i32 = -3;
pub const JNI_ENOMEM: i32 = -4;
pub const JNI_EEXIST: i32 = -5;
pub const JNI_EINVAL: i32 = -6;
pub const JNI_COMMIT: u32 = 1;
pub const JNI_ABORT: u32 = 2;
pub const __BITS_PER_LONG: u32 = 64;
pub const __FD_SETSIZE: u32 = 1024;
pub const AMOTION_EVENT_ACTION_POINTER_INDEX_SHIFT: u32 = 8;
pub const true_: u32 = 1;
pub const false_: u32 = 0;
pub const __bool_true_false_are_defined: u32 = 1;
extern "C" {
    pub fn android_get_application_target_sdk_version() -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Returns the API level of the device we're actually running on, or -1 on failure.\n The returned values correspond to the named constants in `<android/api-level.h>`,\n and is equivalent to the Java `Build.VERSION.SDK_INT` API.\n\n See also android_get_application_target_sdk_version()."]
    pub fn android_get_device_api_level() -> ::std::os::raw::c_int;
}
pub type wchar_t = ::std::os::raw::c_int;
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct max_align_t {
    pub __clang_max_align_nonce1: ::std::os::raw::c_longlong,
    pub __bindgen_padding_0: u64,
    pub __clang_max_align_nonce2: u128,
}
#[test]
fn bindgen_test_layout_max_align_t() {
    const UNINIT: ::std::mem::MaybeUninit<max_align_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<max_align_t>(),
        32usize,
        concat!("Size of: ", stringify!(max_align_t))
    );
    assert_eq!(
        ::std::mem::align_of::<max_align_t>(),
        16usize,
        concat!("Alignment of ", stringify!(max_align_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__clang_max_align_nonce1) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(max_align_t),
            "::",
            stringify!(__clang_max_align_nonce1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__clang_max_align_nonce2) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(max_align_t),
            "::",
            stringify!(__clang_max_align_nonce2)
        )
    );
}
pub type __int8_t = ::std::os::raw::c_schar;
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __int16_t = ::std::os::raw::c_short;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __int32_t = ::std::os::raw::c_int;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __int64_t = ::std::os::raw::c_long;
pub type __uint64_t = ::std::os::raw::c_ulong;
pub type __intptr_t = ::std::os::raw::c_long;
pub type __uintptr_t = ::std::os::raw::c_ulong;
pub type int_least8_t = i8;
pub type uint_least8_t = u8;
pub type int_least16_t = i16;
pub type uint_least16_t = u16;
pub type int_least32_t = i32;
pub type uint_least32_t = u32;
pub type int_least64_t = i64;
pub type uint_least64_t = u64;
pub type int_fast8_t = i8;
pub type uint_fast8_t = u8;
pub type int_fast64_t = i64;
pub type uint_fast64_t = u64;
pub type int_fast16_t = i64;
pub type uint_fast16_t = u64;
pub type int_fast32_t = i64;
pub type uint_fast32_t = u64;
pub type uintmax_t = u64;
pub type intmax_t = i64;
#[doc = " Rectangular window area.\n\n This is the NDK equivalent of the android.graphics.Rect class in Java. It is\n used with {@link ANativeActivityCallbacks::onContentRectChanged} event\n callback and the ANativeWindow_lock() function.\n\n In a valid ARect, left <= right and top <= bottom. ARect with left=0, top=10,\n right=1, bottom=11 contains only one pixel at x=0, y=10."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ARect {
    #[doc = " Minimum X coordinate of the rectangle."]
    pub left: i32,
    #[doc = " Minimum Y coordinate of the rectangle."]
    pub top: i32,
    #[doc = " Maximum X coordinate of the rectangle."]
    pub right: i32,
    #[doc = " Maximum Y coordinate of the rectangle."]
    pub bottom: i32,
}
#[test]
fn bindgen_test_layout_ARect() {
    const UNINIT: ::std::mem::MaybeUninit<ARect> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ARect>(),
        16usize,
        concat!("Size of: ", stringify!(ARect))
    );
    assert_eq!(
        ::std::mem::align_of::<ARect>(),
        4usize,
        concat!("Alignment of ", stringify!(ARect))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).left) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ARect),
            "::",
            stringify!(left)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).top) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ARect),
            "::",
            stringify!(top)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).right) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ARect),
            "::",
            stringify!(right)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bottom) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ARect),
            "::",
            stringify!(bottom)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct imaxdiv_t {
    pub quot: intmax_t,
    pub rem: intmax_t,
}
#[test]
fn bindgen_test_layout_imaxdiv_t() {
    const UNINIT: ::std::mem::MaybeUninit<imaxdiv_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<imaxdiv_t>(),
        16usize,
        concat!("Size of: ", stringify!(imaxdiv_t))
    );
    assert_eq!(
        ::std::mem::align_of::<imaxdiv_t>(),
        8usize,
        concat!("Alignment of ", stringify!(imaxdiv_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).quot) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(imaxdiv_t),
            "::",
            stringify!(quot)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rem) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(imaxdiv_t),
            "::",
            stringify!(rem)
        )
    );
}
extern "C" {
    pub fn imaxabs(__i: intmax_t) -> intmax_t;
}
extern "C" {
    pub fn imaxdiv(__numerator: intmax_t, __denominator: intmax_t) -> imaxdiv_t;
}
extern "C" {
    pub fn strtoimax(
        __s: *const ::std::os::raw::c_char,
        __end_ptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> intmax_t;
}
extern "C" {
    pub fn strtoumax(
        __s: *const ::std::os::raw::c_char,
        __end_ptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> uintmax_t;
}
extern "C" {
    pub fn wcstoimax(
        __s: *const wchar_t,
        __end_ptr: *mut *mut wchar_t,
        __base: ::std::os::raw::c_int,
    ) -> intmax_t;
}
extern "C" {
    pub fn wcstoumax(
        __s: *const wchar_t,
        __end_ptr: *mut *mut wchar_t,
        __base: ::std::os::raw::c_int,
    ) -> uintmax_t;
}
#[doc = " Corresponding formats:\n   Vulkan: VK_FORMAT_R8G8B8A8_UNORM\n   OpenGL ES: GL_RGBA8"]
pub const AHardwareBuffer_Format_AHARDWAREBUFFER_FORMAT_R8G8B8A8_UNORM: AHardwareBuffer_Format = 1;
#[doc = " 32 bits per pixel, 8 bits per channel format where alpha values are\n ignored (always opaque).\n Corresponding formats:\n   Vulkan: VK_FORMAT_R8G8B8A8_UNORM\n   OpenGL ES: GL_RGB8"]
pub const AHardwareBuffer_Format_AHARDWAREBUFFER_FORMAT_R8G8B8X8_UNORM: AHardwareBuffer_Format = 2;
#[doc = " Corresponding formats:\n   Vulkan: VK_FORMAT_R8G8B8_UNORM\n   OpenGL ES: GL_RGB8"]
pub const AHardwareBuffer_Format_AHARDWAREBUFFER_FORMAT_R8G8B8_UNORM: AHardwareBuffer_Format = 3;
#[doc = " Corresponding formats:\n   Vulkan: VK_FORMAT_R5G6B5_UNORM_PACK16\n   OpenGL ES: GL_RGB565"]
pub const AHardwareBuffer_Format_AHARDWAREBUFFER_FORMAT_R5G6B5_UNORM: AHardwareBuffer_Format = 4;
#[doc = " Corresponding formats:\n   Vulkan: VK_FORMAT_R16G16B16A16_SFLOAT\n   OpenGL ES: GL_RGBA16F"]
pub const AHardwareBuffer_Format_AHARDWAREBUFFER_FORMAT_R16G16B16A16_FLOAT: AHardwareBuffer_Format =
    22;
#[doc = " Corresponding formats:\n   Vulkan: VK_FORMAT_A2B10G10R10_UNORM_PACK32\n   OpenGL ES: GL_RGB10_A2"]
pub const AHardwareBuffer_Format_AHARDWAREBUFFER_FORMAT_R10G10B10A2_UNORM: AHardwareBuffer_Format =
    43;
#[doc = " Opaque binary blob format.\n Must have height 1 and one layer, with width equal to the buffer\n size in bytes. Corresponds to Vulkan buffers and OpenGL buffer\n objects. Can be bound to the latter using GL_EXT_external_buffer."]
pub const AHardwareBuffer_Format_AHARDWAREBUFFER_FORMAT_BLOB: AHardwareBuffer_Format = 33;
#[doc = " Corresponding formats:\n   Vulkan: VK_FORMAT_D16_UNORM\n   OpenGL ES: GL_DEPTH_COMPONENT16"]
pub const AHardwareBuffer_Format_AHARDWAREBUFFER_FORMAT_D16_UNORM: AHardwareBuffer_Format = 48;
#[doc = " Corresponding formats:\n   Vulkan: VK_FORMAT_X8_D24_UNORM_PACK32\n   OpenGL ES: GL_DEPTH_COMPONENT24"]
pub const AHardwareBuffer_Format_AHARDWAREBUFFER_FORMAT_D24_UNORM: AHardwareBuffer_Format = 49;
#[doc = " Corresponding formats:\n   Vulkan: VK_FORMAT_D24_UNORM_S8_UINT\n   OpenGL ES: GL_DEPTH24_STENCIL8"]
pub const AHardwareBuffer_Format_AHARDWAREBUFFER_FORMAT_D24_UNORM_S8_UINT: AHardwareBuffer_Format =
    50;
#[doc = " Corresponding formats:\n   Vulkan: VK_FORMAT_D32_SFLOAT\n   OpenGL ES: GL_DEPTH_COMPONENT32F"]
pub const AHardwareBuffer_Format_AHARDWAREBUFFER_FORMAT_D32_FLOAT: AHardwareBuffer_Format = 51;
#[doc = " Corresponding formats:\n   Vulkan: VK_FORMAT_D32_SFLOAT_S8_UINT\n   OpenGL ES: GL_DEPTH32F_STENCIL8"]
pub const AHardwareBuffer_Format_AHARDWAREBUFFER_FORMAT_D32_FLOAT_S8_UINT: AHardwareBuffer_Format =
    52;
#[doc = " Corresponding formats:\n   Vulkan: VK_FORMAT_S8_UINT\n   OpenGL ES: GL_STENCIL_INDEX8"]
pub const AHardwareBuffer_Format_AHARDWAREBUFFER_FORMAT_S8_UINT: AHardwareBuffer_Format = 53;
#[doc = " YUV 420 888 format.\n Must have an even width and height. Can be accessed in OpenGL\n shaders through an external sampler. Does not support mip-maps\n cube-maps or multi-layered textures."]
pub const AHardwareBuffer_Format_AHARDWAREBUFFER_FORMAT_Y8Cb8Cr8_420: AHardwareBuffer_Format = 35;
#[doc = " YUV P010 format.\n Must have an even width and height. Can be accessed in OpenGL\n shaders through an external sampler. Does not support mip-maps\n cube-maps or multi-layered textures."]
pub const AHardwareBuffer_Format_AHARDWAREBUFFER_FORMAT_YCbCr_P010: AHardwareBuffer_Format = 54;
#[doc = " Corresponding formats:\n   Vulkan: VK_FORMAT_R8_UNORM\n   OpenGL ES: GR_GL_R8"]
pub const AHardwareBuffer_Format_AHARDWAREBUFFER_FORMAT_R8_UNORM: AHardwareBuffer_Format = 56;
#[doc = " Corresponding formats:\n   Vulkan: VK_FORMAT_R16_UINT\n   OpenGL ES: GL_R16UI"]
pub const AHardwareBuffer_Format_AHARDWAREBUFFER_FORMAT_R16_UINT: AHardwareBuffer_Format = 57;
#[doc = " Corresponding formats:\n   Vulkan: VK_FORMAT_R16G16_UINT\n   OpenGL ES: GL_RG16UI"]
pub const AHardwareBuffer_Format_AHARDWAREBUFFER_FORMAT_R16G16_UINT: AHardwareBuffer_Format = 58;
#[doc = " Corresponding formats:\n   Vulkan: VK_FORMAT_R10X6G10X6B10X6A10X6_UNORM_4PACK16\n   OpenGL ES: N/A"]
pub const AHardwareBuffer_Format_AHARDWAREBUFFER_FORMAT_R10G10B10A10_UNORM: AHardwareBuffer_Format =
    59;
#[doc = " Buffer pixel formats."]
pub type AHardwareBuffer_Format = ::std::os::raw::c_uint;
#[doc = " The buffer will never be locked for direct CPU reads using the\n AHardwareBuffer_lock() function. Note that reading the buffer\n using OpenGL or Vulkan functions or memory mappings is still\n allowed."]
pub const AHardwareBuffer_UsageFlags_AHARDWAREBUFFER_USAGE_CPU_READ_NEVER:
    AHardwareBuffer_UsageFlags = 0;
#[doc = " The buffer will sometimes be locked for direct CPU reads using\n the AHardwareBuffer_lock() function. Note that reading the\n buffer using OpenGL or Vulkan functions or memory mappings\n does not require the presence of this flag."]
pub const AHardwareBuffer_UsageFlags_AHARDWAREBUFFER_USAGE_CPU_READ_RARELY:
    AHardwareBuffer_UsageFlags = 2;
#[doc = " The buffer will often be locked for direct CPU reads using\n the AHardwareBuffer_lock() function. Note that reading the\n buffer using OpenGL or Vulkan functions or memory mappings\n does not require the presence of this flag."]
pub const AHardwareBuffer_UsageFlags_AHARDWAREBUFFER_USAGE_CPU_READ_OFTEN:
    AHardwareBuffer_UsageFlags = 3;
#[doc = " CPU read value mask."]
pub const AHardwareBuffer_UsageFlags_AHARDWAREBUFFER_USAGE_CPU_READ_MASK:
    AHardwareBuffer_UsageFlags = 15;
#[doc = " The buffer will never be locked for direct CPU writes using the\n AHardwareBuffer_lock() function. Note that writing the buffer\n using OpenGL or Vulkan functions or memory mappings is still\n allowed."]
pub const AHardwareBuffer_UsageFlags_AHARDWAREBUFFER_USAGE_CPU_WRITE_NEVER:
    AHardwareBuffer_UsageFlags = 0;
#[doc = " The buffer will sometimes be locked for direct CPU writes using\n the AHardwareBuffer_lock() function. Note that writing the\n buffer using OpenGL or Vulkan functions or memory mappings\n does not require the presence of this flag."]
pub const AHardwareBuffer_UsageFlags_AHARDWAREBUFFER_USAGE_CPU_WRITE_RARELY:
    AHardwareBuffer_UsageFlags = 32;
#[doc = " The buffer will often be locked for direct CPU writes using\n the AHardwareBuffer_lock() function. Note that writing the\n buffer using OpenGL or Vulkan functions or memory mappings\n does not require the presence of this flag."]
pub const AHardwareBuffer_UsageFlags_AHARDWAREBUFFER_USAGE_CPU_WRITE_OFTEN:
    AHardwareBuffer_UsageFlags = 48;
#[doc = " CPU write value mask."]
pub const AHardwareBuffer_UsageFlags_AHARDWAREBUFFER_USAGE_CPU_WRITE_MASK:
    AHardwareBuffer_UsageFlags = 240;
#[doc = " The buffer will be read from by the GPU as a texture."]
pub const AHardwareBuffer_UsageFlags_AHARDWAREBUFFER_USAGE_GPU_SAMPLED_IMAGE:
    AHardwareBuffer_UsageFlags = 256;
#[doc = " The buffer will be written to by the GPU as a framebuffer attachment."]
pub const AHardwareBuffer_UsageFlags_AHARDWAREBUFFER_USAGE_GPU_FRAMEBUFFER:
    AHardwareBuffer_UsageFlags = 512;
#[doc = " The buffer will be written to by the GPU as a framebuffer\n attachment.\n\n Note that the name of this flag is somewhat misleading: it does\n not imply that the buffer contains a color format. A buffer with\n depth or stencil format that will be used as a framebuffer\n attachment should also have this flag. Use the equivalent flag\n AHARDWAREBUFFER_USAGE_GPU_FRAMEBUFFER to avoid this confusion."]
pub const AHardwareBuffer_UsageFlags_AHARDWAREBUFFER_USAGE_GPU_COLOR_OUTPUT:
    AHardwareBuffer_UsageFlags = 512;
#[doc = " The buffer will be used as a composer HAL overlay layer.\n\n This flag is currently only needed when using ASurfaceTransaction_setBuffer\n to set a buffer. In all other cases, the framework adds this flag\n internally to buffers that could be presented in a composer overlay.\n ASurfaceTransaction_setBuffer is special because it uses buffers allocated\n directly through AHardwareBuffer_allocate instead of buffers allocated\n by the framework."]
pub const AHardwareBuffer_UsageFlags_AHARDWAREBUFFER_USAGE_COMPOSER_OVERLAY:
    AHardwareBuffer_UsageFlags = 2048;
#[doc = " The buffer is protected from direct CPU access or being read by\n non-secure hardware, such as video encoders.\n\n This flag is incompatible with CPU read and write flags. It is\n mainly used when handling DRM video. Refer to the EGL extension\n EGL_EXT_protected_content and GL extension\n GL_EXT_protected_textures for more information on how these\n buffers are expected to behave."]
pub const AHardwareBuffer_UsageFlags_AHARDWAREBUFFER_USAGE_PROTECTED_CONTENT:
    AHardwareBuffer_UsageFlags = 16384;
#[doc = " The buffer will be read by a hardware video encoder."]
pub const AHardwareBuffer_UsageFlags_AHARDWAREBUFFER_USAGE_VIDEO_ENCODE:
    AHardwareBuffer_UsageFlags = 65536;
#[doc = " The buffer will be used for direct writes from sensors.\n When this flag is present, the format must be AHARDWAREBUFFER_FORMAT_BLOB."]
pub const AHardwareBuffer_UsageFlags_AHARDWAREBUFFER_USAGE_SENSOR_DIRECT_DATA:
    AHardwareBuffer_UsageFlags = 8388608;
#[doc = " The buffer will be used as a shader storage or uniform buffer object.\n When this flag is present, the format must be AHARDWAREBUFFER_FORMAT_BLOB."]
pub const AHardwareBuffer_UsageFlags_AHARDWAREBUFFER_USAGE_GPU_DATA_BUFFER:
    AHardwareBuffer_UsageFlags = 16777216;
#[doc = " The buffer will be used as a cube map texture.\n When this flag is present, the buffer must have a layer count\n that is a multiple of 6. Note that buffers with this flag must be\n bound to OpenGL textures using the extension\n GL_EXT_EGL_image_storage instead of GL_KHR_EGL_image."]
pub const AHardwareBuffer_UsageFlags_AHARDWAREBUFFER_USAGE_GPU_CUBE_MAP:
    AHardwareBuffer_UsageFlags = 33554432;
#[doc = " The buffer contains a complete mipmap hierarchy.\n Note that buffers with this flag must be bound to OpenGL textures using\n the extension GL_EXT_EGL_image_storage instead of GL_KHR_EGL_image."]
pub const AHardwareBuffer_UsageFlags_AHARDWAREBUFFER_USAGE_GPU_MIPMAP_COMPLETE:
    AHardwareBuffer_UsageFlags = 67108864;
#[doc = " Usage: The buffer is used for front-buffer rendering. When\n front-buffering rendering is specified, different usages may adjust their\n behavior as a result. For example, when used as GPU_COLOR_OUTPUT the buffer\n will behave similar to a single-buffered window. When used with\n COMPOSER_OVERLAY, the system will try to prioritize the buffer receiving\n an overlay plane & avoid caching it in intermediate composition buffers."]
pub const AHardwareBuffer_UsageFlags_AHARDWAREBUFFER_USAGE_FRONT_BUFFER:
    AHardwareBuffer_UsageFlags = 4294967296;
#[doc = " Usage: The buffer is used for front-buffer rendering. When\n front-buffering rendering is specified, different usages may adjust their\n behavior as a result. For example, when used as GPU_COLOR_OUTPUT the buffer\n will behave similar to a single-buffered window. When used with\n COMPOSER_OVERLAY, the system will try to prioritize the buffer receiving\n an overlay plane & avoid caching it in intermediate composition buffers."]
pub const AHardwareBuffer_UsageFlags_AHARDWAREBUFFER_USAGE_VENDOR_0: AHardwareBuffer_UsageFlags =
    268435456;
#[doc = " Usage: The buffer is used for front-buffer rendering. When\n front-buffering rendering is specified, different usages may adjust their\n behavior as a result. For example, when used as GPU_COLOR_OUTPUT the buffer\n will behave similar to a single-buffered window. When used with\n COMPOSER_OVERLAY, the system will try to prioritize the buffer receiving\n an overlay plane & avoid caching it in intermediate composition buffers."]
pub const AHardwareBuffer_UsageFlags_AHARDWAREBUFFER_USAGE_VENDOR_1: AHardwareBuffer_UsageFlags =
    536870912;
#[doc = " Usage: The buffer is used for front-buffer rendering. When\n front-buffering rendering is specified, different usages may adjust their\n behavior as a result. For example, when used as GPU_COLOR_OUTPUT the buffer\n will behave similar to a single-buffered window. When used with\n COMPOSER_OVERLAY, the system will try to prioritize the buffer receiving\n an overlay plane & avoid caching it in intermediate composition buffers."]
pub const AHardwareBuffer_UsageFlags_AHARDWAREBUFFER_USAGE_VENDOR_2: AHardwareBuffer_UsageFlags =
    1073741824;
#[doc = " Usage: The buffer is used for front-buffer rendering. When\n front-buffering rendering is specified, different usages may adjust their\n behavior as a result. For example, when used as GPU_COLOR_OUTPUT the buffer\n will behave similar to a single-buffered window. When used with\n COMPOSER_OVERLAY, the system will try to prioritize the buffer receiving\n an overlay plane & avoid caching it in intermediate composition buffers."]
pub const AHardwareBuffer_UsageFlags_AHARDWAREBUFFER_USAGE_VENDOR_3: AHardwareBuffer_UsageFlags =
    2147483648;
#[doc = " Usage: The buffer is used for front-buffer rendering. When\n front-buffering rendering is specified, different usages may adjust their\n behavior as a result. For example, when used as GPU_COLOR_OUTPUT the buffer\n will behave similar to a single-buffered window. When used with\n COMPOSER_OVERLAY, the system will try to prioritize the buffer receiving\n an overlay plane & avoid caching it in intermediate composition buffers."]
pub const AHardwareBuffer_UsageFlags_AHARDWAREBUFFER_USAGE_VENDOR_4: AHardwareBuffer_UsageFlags =
    281474976710656;
#[doc = " Usage: The buffer is used for front-buffer rendering. When\n front-buffering rendering is specified, different usages may adjust their\n behavior as a result. For example, when used as GPU_COLOR_OUTPUT the buffer\n will behave similar to a single-buffered window. When used with\n COMPOSER_OVERLAY, the system will try to prioritize the buffer receiving\n an overlay plane & avoid caching it in intermediate composition buffers."]
pub const AHardwareBuffer_UsageFlags_AHARDWAREBUFFER_USAGE_VENDOR_5: AHardwareBuffer_UsageFlags =
    562949953421312;
#[doc = " Usage: The buffer is used for front-buffer rendering. When\n front-buffering rendering is specified, different usages may adjust their\n behavior as a result. For example, when used as GPU_COLOR_OUTPUT the buffer\n will behave similar to a single-buffered window. When used with\n COMPOSER_OVERLAY, the system will try to prioritize the buffer receiving\n an overlay plane & avoid caching it in intermediate composition buffers."]
pub const AHardwareBuffer_UsageFlags_AHARDWAREBUFFER_USAGE_VENDOR_6: AHardwareBuffer_UsageFlags =
    1125899906842624;
#[doc = " Usage: The buffer is used for front-buffer rendering. When\n front-buffering rendering is specified, different usages may adjust their\n behavior as a result. For example, when used as GPU_COLOR_OUTPUT the buffer\n will behave similar to a single-buffered window. When used with\n COMPOSER_OVERLAY, the system will try to prioritize the buffer receiving\n an overlay plane & avoid caching it in intermediate composition buffers."]
pub const AHardwareBuffer_UsageFlags_AHARDWAREBUFFER_USAGE_VENDOR_7: AHardwareBuffer_UsageFlags =
    2251799813685248;
#[doc = " Usage: The buffer is used for front-buffer rendering. When\n front-buffering rendering is specified, different usages may adjust their\n behavior as a result. For example, when used as GPU_COLOR_OUTPUT the buffer\n will behave similar to a single-buffered window. When used with\n COMPOSER_OVERLAY, the system will try to prioritize the buffer receiving\n an overlay plane & avoid caching it in intermediate composition buffers."]
pub const AHardwareBuffer_UsageFlags_AHARDWAREBUFFER_USAGE_VENDOR_8: AHardwareBuffer_UsageFlags =
    4503599627370496;
#[doc = " Usage: The buffer is used for front-buffer rendering. When\n front-buffering rendering is specified, different usages may adjust their\n behavior as a result. For example, when used as GPU_COLOR_OUTPUT the buffer\n will behave similar to a single-buffered window. When used with\n COMPOSER_OVERLAY, the system will try to prioritize the buffer receiving\n an overlay plane & avoid caching it in intermediate composition buffers."]
pub const AHardwareBuffer_UsageFlags_AHARDWAREBUFFER_USAGE_VENDOR_9: AHardwareBuffer_UsageFlags =
    9007199254740992;
#[doc = " Usage: The buffer is used for front-buffer rendering. When\n front-buffering rendering is specified, different usages may adjust their\n behavior as a result. For example, when used as GPU_COLOR_OUTPUT the buffer\n will behave similar to a single-buffered window. When used with\n COMPOSER_OVERLAY, the system will try to prioritize the buffer receiving\n an overlay plane & avoid caching it in intermediate composition buffers."]
pub const AHardwareBuffer_UsageFlags_AHARDWAREBUFFER_USAGE_VENDOR_10: AHardwareBuffer_UsageFlags =
    18014398509481984;
#[doc = " Usage: The buffer is used for front-buffer rendering. When\n front-buffering rendering is specified, different usages may adjust their\n behavior as a result. For example, when used as GPU_COLOR_OUTPUT the buffer\n will behave similar to a single-buffered window. When used with\n COMPOSER_OVERLAY, the system will try to prioritize the buffer receiving\n an overlay plane & avoid caching it in intermediate composition buffers."]
pub const AHardwareBuffer_UsageFlags_AHARDWAREBUFFER_USAGE_VENDOR_11: AHardwareBuffer_UsageFlags =
    36028797018963968;
#[doc = " Usage: The buffer is used for front-buffer rendering. When\n front-buffering rendering is specified, different usages may adjust their\n behavior as a result. For example, when used as GPU_COLOR_OUTPUT the buffer\n will behave similar to a single-buffered window. When used with\n COMPOSER_OVERLAY, the system will try to prioritize the buffer receiving\n an overlay plane & avoid caching it in intermediate composition buffers."]
pub const AHardwareBuffer_UsageFlags_AHARDWAREBUFFER_USAGE_VENDOR_12: AHardwareBuffer_UsageFlags =
    72057594037927936;
#[doc = " Usage: The buffer is used for front-buffer rendering. When\n front-buffering rendering is specified, different usages may adjust their\n behavior as a result. For example, when used as GPU_COLOR_OUTPUT the buffer\n will behave similar to a single-buffered window. When used with\n COMPOSER_OVERLAY, the system will try to prioritize the buffer receiving\n an overlay plane & avoid caching it in intermediate composition buffers."]
pub const AHardwareBuffer_UsageFlags_AHARDWAREBUFFER_USAGE_VENDOR_13: AHardwareBuffer_UsageFlags =
    144115188075855872;
#[doc = " Usage: The buffer is used for front-buffer rendering. When\n front-buffering rendering is specified, different usages may adjust their\n behavior as a result. For example, when used as GPU_COLOR_OUTPUT the buffer\n will behave similar to a single-buffered window. When used with\n COMPOSER_OVERLAY, the system will try to prioritize the buffer receiving\n an overlay plane & avoid caching it in intermediate composition buffers."]
pub const AHardwareBuffer_UsageFlags_AHARDWAREBUFFER_USAGE_VENDOR_14: AHardwareBuffer_UsageFlags =
    288230376151711744;
#[doc = " Usage: The buffer is used for front-buffer rendering. When\n front-buffering rendering is specified, different usages may adjust their\n behavior as a result. For example, when used as GPU_COLOR_OUTPUT the buffer\n will behave similar to a single-buffered window. When used with\n COMPOSER_OVERLAY, the system will try to prioritize the buffer receiving\n an overlay plane & avoid caching it in intermediate composition buffers."]
pub const AHardwareBuffer_UsageFlags_AHARDWAREBUFFER_USAGE_VENDOR_15: AHardwareBuffer_UsageFlags =
    576460752303423488;
#[doc = " Usage: The buffer is used for front-buffer rendering. When\n front-buffering rendering is specified, different usages may adjust their\n behavior as a result. For example, when used as GPU_COLOR_OUTPUT the buffer\n will behave similar to a single-buffered window. When used with\n COMPOSER_OVERLAY, the system will try to prioritize the buffer receiving\n an overlay plane & avoid caching it in intermediate composition buffers."]
pub const AHardwareBuffer_UsageFlags_AHARDWAREBUFFER_USAGE_VENDOR_16: AHardwareBuffer_UsageFlags =
    1152921504606846976;
#[doc = " Usage: The buffer is used for front-buffer rendering. When\n front-buffering rendering is specified, different usages may adjust their\n behavior as a result. For example, when used as GPU_COLOR_OUTPUT the buffer\n will behave similar to a single-buffered window. When used with\n COMPOSER_OVERLAY, the system will try to prioritize the buffer receiving\n an overlay plane & avoid caching it in intermediate composition buffers."]
pub const AHardwareBuffer_UsageFlags_AHARDWAREBUFFER_USAGE_VENDOR_17: AHardwareBuffer_UsageFlags =
    2305843009213693952;
#[doc = " Usage: The buffer is used for front-buffer rendering. When\n front-buffering rendering is specified, different usages may adjust their\n behavior as a result. For example, when used as GPU_COLOR_OUTPUT the buffer\n will behave similar to a single-buffered window. When used with\n COMPOSER_OVERLAY, the system will try to prioritize the buffer receiving\n an overlay plane & avoid caching it in intermediate composition buffers."]
pub const AHardwareBuffer_UsageFlags_AHARDWAREBUFFER_USAGE_VENDOR_18: AHardwareBuffer_UsageFlags =
    4611686018427387904;
#[doc = " Usage: The buffer is used for front-buffer rendering. When\n front-buffering rendering is specified, different usages may adjust their\n behavior as a result. For example, when used as GPU_COLOR_OUTPUT the buffer\n will behave similar to a single-buffered window. When used with\n COMPOSER_OVERLAY, the system will try to prioritize the buffer receiving\n an overlay plane & avoid caching it in intermediate composition buffers."]
pub const AHardwareBuffer_UsageFlags_AHARDWAREBUFFER_USAGE_VENDOR_19: AHardwareBuffer_UsageFlags =
    9223372036854775808;
#[doc = " Buffer usage flags, specifying how the buffer will be accessed."]
pub type AHardwareBuffer_UsageFlags = ::std::os::raw::c_ulong;
#[doc = " Buffer description. Used for allocating new buffers and querying\n parameters of existing ones."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct AHardwareBuffer_Desc {
    #[doc = "< Width in pixels."]
    pub width: u32,
    #[doc = "< Height in pixels."]
    pub height: u32,
    #[doc = " Number of images in an image array. AHardwareBuffers with one\n layer correspond to regular 2D textures. AHardwareBuffers with\n more than layer correspond to texture arrays. If the layer count\n is a multiple of 6 and the usage flag\n AHARDWAREBUFFER_USAGE_GPU_CUBE_MAP is present, the buffer is\n a cube map or a cube map array."]
    pub layers: u32,
    #[doc = "< One of AHardwareBuffer_Format."]
    pub format: u32,
    #[doc = "< Combination of AHardwareBuffer_UsageFlags."]
    pub usage: u64,
    #[doc = "< Row stride in pixels, ignored for AHardwareBuffer_allocate()"]
    pub stride: u32,
    #[doc = "< Initialize to zero, reserved for future use."]
    pub rfu0: u32,
    #[doc = "< Initialize to zero, reserved for future use."]
    pub rfu1: u64,
}
#[test]
fn bindgen_test_layout_AHardwareBuffer_Desc() {
    const UNINIT: ::std::mem::MaybeUninit<AHardwareBuffer_Desc> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<AHardwareBuffer_Desc>(),
        40usize,
        concat!("Size of: ", stringify!(AHardwareBuffer_Desc))
    );
    assert_eq!(
        ::std::mem::align_of::<AHardwareBuffer_Desc>(),
        8usize,
        concat!("Alignment of ", stringify!(AHardwareBuffer_Desc))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).width) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AHardwareBuffer_Desc),
            "::",
            stringify!(width)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).height) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(AHardwareBuffer_Desc),
            "::",
            stringify!(height)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).layers) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(AHardwareBuffer_Desc),
            "::",
            stringify!(layers)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).format) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(AHardwareBuffer_Desc),
            "::",
            stringify!(format)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).usage) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(AHardwareBuffer_Desc),
            "::",
            stringify!(usage)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).stride) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(AHardwareBuffer_Desc),
            "::",
            stringify!(stride)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rfu0) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(AHardwareBuffer_Desc),
            "::",
            stringify!(rfu0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rfu1) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(AHardwareBuffer_Desc),
            "::",
            stringify!(rfu1)
        )
    );
}
#[doc = " Holds data for a single image plane."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct AHardwareBuffer_Plane {
    #[doc = "< Points to first byte in plane"]
    pub data: *mut ::std::os::raw::c_void,
    #[doc = "< Distance in bytes from the color channel of one pixel to the next"]
    pub pixelStride: u32,
    #[doc = "< Distance in bytes from the first value of one row of the image to"]
    pub rowStride: u32,
}
#[test]
fn bindgen_test_layout_AHardwareBuffer_Plane() {
    const UNINIT: ::std::mem::MaybeUninit<AHardwareBuffer_Plane> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<AHardwareBuffer_Plane>(),
        16usize,
        concat!("Size of: ", stringify!(AHardwareBuffer_Plane))
    );
    assert_eq!(
        ::std::mem::align_of::<AHardwareBuffer_Plane>(),
        8usize,
        concat!("Alignment of ", stringify!(AHardwareBuffer_Plane))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AHardwareBuffer_Plane),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pixelStride) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(AHardwareBuffer_Plane),
            "::",
            stringify!(pixelStride)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rowStride) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(AHardwareBuffer_Plane),
            "::",
            stringify!(rowStride)
        )
    );
}
#[doc = " Holds all image planes that contain the pixel data."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct AHardwareBuffer_Planes {
    #[doc = "< Number of distinct planes"]
    pub planeCount: u32,
    #[doc = "< Array of image planes"]
    pub planes: [AHardwareBuffer_Plane; 4usize],
}
#[test]
fn bindgen_test_layout_AHardwareBuffer_Planes() {
    const UNINIT: ::std::mem::MaybeUninit<AHardwareBuffer_Planes> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<AHardwareBuffer_Planes>(),
        72usize,
        concat!("Size of: ", stringify!(AHardwareBuffer_Planes))
    );
    assert_eq!(
        ::std::mem::align_of::<AHardwareBuffer_Planes>(),
        8usize,
        concat!("Alignment of ", stringify!(AHardwareBuffer_Planes))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).planeCount) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AHardwareBuffer_Planes),
            "::",
            stringify!(planeCount)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).planes) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(AHardwareBuffer_Planes),
            "::",
            stringify!(planes)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct AHardwareBuffer {
    _unused: [u8; 0],
}
extern "C" {
    #[doc = " Allocates a buffer that matches the passed AHardwareBuffer_Desc.\n\n If allocation succeeds, the buffer can be used according to the\n usage flags specified in its description. If a buffer is used in ways\n not compatible with its usage flags, the results are undefined and\n may include program termination.\n\n Available since API level 26.\n\n \\return 0 on success, or an error number of the allocation fails for\n any reason. The returned buffer has a reference count of 1."]
    pub fn AHardwareBuffer_allocate(
        desc: *const AHardwareBuffer_Desc,
        outBuffer: *mut *mut AHardwareBuffer,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Acquire a reference on the given AHardwareBuffer object.\n\n This prevents the object from being deleted until the last reference\n is removed.\n\n Available since API level 26."]
    pub fn AHardwareBuffer_acquire(buffer: *mut AHardwareBuffer);
}
extern "C" {
    #[doc = " Remove a reference that was previously acquired with\n AHardwareBuffer_acquire() or AHardwareBuffer_allocate().\n\n Available since API level 26."]
    pub fn AHardwareBuffer_release(buffer: *mut AHardwareBuffer);
}
extern "C" {
    #[doc = " Return a description of the AHardwareBuffer in the passed\n AHardwareBuffer_Desc struct.\n\n Available since API level 26."]
    pub fn AHardwareBuffer_describe(
        buffer: *const AHardwareBuffer,
        outDesc: *mut AHardwareBuffer_Desc,
    );
}
extern "C" {
    #[doc = " Lock the AHardwareBuffer for direct CPU access.\n\n This function can lock the buffer for either reading or writing.\n It may block if the hardware needs to finish rendering, if CPU caches\n need to be synchronized, or possibly for other implementation-\n specific reasons.\n\n The passed AHardwareBuffer must have one layer, otherwise the call\n will fail.\n\n If \\a fence is not negative, it specifies a fence file descriptor on\n which to wait before locking the buffer. If it's negative, the caller\n is responsible for ensuring that writes to the buffer have completed\n before calling this function.  Using this parameter is more efficient\n than waiting on the fence and then calling this function.\n\n The \\a usage parameter may only specify AHARDWAREBUFFER_USAGE_CPU_*.\n If set, then outVirtualAddress is filled with the address of the\n buffer in virtual memory. The flags must also be compatible with\n usage flags specified at buffer creation: if a read flag is passed,\n the buffer must have been created with\n AHARDWAREBUFFER_USAGE_CPU_READ_RARELY or\n AHARDWAREBUFFER_USAGE_CPU_READ_OFTEN. If a write flag is passed, it\n must have been created with AHARDWAREBUFFER_USAGE_CPU_WRITE_RARELY or\n AHARDWAREBUFFER_USAGE_CPU_WRITE_OFTEN.\n\n If \\a rect is not NULL, the caller promises to modify only data in\n the area specified by rect. If rect is NULL, the caller may modify\n the contents of the entire buffer. The content of the buffer outside\n of the specified rect is NOT modified by this call.\n\n It is legal for several different threads to lock a buffer for read\n access; none of the threads are blocked.\n\n Locking a buffer simultaneously for write or read/write is undefined,\n but will neither terminate the process nor block the caller.\n AHardwareBuffer_lock may return an error or leave the buffer's\n content in an indeterminate state.\n\n If the buffer has AHARDWAREBUFFER_FORMAT_BLOB, it is legal lock it\n for reading and writing in multiple threads and/or processes\n simultaneously, and the contents of the buffer behave like shared\n memory.\n\n Available since API level 26.\n\n \\return 0 on success. -EINVAL if \\a buffer is NULL, the usage flags\n are not a combination of AHARDWAREBUFFER_USAGE_CPU_*, or the buffer\n has more than one layer. Error number if the lock fails for any other\n reason."]
    pub fn AHardwareBuffer_lock(
        buffer: *mut AHardwareBuffer,
        usage: u64,
        fence: i32,
        rect: *const ARect,
        outVirtualAddress: *mut *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Unlock the AHardwareBuffer from direct CPU access.\n\n Must be called after all changes to the buffer are completed by the\n caller.  If \\a fence is NULL, the function will block until all work\n is completed.  Otherwise, \\a fence will be set either to a valid file\n descriptor or to -1.  The file descriptor will become signaled once\n the unlocking is complete and buffer contents are updated.\n The caller is responsible for closing the file descriptor once it's\n no longer needed.  The value -1 indicates that unlocking has already\n completed before the function returned and no further operations are\n necessary.\n\n Available since API level 26.\n\n \\return 0 on success. -EINVAL if \\a buffer is NULL. Error number if\n the unlock fails for any reason."]
    pub fn AHardwareBuffer_unlock(
        buffer: *mut AHardwareBuffer,
        fence: *mut i32,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Send the AHardwareBuffer to an AF_UNIX socket.\n\n Available since API level 26.\n\n \\return 0 on success, -EINVAL if \\a buffer is NULL, or an error\n number if the operation fails for any reason."]
    pub fn AHardwareBuffer_sendHandleToUnixSocket(
        buffer: *const AHardwareBuffer,
        socketFd: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Receive an AHardwareBuffer from an AF_UNIX socket.\n\n Available since API level 26.\n\n \\return 0 on success, -EINVAL if \\a outBuffer is NULL, or an error\n number if the operation fails for any reason."]
    pub fn AHardwareBuffer_recvHandleFromUnixSocket(
        socketFd: ::std::os::raw::c_int,
        outBuffer: *mut *mut AHardwareBuffer,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Lock a potentially multi-planar AHardwareBuffer for direct CPU access.\n\n This function is similar to AHardwareBuffer_lock, but can lock multi-planar\n formats. The locked planes are returned in the \\a outPlanes argument. Note,\n that multi-planar should not be confused with multi-layer images, which this\n locking function does not support.\n\n YUV formats are always represented by three separate planes of data, one for\n each color plane. The order of planes in the array is guaranteed such that\n plane #0 is always Y, plane #1 is always U (Cb), and plane #2 is always V\n (Cr). All other formats are represented by a single plane.\n\n Additional information always accompanies the buffers, describing the row\n stride and the pixel stride for each plane.\n\n In case the buffer cannot be locked, \\a outPlanes will contain zero planes.\n\n See the AHardwareBuffer_lock documentation for all other locking semantics.\n\n Available since API level 29.\n\n \\return 0 on success. -EINVAL if \\a buffer is NULL, the usage flags\n are not a combination of AHARDWAREBUFFER_USAGE_CPU_*, or the buffer\n has more than one layer. Error number if the lock fails for any other\n reason."]
    pub fn AHardwareBuffer_lockPlanes(
        buffer: *mut AHardwareBuffer,
        usage: u64,
        fence: i32,
        rect: *const ARect,
        outPlanes: *mut AHardwareBuffer_Planes,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Test whether the given format and usage flag combination is\n allocatable.\n\n If this function returns true, it means that a buffer with the given\n description can be allocated on this implementation, unless resource\n exhaustion occurs. If this function returns false, it means that the\n allocation of the given description will never succeed.\n\n The return value of this function may depend on all fields in the\n description, except stride, which is always ignored. For example,\n some implementations have implementation-defined limits on texture\n size and layer count.\n\n Available since API level 29.\n\n \\return 1 if the format and usage flag combination is allocatable,\n     0 otherwise."]
    pub fn AHardwareBuffer_isSupported(desc: *const AHardwareBuffer_Desc) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Lock an AHardwareBuffer for direct CPU access.\n\n This function is the same as the above lock function, but passes back\n additional information about the bytes per pixel and the bytes per stride\n of the locked buffer.  If the bytes per pixel or bytes per stride are unknown\n or variable, or if the underlying mapper implementation does not support returning\n additional information, then this call will fail with INVALID_OPERATION\n\n Available since API level 29."]
    pub fn AHardwareBuffer_lockAndGetInfo(
        buffer: *mut AHardwareBuffer,
        usage: u64,
        fence: i32,
        rect: *const ARect,
        outVirtualAddress: *mut *mut ::std::os::raw::c_void,
        outBytesPerPixel: *mut i32,
        outBytesPerStride: *mut i32,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Get the system wide unique id for an AHardwareBuffer.\n\n Available since API level 31.\n\n \\return 0 on success, -EINVAL if \\a buffer or \\a outId is NULL, or an error number if the\n operation fails for any reason."]
    pub fn AHardwareBuffer_getId(
        buffer: *const AHardwareBuffer,
        outId: *mut u64,
    ) -> ::std::os::raw::c_int;
}
pub type va_list = __builtin_va_list;
pub type __gnuc_va_list = __builtin_va_list;
pub type jboolean = u8;
pub type jbyte = i8;
pub type jchar = u16;
pub type jshort = i16;
pub type jint = i32;
pub type jlong = i64;
pub type jfloat = f32;
pub type jdouble = f64;
pub type jsize = jint;
pub type jobject = *mut ::std::os::raw::c_void;
pub type jclass = jobject;
pub type jstring = jobject;
pub type jarray = jobject;
pub type jobjectArray = jarray;
pub type jbooleanArray = jarray;
pub type jbyteArray = jarray;
pub type jcharArray = jarray;
pub type jshortArray = jarray;
pub type jintArray = jarray;
pub type jlongArray = jarray;
pub type jfloatArray = jarray;
pub type jdoubleArray = jarray;
pub type jthrowable = jobject;
pub type jweak = jobject;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _jfieldID {
    _unused: [u8; 0],
}
pub type jfieldID = *mut _jfieldID;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _jmethodID {
    _unused: [u8; 0],
}
pub type jmethodID = *mut _jmethodID;
#[repr(C)]
#[derive(Copy, Clone)]
pub union jvalue {
    pub z: jboolean,
    pub b: jbyte,
    pub c: jchar,
    pub s: jshort,
    pub i: jint,
    pub j: jlong,
    pub f: jfloat,
    pub d: jdouble,
    pub l: jobject,
}
#[test]
fn bindgen_test_layout_jvalue() {
    const UNINIT: ::std::mem::MaybeUninit<jvalue> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<jvalue>(),
        8usize,
        concat!("Size of: ", stringify!(jvalue))
    );
    assert_eq!(
        ::std::mem::align_of::<jvalue>(),
        8usize,
        concat!("Alignment of ", stringify!(jvalue))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).z) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(jvalue), "::", stringify!(z))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).b) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(jvalue), "::", stringify!(b))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).c) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(jvalue), "::", stringify!(c))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).s) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(jvalue), "::", stringify!(s))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).i) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(jvalue), "::", stringify!(i))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).j) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(jvalue), "::", stringify!(j))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).f) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(jvalue), "::", stringify!(f))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).d) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(jvalue), "::", stringify!(d))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).l) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(jvalue), "::", stringify!(l))
    );
}
pub const jobjectRefType_JNIInvalidRefType: jobjectRefType = 0;
pub const jobjectRefType_JNILocalRefType: jobjectRefType = 1;
pub const jobjectRefType_JNIGlobalRefType: jobjectRefType = 2;
pub const jobjectRefType_JNIWeakGlobalRefType: jobjectRefType = 3;
pub type jobjectRefType = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct JNINativeMethod {
    pub name: *const ::std::os::raw::c_char,
    pub signature: *const ::std::os::raw::c_char,
    pub fnPtr: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_JNINativeMethod() {
    const UNINIT: ::std::mem::MaybeUninit<JNINativeMethod> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<JNINativeMethod>(),
        24usize,
        concat!("Size of: ", stringify!(JNINativeMethod))
    );
    assert_eq!(
        ::std::mem::align_of::<JNINativeMethod>(),
        8usize,
        concat!("Alignment of ", stringify!(JNINativeMethod))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeMethod),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).signature) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeMethod),
            "::",
            stringify!(signature)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fnPtr) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeMethod),
            "::",
            stringify!(fnPtr)
        )
    );
}
pub type C_JNIEnv = *const JNINativeInterface;
pub type JNIEnv = *const JNINativeInterface;
pub type JavaVM = *const JNIInvokeInterface;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct JNINativeInterface {
    pub reserved0: *mut ::std::os::raw::c_void,
    pub reserved1: *mut ::std::os::raw::c_void,
    pub reserved2: *mut ::std::os::raw::c_void,
    pub reserved3: *mut ::std::os::raw::c_void,
    pub GetVersion: ::std::option::Option<unsafe extern "C" fn(arg1: *mut JNIEnv) -> jint>,
    pub DefineClass: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut JNIEnv,
            arg2: *const ::std::os::raw::c_char,
            arg3: jobject,
            arg4: *const jbyte,
            arg5: jsize,
        ) -> jclass,
    >,
    pub FindClass: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut JNIEnv, arg2: *const ::std::os::raw::c_char) -> jclass,
    >,
    pub FromReflectedMethod:
        ::std::option::Option<unsafe extern "C" fn(arg1: *mut JNIEnv, arg2: jobject) -> jmethodID>,
    pub FromReflectedField:
        ::std::option::Option<unsafe extern "C" fn(arg1: *mut JNIEnv, arg2: jobject) -> jfieldID>,
    pub ToReflectedMethod: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut JNIEnv,
            arg2: jclass,
            arg3: jmethodID,
            arg4: jboolean,
        ) -> jobject,
    >,
    pub GetSuperclass:
        ::std::option::Option<unsafe extern "C" fn(arg1: *mut JNIEnv, arg2: jclass) -> jclass>,
    pub IsAssignableFrom: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut JNIEnv, arg2: jclass, arg3: jclass) -> jboolean,
    >,
    pub ToReflectedField: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut JNIEnv,
            arg2: jclass,
            arg3: jfieldID,
            arg4: jboolean,
        ) -> jobject,
    >,
    pub Throw:
        ::std::option::Option<unsafe extern "C" fn(arg1: *mut JNIEnv, arg2: jthrowable) -> jint>,
    pub ThrowNew: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut JNIEnv,
            arg2: jclass,
            arg3: *const ::std::os::raw::c_char,
        ) -> jint,
    >,
    pub ExceptionOccurred:
        ::std::option::Option<unsafe extern "C" fn(arg1: *mut JNIEnv) -> jthrowable>,
    pub ExceptionDescribe: ::std::option::Option<unsafe extern "C" fn(arg1: *mut JNIEnv)>,
    pub ExceptionClear: ::std::option::Option<unsafe extern "C" fn(arg1: *mut JNIEnv)>,
    pub FatalError: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut JNIEnv, arg2: *const ::std::os::raw::c_char),
    >,
    pub PushLocalFrame:
        ::std::option::Option<unsafe extern "C" fn(arg1: *mut JNIEnv, arg2: jint) -> jint>,
    pub PopLocalFrame:
        ::std::option::Option<unsafe extern "C" fn(arg1: *mut JNIEnv, arg2: jobject) -> jobject>,
    pub NewGlobalRef:
        ::std::option::Option<unsafe extern "C" fn(arg1: *mut JNIEnv, arg2: jobject) -> jobject>,
    pub DeleteGlobalRef:
        ::std::option::Option<unsafe extern "C" fn(arg1: *mut JNIEnv, arg2: jobject)>,
    pub DeleteLocalRef:
        ::std::option::Option<unsafe extern "C" fn(arg1: *mut JNIEnv, arg2: jobject)>,
    pub IsSameObject: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut JNIEnv, arg2: jobject, arg3: jobject) -> jboolean,
    >,
    pub NewLocalRef:
        ::std::option::Option<unsafe extern "C" fn(arg1: *mut JNIEnv, arg2: jobject) -> jobject>,
    pub EnsureLocalCapacity:
        ::std::option::Option<unsafe extern "C" fn(arg1: *mut JNIEnv, arg2: jint) -> jint>,
    pub AllocObject:
        ::std::option::Option<unsafe extern "C" fn(arg1: *mut JNIEnv, arg2: jclass) -> jobject>,
    pub NewObject: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut JNIEnv, arg2: jclass, arg3: jmethodID, ...) -> jobject,
    >,
    pub NewObjectV: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut JNIEnv,
            arg2: jclass,
            arg3: jmethodID,
            arg4: *mut __va_list_tag,
        ) -> jobject,
    >,
    pub NewObjectA: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut JNIEnv,
            arg2: jclass,
            arg3: jmethodID,
            arg4: *const jvalue,
        ) -> jobject,
    >,
    pub GetObjectClass:
        ::std::option::Option<unsafe extern "C" fn(arg1: *mut JNIEnv, arg2: jobject) -> jclass>,
    pub IsInstanceOf: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut JNIEnv, arg2: jobject, arg3: jclass) -> jboolean,
    >,
    pub GetMethodID: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut JNIEnv,
            arg2: jclass,
            arg3: *const ::std::os::raw::c_char,
            arg4: *const ::std::os::raw::c_char,
        ) -> jmethodID,
    >,
    pub CallObjectMethod: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut JNIEnv, arg2: jobject, arg3: jmethodID, ...) -> jobject,
    >,
    pub CallObjectMethodV: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut JNIEnv,
            arg2: jobject,
            arg3: jmethodID,
            arg4: *mut __va_list_tag,
        ) -> jobject,
    >,
    pub CallObjectMethodA: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut JNIEnv,
            arg2: jobject,
            arg3: jmethodID,
            arg4: *const jvalue,
        ) -> jobject,
    >,
    pub CallBooleanMethod: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut JNIEnv, arg2: jobject, arg3: jmethodID, ...) -> jboolean,
    >,
    pub CallBooleanMethodV: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut JNIEnv,
            arg2: jobject,
            arg3: jmethodID,
            arg4: *mut __va_list_tag,
        ) -> jboolean,
    >,
    pub CallBooleanMethodA: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut JNIEnv,
            arg2: jobject,
            arg3: jmethodID,
            arg4: *const jvalue,
        ) -> jboolean,
    >,
    pub CallByteMethod: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut JNIEnv, arg2: jobject, arg3: jmethodID, ...) -> jbyte,
    >,
    pub CallByteMethodV: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut JNIEnv,
            arg2: jobject,
            arg3: jmethodID,
            arg4: *mut __va_list_tag,
        ) -> jbyte,
    >,
    pub CallByteMethodA: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut JNIEnv,
            arg2: jobject,
            arg3: jmethodID,
            arg4: *const jvalue,
        ) -> jbyte,
    >,
    pub CallCharMethod: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut JNIEnv, arg2: jobject, arg3: jmethodID, ...) -> jchar,
    >,
    pub CallCharMethodV: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut JNIEnv,
            arg2: jobject,
            arg3: jmethodID,
            arg4: *mut __va_list_tag,
        ) -> jchar,
    >,
    pub CallCharMethodA: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut JNIEnv,
            arg2: jobject,
            arg3: jmethodID,
            arg4: *const jvalue,
        ) -> jchar,
    >,
    pub CallShortMethod: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut JNIEnv, arg2: jobject, arg3: jmethodID, ...) -> jshort,
    >,
    pub CallShortMethodV: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut JNIEnv,
            arg2: jobject,
            arg3: jmethodID,
            arg4: *mut __va_list_tag,
        ) -> jshort,
    >,
    pub CallShortMethodA: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut JNIEnv,
            arg2: jobject,
            arg3: jmethodID,
            arg4: *const jvalue,
        ) -> jshort,
    >,
    pub CallIntMethod: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut JNIEnv, arg2: jobject, arg3: jmethodID, ...) -> jint,
    >,
    pub CallIntMethodV: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut JNIEnv,
            arg2: jobject,
            arg3: jmethodID,
            arg4: *mut __va_list_tag,
        ) -> jint,
    >,
    pub CallIntMethodA: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut JNIEnv,
            arg2: jobject,
            arg3: jmethodID,
            arg4: *const jvalue,
        ) -> jint,
    >,
    pub CallLongMethod: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut JNIEnv, arg2: jobject, arg3: jmethodID, ...) -> jlong,
    >,
    pub CallLongMethodV: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut JNIEnv,
            arg2: jobject,
            arg3: jmethodID,
            arg4: *mut __va_list_tag,
        ) -> jlong,
    >,
    pub CallLongMethodA: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut JNIEnv,
            arg2: jobject,
            arg3: jmethodID,
            arg4: *const jvalue,
        ) -> jlong,
    >,
    pub CallFloatMethod: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut JNIEnv, arg2: jobject, arg3: jmethodID, ...) -> jfloat,
    >,
    pub CallFloatMethodV: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut JNIEnv,
            arg2: jobject,
            arg3: jmethodID,
            arg4: *mut __va_list_tag,
        ) -> jfloat,
    >,
    pub CallFloatMethodA: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut JNIEnv,
            arg2: jobject,
            arg3: jmethodID,
            arg4: *const jvalue,
        ) -> jfloat,
    >,
    pub CallDoubleMethod: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut JNIEnv, arg2: jobject, arg3: jmethodID, ...) -> jdouble,
    >,
    pub CallDoubleMethodV: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut JNIEnv,
            arg2: jobject,
            arg3: jmethodID,
            arg4: *mut __va_list_tag,
        ) -> jdouble,
    >,
    pub CallDoubleMethodA: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut JNIEnv,
            arg2: jobject,
            arg3: jmethodID,
            arg4: *const jvalue,
        ) -> jdouble,
    >,
    pub CallVoidMethod: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut JNIEnv, arg2: jobject, arg3: jmethodID, ...),
    >,
    pub CallVoidMethodV: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut JNIEnv,
            arg2: jobject,
            arg3: jmethodID,
            arg4: *mut __va_list_tag,
        ),
    >,
    pub CallVoidMethodA: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut JNIEnv,
            arg2: jobject,
            arg3: jmethodID,
            arg4: *const jvalue,
        ),
    >,
    pub CallNonvirtualObjectMethod: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut JNIEnv,
            arg2: jobject,
            arg3: jclass,
            arg4: jmethodID,
            ...
        ) -> jobject,
    >,
    pub CallNonvirtualObjectMethodV: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut JNIEnv,
            arg2: jobject,
            arg3: jclass,
            arg4: jmethodID,
            arg5: *mut __va_list_tag,
        ) -> jobject,
    >,
    pub CallNonvirtualObjectMethodA: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut JNIEnv,
            arg2: jobject,
            arg3: jclass,
            arg4: jmethodID,
            arg5: *const jvalue,
        ) -> jobject,
    >,
    pub CallNonvirtualBooleanMethod: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut JNIEnv,
            arg2: jobject,
            arg3: jclass,
            arg4: jmethodID,
            ...
        ) -> jboolean,
    >,
    pub CallNonvirtualBooleanMethodV: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut JNIEnv,
            arg2: jobject,
            arg3: jclass,
            arg4: jmethodID,
            arg5: *mut __va_list_tag,
        ) -> jboolean,
    >,
    pub CallNonvirtualBooleanMethodA: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut JNIEnv,
            arg2: jobject,
            arg3: jclass,
            arg4: jmethodID,
            arg5: *const jvalue,
        ) -> jboolean,
    >,
    pub CallNonvirtualByteMethod: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut JNIEnv,
            arg2: jobject,
            arg3: jclass,
            arg4: jmethodID,
            ...
        ) -> jbyte,
    >,
    pub CallNonvirtualByteMethodV: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut JNIEnv,
            arg2: jobject,
            arg3: jclass,
            arg4: jmethodID,
            arg5: *mut __va_list_tag,
        ) -> jbyte,
    >,
    pub CallNonvirtualByteMethodA: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut JNIEnv,
            arg2: jobject,
            arg3: jclass,
            arg4: jmethodID,
            arg5: *const jvalue,
        ) -> jbyte,
    >,
    pub CallNonvirtualCharMethod: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut JNIEnv,
            arg2: jobject,
            arg3: jclass,
            arg4: jmethodID,
            ...
        ) -> jchar,
    >,
    pub CallNonvirtualCharMethodV: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut JNIEnv,
            arg2: jobject,
            arg3: jclass,
            arg4: jmethodID,
            arg5: *mut __va_list_tag,
        ) -> jchar,
    >,
    pub CallNonvirtualCharMethodA: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut JNIEnv,
            arg2: jobject,
            arg3: jclass,
            arg4: jmethodID,
            arg5: *const jvalue,
        ) -> jchar,
    >,
    pub CallNonvirtualShortMethod: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut JNIEnv,
            arg2: jobject,
            arg3: jclass,
            arg4: jmethodID,
            ...
        ) -> jshort,
    >,
    pub CallNonvirtualShortMethodV: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut JNIEnv,
            arg2: jobject,
            arg3: jclass,
            arg4: jmethodID,
            arg5: *mut __va_list_tag,
        ) -> jshort,
    >,
    pub CallNonvirtualShortMethodA: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut JNIEnv,
            arg2: jobject,
            arg3: jclass,
            arg4: jmethodID,
            arg5: *const jvalue,
        ) -> jshort,
    >,
    pub CallNonvirtualIntMethod: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut JNIEnv,
            arg2: jobject,
            arg3: jclass,
            arg4: jmethodID,
            ...
        ) -> jint,
    >,
    pub CallNonvirtualIntMethodV: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut JNIEnv,
            arg2: jobject,
            arg3: jclass,
            arg4: jmethodID,
            arg5: *mut __va_list_tag,
        ) -> jint,
    >,
    pub CallNonvirtualIntMethodA: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut JNIEnv,
            arg2: jobject,
            arg3: jclass,
            arg4: jmethodID,
            arg5: *const jvalue,
        ) -> jint,
    >,
    pub CallNonvirtualLongMethod: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut JNIEnv,
            arg2: jobject,
            arg3: jclass,
            arg4: jmethodID,
            ...
        ) -> jlong,
    >,
    pub CallNonvirtualLongMethodV: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut JNIEnv,
            arg2: jobject,
            arg3: jclass,
            arg4: jmethodID,
            arg5: *mut __va_list_tag,
        ) -> jlong,
    >,
    pub CallNonvirtualLongMethodA: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut JNIEnv,
            arg2: jobject,
            arg3: jclass,
            arg4: jmethodID,
            arg5: *const jvalue,
        ) -> jlong,
    >,
    pub CallNonvirtualFloatMethod: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut JNIEnv,
            arg2: jobject,
            arg3: jclass,
            arg4: jmethodID,
            ...
        ) -> jfloat,
    >,
    pub CallNonvirtualFloatMethodV: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut JNIEnv,
            arg2: jobject,
            arg3: jclass,
            arg4: jmethodID,
            arg5: *mut __va_list_tag,
        ) -> jfloat,
    >,
    pub CallNonvirtualFloatMethodA: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut JNIEnv,
            arg2: jobject,
            arg3: jclass,
            arg4: jmethodID,
            arg5: *const jvalue,
        ) -> jfloat,
    >,
    pub CallNonvirtualDoubleMethod: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut JNIEnv,
            arg2: jobject,
            arg3: jclass,
            arg4: jmethodID,
            ...
        ) -> jdouble,
    >,
    pub CallNonvirtualDoubleMethodV: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut JNIEnv,
            arg2: jobject,
            arg3: jclass,
            arg4: jmethodID,
            arg5: *mut __va_list_tag,
        ) -> jdouble,
    >,
    pub CallNonvirtualDoubleMethodA: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut JNIEnv,
            arg2: jobject,
            arg3: jclass,
            arg4: jmethodID,
            arg5: *const jvalue,
        ) -> jdouble,
    >,
    pub CallNonvirtualVoidMethod: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut JNIEnv, arg2: jobject, arg3: jclass, arg4: jmethodID, ...),
    >,
    pub CallNonvirtualVoidMethodV: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut JNIEnv,
            arg2: jobject,
            arg3: jclass,
            arg4: jmethodID,
            arg5: *mut __va_list_tag,
        ),
    >,
    pub CallNonvirtualVoidMethodA: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut JNIEnv,
            arg2: jobject,
            arg3: jclass,
            arg4: jmethodID,
            arg5: *const jvalue,
        ),
    >,
    pub GetFieldID: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut JNIEnv,
            arg2: jclass,
            arg3: *const ::std::os::raw::c_char,
            arg4: *const ::std::os::raw::c_char,
        ) -> jfieldID,
    >,
    pub GetObjectField: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut JNIEnv, arg2: jobject, arg3: jfieldID) -> jobject,
    >,
    pub GetBooleanField: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut JNIEnv, arg2: jobject, arg3: jfieldID) -> jboolean,
    >,
    pub GetByteField: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut JNIEnv, arg2: jobject, arg3: jfieldID) -> jbyte,
    >,
    pub GetCharField: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut JNIEnv, arg2: jobject, arg3: jfieldID) -> jchar,
    >,
    pub GetShortField: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut JNIEnv, arg2: jobject, arg3: jfieldID) -> jshort,
    >,
    pub GetIntField: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut JNIEnv, arg2: jobject, arg3: jfieldID) -> jint,
    >,
    pub GetLongField: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut JNIEnv, arg2: jobject, arg3: jfieldID) -> jlong,
    >,
    pub GetFloatField: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut JNIEnv, arg2: jobject, arg3: jfieldID) -> jfloat,
    >,
    pub GetDoubleField: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut JNIEnv, arg2: jobject, arg3: jfieldID) -> jdouble,
    >,
    pub SetObjectField: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut JNIEnv, arg2: jobject, arg3: jfieldID, arg4: jobject),
    >,
    pub SetBooleanField: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut JNIEnv, arg2: jobject, arg3: jfieldID, arg4: jboolean),
    >,
    pub SetByteField: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut JNIEnv, arg2: jobject, arg3: jfieldID, arg4: jbyte),
    >,
    pub SetCharField: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut JNIEnv, arg2: jobject, arg3: jfieldID, arg4: jchar),
    >,
    pub SetShortField: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut JNIEnv, arg2: jobject, arg3: jfieldID, arg4: jshort),
    >,
    pub SetIntField: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut JNIEnv, arg2: jobject, arg3: jfieldID, arg4: jint),
    >,
    pub SetLongField: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut JNIEnv, arg2: jobject, arg3: jfieldID, arg4: jlong),
    >,
    pub SetFloatField: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut JNIEnv, arg2: jobject, arg3: jfieldID, arg4: jfloat),
    >,
    pub SetDoubleField: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut JNIEnv, arg2: jobject, arg3: jfieldID, arg4: jdouble),
    >,
    pub GetStaticMethodID: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut JNIEnv,
            arg2: jclass,
            arg3: *const ::std::os::raw::c_char,
            arg4: *const ::std::os::raw::c_char,
        ) -> jmethodID,
    >,
    pub CallStaticObjectMethod: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut JNIEnv, arg2: jclass, arg3: jmethodID, ...) -> jobject,
    >,
    pub CallStaticObjectMethodV: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut JNIEnv,
            arg2: jclass,
            arg3: jmethodID,
            arg4: *mut __va_list_tag,
        ) -> jobject,
    >,
    pub CallStaticObjectMethodA: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut JNIEnv,
            arg2: jclass,
            arg3: jmethodID,
            arg4: *const jvalue,
        ) -> jobject,
    >,
    pub CallStaticBooleanMethod: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut JNIEnv, arg2: jclass, arg3: jmethodID, ...) -> jboolean,
    >,
    pub CallStaticBooleanMethodV: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut JNIEnv,
            arg2: jclass,
            arg3: jmethodID,
            arg4: *mut __va_list_tag,
        ) -> jboolean,
    >,
    pub CallStaticBooleanMethodA: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut JNIEnv,
            arg2: jclass,
            arg3: jmethodID,
            arg4: *const jvalue,
        ) -> jboolean,
    >,
    pub CallStaticByteMethod: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut JNIEnv, arg2: jclass, arg3: jmethodID, ...) -> jbyte,
    >,
    pub CallStaticByteMethodV: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut JNIEnv,
            arg2: jclass,
            arg3: jmethodID,
            arg4: *mut __va_list_tag,
        ) -> jbyte,
    >,
    pub CallStaticByteMethodA: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut JNIEnv,
            arg2: jclass,
            arg3: jmethodID,
            arg4: *const jvalue,
        ) -> jbyte,
    >,
    pub CallStaticCharMethod: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut JNIEnv, arg2: jclass, arg3: jmethodID, ...) -> jchar,
    >,
    pub CallStaticCharMethodV: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut JNIEnv,
            arg2: jclass,
            arg3: jmethodID,
            arg4: *mut __va_list_tag,
        ) -> jchar,
    >,
    pub CallStaticCharMethodA: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut JNIEnv,
            arg2: jclass,
            arg3: jmethodID,
            arg4: *const jvalue,
        ) -> jchar,
    >,
    pub CallStaticShortMethod: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut JNIEnv, arg2: jclass, arg3: jmethodID, ...) -> jshort,
    >,
    pub CallStaticShortMethodV: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut JNIEnv,
            arg2: jclass,
            arg3: jmethodID,
            arg4: *mut __va_list_tag,
        ) -> jshort,
    >,
    pub CallStaticShortMethodA: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut JNIEnv,
            arg2: jclass,
            arg3: jmethodID,
            arg4: *const jvalue,
        ) -> jshort,
    >,
    pub CallStaticIntMethod: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut JNIEnv, arg2: jclass, arg3: jmethodID, ...) -> jint,
    >,
    pub CallStaticIntMethodV: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut JNIEnv,
            arg2: jclass,
            arg3: jmethodID,
            arg4: *mut __va_list_tag,
        ) -> jint,
    >,
    pub CallStaticIntMethodA: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut JNIEnv,
            arg2: jclass,
            arg3: jmethodID,
            arg4: *const jvalue,
        ) -> jint,
    >,
    pub CallStaticLongMethod: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut JNIEnv, arg2: jclass, arg3: jmethodID, ...) -> jlong,
    >,
    pub CallStaticLongMethodV: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut JNIEnv,
            arg2: jclass,
            arg3: jmethodID,
            arg4: *mut __va_list_tag,
        ) -> jlong,
    >,
    pub CallStaticLongMethodA: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut JNIEnv,
            arg2: jclass,
            arg3: jmethodID,
            arg4: *const jvalue,
        ) -> jlong,
    >,
    pub CallStaticFloatMethod: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut JNIEnv, arg2: jclass, arg3: jmethodID, ...) -> jfloat,
    >,
    pub CallStaticFloatMethodV: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut JNIEnv,
            arg2: jclass,
            arg3: jmethodID,
            arg4: *mut __va_list_tag,
        ) -> jfloat,
    >,
    pub CallStaticFloatMethodA: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut JNIEnv,
            arg2: jclass,
            arg3: jmethodID,
            arg4: *const jvalue,
        ) -> jfloat,
    >,
    pub CallStaticDoubleMethod: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut JNIEnv, arg2: jclass, arg3: jmethodID, ...) -> jdouble,
    >,
    pub CallStaticDoubleMethodV: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut JNIEnv,
            arg2: jclass,
            arg3: jmethodID,
            arg4: *mut __va_list_tag,
        ) -> jdouble,
    >,
    pub CallStaticDoubleMethodA: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut JNIEnv,
            arg2: jclass,
            arg3: jmethodID,
            arg4: *const jvalue,
        ) -> jdouble,
    >,
    pub CallStaticVoidMethod: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut JNIEnv, arg2: jclass, arg3: jmethodID, ...),
    >,
    pub CallStaticVoidMethodV: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut JNIEnv,
            arg2: jclass,
            arg3: jmethodID,
            arg4: *mut __va_list_tag,
        ),
    >,
    pub CallStaticVoidMethodA: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut JNIEnv, arg2: jclass, arg3: jmethodID, arg4: *const jvalue),
    >,
    pub GetStaticFieldID: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut JNIEnv,
            arg2: jclass,
            arg3: *const ::std::os::raw::c_char,
            arg4: *const ::std::os::raw::c_char,
        ) -> jfieldID,
    >,
    pub GetStaticObjectField: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut JNIEnv, arg2: jclass, arg3: jfieldID) -> jobject,
    >,
    pub GetStaticBooleanField: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut JNIEnv, arg2: jclass, arg3: jfieldID) -> jboolean,
    >,
    pub GetStaticByteField: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut JNIEnv, arg2: jclass, arg3: jfieldID) -> jbyte,
    >,
    pub GetStaticCharField: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut JNIEnv, arg2: jclass, arg3: jfieldID) -> jchar,
    >,
    pub GetStaticShortField: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut JNIEnv, arg2: jclass, arg3: jfieldID) -> jshort,
    >,
    pub GetStaticIntField: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut JNIEnv, arg2: jclass, arg3: jfieldID) -> jint,
    >,
    pub GetStaticLongField: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut JNIEnv, arg2: jclass, arg3: jfieldID) -> jlong,
    >,
    pub GetStaticFloatField: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut JNIEnv, arg2: jclass, arg3: jfieldID) -> jfloat,
    >,
    pub GetStaticDoubleField: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut JNIEnv, arg2: jclass, arg3: jfieldID) -> jdouble,
    >,
    pub SetStaticObjectField: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut JNIEnv, arg2: jclass, arg3: jfieldID, arg4: jobject),
    >,
    pub SetStaticBooleanField: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut JNIEnv, arg2: jclass, arg3: jfieldID, arg4: jboolean),
    >,
    pub SetStaticByteField: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut JNIEnv, arg2: jclass, arg3: jfieldID, arg4: jbyte),
    >,
    pub SetStaticCharField: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut JNIEnv, arg2: jclass, arg3: jfieldID, arg4: jchar),
    >,
    pub SetStaticShortField: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut JNIEnv, arg2: jclass, arg3: jfieldID, arg4: jshort),
    >,
    pub SetStaticIntField: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut JNIEnv, arg2: jclass, arg3: jfieldID, arg4: jint),
    >,
    pub SetStaticLongField: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut JNIEnv, arg2: jclass, arg3: jfieldID, arg4: jlong),
    >,
    pub SetStaticFloatField: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut JNIEnv, arg2: jclass, arg3: jfieldID, arg4: jfloat),
    >,
    pub SetStaticDoubleField: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut JNIEnv, arg2: jclass, arg3: jfieldID, arg4: jdouble),
    >,
    pub NewString: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut JNIEnv, arg2: *const jchar, arg3: jsize) -> jstring,
    >,
    pub GetStringLength:
        ::std::option::Option<unsafe extern "C" fn(arg1: *mut JNIEnv, arg2: jstring) -> jsize>,
    pub GetStringChars: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut JNIEnv, arg2: jstring, arg3: *mut jboolean) -> *const jchar,
    >,
    pub ReleaseStringChars: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut JNIEnv, arg2: jstring, arg3: *const jchar),
    >,
    pub NewStringUTF: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut JNIEnv, arg2: *const ::std::os::raw::c_char) -> jstring,
    >,
    pub GetStringUTFLength:
        ::std::option::Option<unsafe extern "C" fn(arg1: *mut JNIEnv, arg2: jstring) -> jsize>,
    pub GetStringUTFChars: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut JNIEnv,
            arg2: jstring,
            arg3: *mut jboolean,
        ) -> *const ::std::os::raw::c_char,
    >,
    pub ReleaseStringUTFChars: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut JNIEnv, arg2: jstring, arg3: *const ::std::os::raw::c_char),
    >,
    pub GetArrayLength:
        ::std::option::Option<unsafe extern "C" fn(arg1: *mut JNIEnv, arg2: jarray) -> jsize>,
    pub NewObjectArray: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut JNIEnv,
            arg2: jsize,
            arg3: jclass,
            arg4: jobject,
        ) -> jobjectArray,
    >,
    pub GetObjectArrayElement: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut JNIEnv, arg2: jobjectArray, arg3: jsize) -> jobject,
    >,
    pub SetObjectArrayElement: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut JNIEnv, arg2: jobjectArray, arg3: jsize, arg4: jobject),
    >,
    pub NewBooleanArray: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut JNIEnv, arg2: jsize) -> jbooleanArray,
    >,
    pub NewByteArray:
        ::std::option::Option<unsafe extern "C" fn(arg1: *mut JNIEnv, arg2: jsize) -> jbyteArray>,
    pub NewCharArray:
        ::std::option::Option<unsafe extern "C" fn(arg1: *mut JNIEnv, arg2: jsize) -> jcharArray>,
    pub NewShortArray:
        ::std::option::Option<unsafe extern "C" fn(arg1: *mut JNIEnv, arg2: jsize) -> jshortArray>,
    pub NewIntArray:
        ::std::option::Option<unsafe extern "C" fn(arg1: *mut JNIEnv, arg2: jsize) -> jintArray>,
    pub NewLongArray:
        ::std::option::Option<unsafe extern "C" fn(arg1: *mut JNIEnv, arg2: jsize) -> jlongArray>,
    pub NewFloatArray:
        ::std::option::Option<unsafe extern "C" fn(arg1: *mut JNIEnv, arg2: jsize) -> jfloatArray>,
    pub NewDoubleArray:
        ::std::option::Option<unsafe extern "C" fn(arg1: *mut JNIEnv, arg2: jsize) -> jdoubleArray>,
    pub GetBooleanArrayElements: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut JNIEnv,
            arg2: jbooleanArray,
            arg3: *mut jboolean,
        ) -> *mut jboolean,
    >,
    pub GetByteArrayElements: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut JNIEnv,
            arg2: jbyteArray,
            arg3: *mut jboolean,
        ) -> *mut jbyte,
    >,
    pub GetCharArrayElements: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut JNIEnv,
            arg2: jcharArray,
            arg3: *mut jboolean,
        ) -> *mut jchar,
    >,
    pub GetShortArrayElements: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut JNIEnv,
            arg2: jshortArray,
            arg3: *mut jboolean,
        ) -> *mut jshort,
    >,
    pub GetIntArrayElements: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut JNIEnv, arg2: jintArray, arg3: *mut jboolean) -> *mut jint,
    >,
    pub GetLongArrayElements: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut JNIEnv,
            arg2: jlongArray,
            arg3: *mut jboolean,
        ) -> *mut jlong,
    >,
    pub GetFloatArrayElements: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut JNIEnv,
            arg2: jfloatArray,
            arg3: *mut jboolean,
        ) -> *mut jfloat,
    >,
    pub GetDoubleArrayElements: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut JNIEnv,
            arg2: jdoubleArray,
            arg3: *mut jboolean,
        ) -> *mut jdouble,
    >,
    pub ReleaseBooleanArrayElements: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut JNIEnv,
            arg2: jbooleanArray,
            arg3: *mut jboolean,
            arg4: jint,
        ),
    >,
    pub ReleaseByteArrayElements: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut JNIEnv, arg2: jbyteArray, arg3: *mut jbyte, arg4: jint),
    >,
    pub ReleaseCharArrayElements: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut JNIEnv, arg2: jcharArray, arg3: *mut jchar, arg4: jint),
    >,
    pub ReleaseShortArrayElements: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut JNIEnv, arg2: jshortArray, arg3: *mut jshort, arg4: jint),
    >,
    pub ReleaseIntArrayElements: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut JNIEnv, arg2: jintArray, arg3: *mut jint, arg4: jint),
    >,
    pub ReleaseLongArrayElements: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut JNIEnv, arg2: jlongArray, arg3: *mut jlong, arg4: jint),
    >,
    pub ReleaseFloatArrayElements: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut JNIEnv, arg2: jfloatArray, arg3: *mut jfloat, arg4: jint),
    >,
    pub ReleaseDoubleArrayElements: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut JNIEnv, arg2: jdoubleArray, arg3: *mut jdouble, arg4: jint),
    >,
    pub GetBooleanArrayRegion: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut JNIEnv,
            arg2: jbooleanArray,
            arg3: jsize,
            arg4: jsize,
            arg5: *mut jboolean,
        ),
    >,
    pub GetByteArrayRegion: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut JNIEnv,
            arg2: jbyteArray,
            arg3: jsize,
            arg4: jsize,
            arg5: *mut jbyte,
        ),
    >,
    pub GetCharArrayRegion: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut JNIEnv,
            arg2: jcharArray,
            arg3: jsize,
            arg4: jsize,
            arg5: *mut jchar,
        ),
    >,
    pub GetShortArrayRegion: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut JNIEnv,
            arg2: jshortArray,
            arg3: jsize,
            arg4: jsize,
            arg5: *mut jshort,
        ),
    >,
    pub GetIntArrayRegion: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut JNIEnv,
            arg2: jintArray,
            arg3: jsize,
            arg4: jsize,
            arg5: *mut jint,
        ),
    >,
    pub GetLongArrayRegion: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut JNIEnv,
            arg2: jlongArray,
            arg3: jsize,
            arg4: jsize,
            arg5: *mut jlong,
        ),
    >,
    pub GetFloatArrayRegion: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut JNIEnv,
            arg2: jfloatArray,
            arg3: jsize,
            arg4: jsize,
            arg5: *mut jfloat,
        ),
    >,
    pub GetDoubleArrayRegion: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut JNIEnv,
            arg2: jdoubleArray,
            arg3: jsize,
            arg4: jsize,
            arg5: *mut jdouble,
        ),
    >,
    pub SetBooleanArrayRegion: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut JNIEnv,
            arg2: jbooleanArray,
            arg3: jsize,
            arg4: jsize,
            arg5: *const jboolean,
        ),
    >,
    pub SetByteArrayRegion: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut JNIEnv,
            arg2: jbyteArray,
            arg3: jsize,
            arg4: jsize,
            arg5: *const jbyte,
        ),
    >,
    pub SetCharArrayRegion: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut JNIEnv,
            arg2: jcharArray,
            arg3: jsize,
            arg4: jsize,
            arg5: *const jchar,
        ),
    >,
    pub SetShortArrayRegion: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut JNIEnv,
            arg2: jshortArray,
            arg3: jsize,
            arg4: jsize,
            arg5: *const jshort,
        ),
    >,
    pub SetIntArrayRegion: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut JNIEnv,
            arg2: jintArray,
            arg3: jsize,
            arg4: jsize,
            arg5: *const jint,
        ),
    >,
    pub SetLongArrayRegion: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut JNIEnv,
            arg2: jlongArray,
            arg3: jsize,
            arg4: jsize,
            arg5: *const jlong,
        ),
    >,
    pub SetFloatArrayRegion: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut JNIEnv,
            arg2: jfloatArray,
            arg3: jsize,
            arg4: jsize,
            arg5: *const jfloat,
        ),
    >,
    pub SetDoubleArrayRegion: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut JNIEnv,
            arg2: jdoubleArray,
            arg3: jsize,
            arg4: jsize,
            arg5: *const jdouble,
        ),
    >,
    pub RegisterNatives: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut JNIEnv,
            arg2: jclass,
            arg3: *const JNINativeMethod,
            arg4: jint,
        ) -> jint,
    >,
    pub UnregisterNatives:
        ::std::option::Option<unsafe extern "C" fn(arg1: *mut JNIEnv, arg2: jclass) -> jint>,
    pub MonitorEnter:
        ::std::option::Option<unsafe extern "C" fn(arg1: *mut JNIEnv, arg2: jobject) -> jint>,
    pub MonitorExit:
        ::std::option::Option<unsafe extern "C" fn(arg1: *mut JNIEnv, arg2: jobject) -> jint>,
    pub GetJavaVM: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut JNIEnv, arg2: *mut *mut JavaVM) -> jint,
    >,
    pub GetStringRegion: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut JNIEnv,
            arg2: jstring,
            arg3: jsize,
            arg4: jsize,
            arg5: *mut jchar,
        ),
    >,
    pub GetStringUTFRegion: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut JNIEnv,
            arg2: jstring,
            arg3: jsize,
            arg4: jsize,
            arg5: *mut ::std::os::raw::c_char,
        ),
    >,
    pub GetPrimitiveArrayCritical: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut JNIEnv,
            arg2: jarray,
            arg3: *mut jboolean,
        ) -> *mut ::std::os::raw::c_void,
    >,
    pub ReleasePrimitiveArrayCritical: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut JNIEnv,
            arg2: jarray,
            arg3: *mut ::std::os::raw::c_void,
            arg4: jint,
        ),
    >,
    pub GetStringCritical: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut JNIEnv, arg2: jstring, arg3: *mut jboolean) -> *const jchar,
    >,
    pub ReleaseStringCritical: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut JNIEnv, arg2: jstring, arg3: *const jchar),
    >,
    pub NewWeakGlobalRef:
        ::std::option::Option<unsafe extern "C" fn(arg1: *mut JNIEnv, arg2: jobject) -> jweak>,
    pub DeleteWeakGlobalRef:
        ::std::option::Option<unsafe extern "C" fn(arg1: *mut JNIEnv, arg2: jweak)>,
    pub ExceptionCheck: ::std::option::Option<unsafe extern "C" fn(arg1: *mut JNIEnv) -> jboolean>,
    pub NewDirectByteBuffer: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut JNIEnv,
            arg2: *mut ::std::os::raw::c_void,
            arg3: jlong,
        ) -> jobject,
    >,
    pub GetDirectBufferAddress: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut JNIEnv, arg2: jobject) -> *mut ::std::os::raw::c_void,
    >,
    pub GetDirectBufferCapacity:
        ::std::option::Option<unsafe extern "C" fn(arg1: *mut JNIEnv, arg2: jobject) -> jlong>,
    pub GetObjectRefType: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut JNIEnv, arg2: jobject) -> jobjectRefType,
    >,
}
#[test]
fn bindgen_test_layout_JNINativeInterface() {
    const UNINIT: ::std::mem::MaybeUninit<JNINativeInterface> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<JNINativeInterface>(),
        1864usize,
        concat!("Size of: ", stringify!(JNINativeInterface))
    );
    assert_eq!(
        ::std::mem::align_of::<JNINativeInterface>(),
        8usize,
        concat!("Alignment of ", stringify!(JNINativeInterface))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reserved0) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(reserved0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reserved1) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(reserved1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reserved2) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(reserved2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reserved3) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(reserved3)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetVersion) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(GetVersion)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DefineClass) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(DefineClass)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).FindClass) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(FindClass)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).FromReflectedMethod) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(FromReflectedMethod)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).FromReflectedField) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(FromReflectedField)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ToReflectedMethod) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(ToReflectedMethod)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetSuperclass) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(GetSuperclass)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IsAssignableFrom) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(IsAssignableFrom)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ToReflectedField) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(ToReflectedField)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Throw) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(Throw)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ThrowNew) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(ThrowNew)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ExceptionOccurred) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(ExceptionOccurred)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ExceptionDescribe) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(ExceptionDescribe)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ExceptionClear) as usize - ptr as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(ExceptionClear)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).FatalError) as usize - ptr as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(FatalError)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PushLocalFrame) as usize - ptr as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(PushLocalFrame)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PopLocalFrame) as usize - ptr as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(PopLocalFrame)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).NewGlobalRef) as usize - ptr as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(NewGlobalRef)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DeleteGlobalRef) as usize - ptr as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(DeleteGlobalRef)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DeleteLocalRef) as usize - ptr as usize },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(DeleteLocalRef)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IsSameObject) as usize - ptr as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(IsSameObject)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).NewLocalRef) as usize - ptr as usize },
        200usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(NewLocalRef)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).EnsureLocalCapacity) as usize - ptr as usize },
        208usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(EnsureLocalCapacity)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).AllocObject) as usize - ptr as usize },
        216usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(AllocObject)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).NewObject) as usize - ptr as usize },
        224usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(NewObject)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).NewObjectV) as usize - ptr as usize },
        232usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(NewObjectV)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).NewObjectA) as usize - ptr as usize },
        240usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(NewObjectA)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetObjectClass) as usize - ptr as usize },
        248usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(GetObjectClass)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IsInstanceOf) as usize - ptr as usize },
        256usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(IsInstanceOf)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetMethodID) as usize - ptr as usize },
        264usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(GetMethodID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CallObjectMethod) as usize - ptr as usize },
        272usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(CallObjectMethod)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CallObjectMethodV) as usize - ptr as usize },
        280usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(CallObjectMethodV)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CallObjectMethodA) as usize - ptr as usize },
        288usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(CallObjectMethodA)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CallBooleanMethod) as usize - ptr as usize },
        296usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(CallBooleanMethod)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CallBooleanMethodV) as usize - ptr as usize },
        304usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(CallBooleanMethodV)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CallBooleanMethodA) as usize - ptr as usize },
        312usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(CallBooleanMethodA)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CallByteMethod) as usize - ptr as usize },
        320usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(CallByteMethod)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CallByteMethodV) as usize - ptr as usize },
        328usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(CallByteMethodV)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CallByteMethodA) as usize - ptr as usize },
        336usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(CallByteMethodA)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CallCharMethod) as usize - ptr as usize },
        344usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(CallCharMethod)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CallCharMethodV) as usize - ptr as usize },
        352usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(CallCharMethodV)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CallCharMethodA) as usize - ptr as usize },
        360usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(CallCharMethodA)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CallShortMethod) as usize - ptr as usize },
        368usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(CallShortMethod)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CallShortMethodV) as usize - ptr as usize },
        376usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(CallShortMethodV)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CallShortMethodA) as usize - ptr as usize },
        384usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(CallShortMethodA)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CallIntMethod) as usize - ptr as usize },
        392usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(CallIntMethod)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CallIntMethodV) as usize - ptr as usize },
        400usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(CallIntMethodV)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CallIntMethodA) as usize - ptr as usize },
        408usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(CallIntMethodA)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CallLongMethod) as usize - ptr as usize },
        416usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(CallLongMethod)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CallLongMethodV) as usize - ptr as usize },
        424usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(CallLongMethodV)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CallLongMethodA) as usize - ptr as usize },
        432usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(CallLongMethodA)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CallFloatMethod) as usize - ptr as usize },
        440usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(CallFloatMethod)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CallFloatMethodV) as usize - ptr as usize },
        448usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(CallFloatMethodV)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CallFloatMethodA) as usize - ptr as usize },
        456usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(CallFloatMethodA)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CallDoubleMethod) as usize - ptr as usize },
        464usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(CallDoubleMethod)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CallDoubleMethodV) as usize - ptr as usize },
        472usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(CallDoubleMethodV)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CallDoubleMethodA) as usize - ptr as usize },
        480usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(CallDoubleMethodA)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CallVoidMethod) as usize - ptr as usize },
        488usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(CallVoidMethod)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CallVoidMethodV) as usize - ptr as usize },
        496usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(CallVoidMethodV)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CallVoidMethodA) as usize - ptr as usize },
        504usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(CallVoidMethodA)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CallNonvirtualObjectMethod) as usize - ptr as usize },
        512usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(CallNonvirtualObjectMethod)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CallNonvirtualObjectMethodV) as usize - ptr as usize },
        520usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(CallNonvirtualObjectMethodV)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CallNonvirtualObjectMethodA) as usize - ptr as usize },
        528usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(CallNonvirtualObjectMethodA)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CallNonvirtualBooleanMethod) as usize - ptr as usize },
        536usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(CallNonvirtualBooleanMethod)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).CallNonvirtualBooleanMethodV) as usize - ptr as usize
        },
        544usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(CallNonvirtualBooleanMethodV)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).CallNonvirtualBooleanMethodA) as usize - ptr as usize
        },
        552usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(CallNonvirtualBooleanMethodA)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CallNonvirtualByteMethod) as usize - ptr as usize },
        560usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(CallNonvirtualByteMethod)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CallNonvirtualByteMethodV) as usize - ptr as usize },
        568usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(CallNonvirtualByteMethodV)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CallNonvirtualByteMethodA) as usize - ptr as usize },
        576usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(CallNonvirtualByteMethodA)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CallNonvirtualCharMethod) as usize - ptr as usize },
        584usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(CallNonvirtualCharMethod)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CallNonvirtualCharMethodV) as usize - ptr as usize },
        592usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(CallNonvirtualCharMethodV)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CallNonvirtualCharMethodA) as usize - ptr as usize },
        600usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(CallNonvirtualCharMethodA)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CallNonvirtualShortMethod) as usize - ptr as usize },
        608usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(CallNonvirtualShortMethod)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CallNonvirtualShortMethodV) as usize - ptr as usize },
        616usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(CallNonvirtualShortMethodV)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CallNonvirtualShortMethodA) as usize - ptr as usize },
        624usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(CallNonvirtualShortMethodA)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CallNonvirtualIntMethod) as usize - ptr as usize },
        632usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(CallNonvirtualIntMethod)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CallNonvirtualIntMethodV) as usize - ptr as usize },
        640usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(CallNonvirtualIntMethodV)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CallNonvirtualIntMethodA) as usize - ptr as usize },
        648usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(CallNonvirtualIntMethodA)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CallNonvirtualLongMethod) as usize - ptr as usize },
        656usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(CallNonvirtualLongMethod)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CallNonvirtualLongMethodV) as usize - ptr as usize },
        664usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(CallNonvirtualLongMethodV)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CallNonvirtualLongMethodA) as usize - ptr as usize },
        672usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(CallNonvirtualLongMethodA)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CallNonvirtualFloatMethod) as usize - ptr as usize },
        680usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(CallNonvirtualFloatMethod)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CallNonvirtualFloatMethodV) as usize - ptr as usize },
        688usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(CallNonvirtualFloatMethodV)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CallNonvirtualFloatMethodA) as usize - ptr as usize },
        696usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(CallNonvirtualFloatMethodA)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CallNonvirtualDoubleMethod) as usize - ptr as usize },
        704usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(CallNonvirtualDoubleMethod)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CallNonvirtualDoubleMethodV) as usize - ptr as usize },
        712usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(CallNonvirtualDoubleMethodV)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CallNonvirtualDoubleMethodA) as usize - ptr as usize },
        720usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(CallNonvirtualDoubleMethodA)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CallNonvirtualVoidMethod) as usize - ptr as usize },
        728usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(CallNonvirtualVoidMethod)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CallNonvirtualVoidMethodV) as usize - ptr as usize },
        736usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(CallNonvirtualVoidMethodV)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CallNonvirtualVoidMethodA) as usize - ptr as usize },
        744usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(CallNonvirtualVoidMethodA)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetFieldID) as usize - ptr as usize },
        752usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(GetFieldID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetObjectField) as usize - ptr as usize },
        760usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(GetObjectField)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetBooleanField) as usize - ptr as usize },
        768usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(GetBooleanField)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetByteField) as usize - ptr as usize },
        776usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(GetByteField)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetCharField) as usize - ptr as usize },
        784usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(GetCharField)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetShortField) as usize - ptr as usize },
        792usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(GetShortField)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetIntField) as usize - ptr as usize },
        800usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(GetIntField)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetLongField) as usize - ptr as usize },
        808usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(GetLongField)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetFloatField) as usize - ptr as usize },
        816usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(GetFloatField)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetDoubleField) as usize - ptr as usize },
        824usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(GetDoubleField)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SetObjectField) as usize - ptr as usize },
        832usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(SetObjectField)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SetBooleanField) as usize - ptr as usize },
        840usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(SetBooleanField)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SetByteField) as usize - ptr as usize },
        848usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(SetByteField)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SetCharField) as usize - ptr as usize },
        856usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(SetCharField)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SetShortField) as usize - ptr as usize },
        864usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(SetShortField)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SetIntField) as usize - ptr as usize },
        872usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(SetIntField)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SetLongField) as usize - ptr as usize },
        880usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(SetLongField)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SetFloatField) as usize - ptr as usize },
        888usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(SetFloatField)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SetDoubleField) as usize - ptr as usize },
        896usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(SetDoubleField)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetStaticMethodID) as usize - ptr as usize },
        904usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(GetStaticMethodID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CallStaticObjectMethod) as usize - ptr as usize },
        912usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(CallStaticObjectMethod)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CallStaticObjectMethodV) as usize - ptr as usize },
        920usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(CallStaticObjectMethodV)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CallStaticObjectMethodA) as usize - ptr as usize },
        928usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(CallStaticObjectMethodA)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CallStaticBooleanMethod) as usize - ptr as usize },
        936usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(CallStaticBooleanMethod)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CallStaticBooleanMethodV) as usize - ptr as usize },
        944usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(CallStaticBooleanMethodV)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CallStaticBooleanMethodA) as usize - ptr as usize },
        952usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(CallStaticBooleanMethodA)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CallStaticByteMethod) as usize - ptr as usize },
        960usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(CallStaticByteMethod)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CallStaticByteMethodV) as usize - ptr as usize },
        968usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(CallStaticByteMethodV)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CallStaticByteMethodA) as usize - ptr as usize },
        976usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(CallStaticByteMethodA)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CallStaticCharMethod) as usize - ptr as usize },
        984usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(CallStaticCharMethod)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CallStaticCharMethodV) as usize - ptr as usize },
        992usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(CallStaticCharMethodV)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CallStaticCharMethodA) as usize - ptr as usize },
        1000usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(CallStaticCharMethodA)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CallStaticShortMethod) as usize - ptr as usize },
        1008usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(CallStaticShortMethod)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CallStaticShortMethodV) as usize - ptr as usize },
        1016usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(CallStaticShortMethodV)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CallStaticShortMethodA) as usize - ptr as usize },
        1024usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(CallStaticShortMethodA)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CallStaticIntMethod) as usize - ptr as usize },
        1032usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(CallStaticIntMethod)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CallStaticIntMethodV) as usize - ptr as usize },
        1040usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(CallStaticIntMethodV)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CallStaticIntMethodA) as usize - ptr as usize },
        1048usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(CallStaticIntMethodA)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CallStaticLongMethod) as usize - ptr as usize },
        1056usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(CallStaticLongMethod)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CallStaticLongMethodV) as usize - ptr as usize },
        1064usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(CallStaticLongMethodV)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CallStaticLongMethodA) as usize - ptr as usize },
        1072usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(CallStaticLongMethodA)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CallStaticFloatMethod) as usize - ptr as usize },
        1080usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(CallStaticFloatMethod)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CallStaticFloatMethodV) as usize - ptr as usize },
        1088usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(CallStaticFloatMethodV)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CallStaticFloatMethodA) as usize - ptr as usize },
        1096usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(CallStaticFloatMethodA)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CallStaticDoubleMethod) as usize - ptr as usize },
        1104usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(CallStaticDoubleMethod)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CallStaticDoubleMethodV) as usize - ptr as usize },
        1112usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(CallStaticDoubleMethodV)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CallStaticDoubleMethodA) as usize - ptr as usize },
        1120usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(CallStaticDoubleMethodA)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CallStaticVoidMethod) as usize - ptr as usize },
        1128usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(CallStaticVoidMethod)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CallStaticVoidMethodV) as usize - ptr as usize },
        1136usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(CallStaticVoidMethodV)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).CallStaticVoidMethodA) as usize - ptr as usize },
        1144usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(CallStaticVoidMethodA)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetStaticFieldID) as usize - ptr as usize },
        1152usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(GetStaticFieldID)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetStaticObjectField) as usize - ptr as usize },
        1160usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(GetStaticObjectField)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetStaticBooleanField) as usize - ptr as usize },
        1168usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(GetStaticBooleanField)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetStaticByteField) as usize - ptr as usize },
        1176usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(GetStaticByteField)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetStaticCharField) as usize - ptr as usize },
        1184usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(GetStaticCharField)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetStaticShortField) as usize - ptr as usize },
        1192usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(GetStaticShortField)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetStaticIntField) as usize - ptr as usize },
        1200usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(GetStaticIntField)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetStaticLongField) as usize - ptr as usize },
        1208usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(GetStaticLongField)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetStaticFloatField) as usize - ptr as usize },
        1216usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(GetStaticFloatField)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetStaticDoubleField) as usize - ptr as usize },
        1224usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(GetStaticDoubleField)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SetStaticObjectField) as usize - ptr as usize },
        1232usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(SetStaticObjectField)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SetStaticBooleanField) as usize - ptr as usize },
        1240usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(SetStaticBooleanField)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SetStaticByteField) as usize - ptr as usize },
        1248usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(SetStaticByteField)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SetStaticCharField) as usize - ptr as usize },
        1256usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(SetStaticCharField)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SetStaticShortField) as usize - ptr as usize },
        1264usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(SetStaticShortField)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SetStaticIntField) as usize - ptr as usize },
        1272usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(SetStaticIntField)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SetStaticLongField) as usize - ptr as usize },
        1280usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(SetStaticLongField)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SetStaticFloatField) as usize - ptr as usize },
        1288usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(SetStaticFloatField)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SetStaticDoubleField) as usize - ptr as usize },
        1296usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(SetStaticDoubleField)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).NewString) as usize - ptr as usize },
        1304usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(NewString)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetStringLength) as usize - ptr as usize },
        1312usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(GetStringLength)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetStringChars) as usize - ptr as usize },
        1320usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(GetStringChars)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ReleaseStringChars) as usize - ptr as usize },
        1328usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(ReleaseStringChars)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).NewStringUTF) as usize - ptr as usize },
        1336usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(NewStringUTF)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetStringUTFLength) as usize - ptr as usize },
        1344usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(GetStringUTFLength)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetStringUTFChars) as usize - ptr as usize },
        1352usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(GetStringUTFChars)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ReleaseStringUTFChars) as usize - ptr as usize },
        1360usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(ReleaseStringUTFChars)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetArrayLength) as usize - ptr as usize },
        1368usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(GetArrayLength)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).NewObjectArray) as usize - ptr as usize },
        1376usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(NewObjectArray)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetObjectArrayElement) as usize - ptr as usize },
        1384usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(GetObjectArrayElement)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SetObjectArrayElement) as usize - ptr as usize },
        1392usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(SetObjectArrayElement)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).NewBooleanArray) as usize - ptr as usize },
        1400usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(NewBooleanArray)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).NewByteArray) as usize - ptr as usize },
        1408usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(NewByteArray)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).NewCharArray) as usize - ptr as usize },
        1416usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(NewCharArray)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).NewShortArray) as usize - ptr as usize },
        1424usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(NewShortArray)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).NewIntArray) as usize - ptr as usize },
        1432usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(NewIntArray)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).NewLongArray) as usize - ptr as usize },
        1440usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(NewLongArray)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).NewFloatArray) as usize - ptr as usize },
        1448usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(NewFloatArray)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).NewDoubleArray) as usize - ptr as usize },
        1456usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(NewDoubleArray)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetBooleanArrayElements) as usize - ptr as usize },
        1464usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(GetBooleanArrayElements)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetByteArrayElements) as usize - ptr as usize },
        1472usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(GetByteArrayElements)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetCharArrayElements) as usize - ptr as usize },
        1480usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(GetCharArrayElements)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetShortArrayElements) as usize - ptr as usize },
        1488usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(GetShortArrayElements)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetIntArrayElements) as usize - ptr as usize },
        1496usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(GetIntArrayElements)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetLongArrayElements) as usize - ptr as usize },
        1504usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(GetLongArrayElements)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetFloatArrayElements) as usize - ptr as usize },
        1512usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(GetFloatArrayElements)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetDoubleArrayElements) as usize - ptr as usize },
        1520usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(GetDoubleArrayElements)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ReleaseBooleanArrayElements) as usize - ptr as usize },
        1528usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(ReleaseBooleanArrayElements)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ReleaseByteArrayElements) as usize - ptr as usize },
        1536usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(ReleaseByteArrayElements)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ReleaseCharArrayElements) as usize - ptr as usize },
        1544usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(ReleaseCharArrayElements)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ReleaseShortArrayElements) as usize - ptr as usize },
        1552usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(ReleaseShortArrayElements)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ReleaseIntArrayElements) as usize - ptr as usize },
        1560usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(ReleaseIntArrayElements)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ReleaseLongArrayElements) as usize - ptr as usize },
        1568usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(ReleaseLongArrayElements)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ReleaseFloatArrayElements) as usize - ptr as usize },
        1576usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(ReleaseFloatArrayElements)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ReleaseDoubleArrayElements) as usize - ptr as usize },
        1584usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(ReleaseDoubleArrayElements)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetBooleanArrayRegion) as usize - ptr as usize },
        1592usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(GetBooleanArrayRegion)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetByteArrayRegion) as usize - ptr as usize },
        1600usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(GetByteArrayRegion)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetCharArrayRegion) as usize - ptr as usize },
        1608usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(GetCharArrayRegion)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetShortArrayRegion) as usize - ptr as usize },
        1616usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(GetShortArrayRegion)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetIntArrayRegion) as usize - ptr as usize },
        1624usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(GetIntArrayRegion)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetLongArrayRegion) as usize - ptr as usize },
        1632usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(GetLongArrayRegion)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetFloatArrayRegion) as usize - ptr as usize },
        1640usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(GetFloatArrayRegion)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetDoubleArrayRegion) as usize - ptr as usize },
        1648usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(GetDoubleArrayRegion)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SetBooleanArrayRegion) as usize - ptr as usize },
        1656usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(SetBooleanArrayRegion)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SetByteArrayRegion) as usize - ptr as usize },
        1664usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(SetByteArrayRegion)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SetCharArrayRegion) as usize - ptr as usize },
        1672usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(SetCharArrayRegion)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SetShortArrayRegion) as usize - ptr as usize },
        1680usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(SetShortArrayRegion)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SetIntArrayRegion) as usize - ptr as usize },
        1688usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(SetIntArrayRegion)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SetLongArrayRegion) as usize - ptr as usize },
        1696usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(SetLongArrayRegion)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SetFloatArrayRegion) as usize - ptr as usize },
        1704usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(SetFloatArrayRegion)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SetDoubleArrayRegion) as usize - ptr as usize },
        1712usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(SetDoubleArrayRegion)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).RegisterNatives) as usize - ptr as usize },
        1720usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(RegisterNatives)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).UnregisterNatives) as usize - ptr as usize },
        1728usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(UnregisterNatives)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).MonitorEnter) as usize - ptr as usize },
        1736usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(MonitorEnter)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).MonitorExit) as usize - ptr as usize },
        1744usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(MonitorExit)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetJavaVM) as usize - ptr as usize },
        1752usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(GetJavaVM)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetStringRegion) as usize - ptr as usize },
        1760usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(GetStringRegion)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetStringUTFRegion) as usize - ptr as usize },
        1768usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(GetStringUTFRegion)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetPrimitiveArrayCritical) as usize - ptr as usize },
        1776usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(GetPrimitiveArrayCritical)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).ReleasePrimitiveArrayCritical) as usize - ptr as usize
        },
        1784usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(ReleasePrimitiveArrayCritical)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetStringCritical) as usize - ptr as usize },
        1792usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(GetStringCritical)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ReleaseStringCritical) as usize - ptr as usize },
        1800usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(ReleaseStringCritical)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).NewWeakGlobalRef) as usize - ptr as usize },
        1808usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(NewWeakGlobalRef)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DeleteWeakGlobalRef) as usize - ptr as usize },
        1816usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(DeleteWeakGlobalRef)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ExceptionCheck) as usize - ptr as usize },
        1824usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(ExceptionCheck)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).NewDirectByteBuffer) as usize - ptr as usize },
        1832usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(NewDirectByteBuffer)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetDirectBufferAddress) as usize - ptr as usize },
        1840usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(GetDirectBufferAddress)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetDirectBufferCapacity) as usize - ptr as usize },
        1848usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(GetDirectBufferCapacity)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetObjectRefType) as usize - ptr as usize },
        1856usize,
        concat!(
            "Offset of field: ",
            stringify!(JNINativeInterface),
            "::",
            stringify!(GetObjectRefType)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _JNIEnv {
    pub functions: *const JNINativeInterface,
}
#[test]
fn bindgen_test_layout__JNIEnv() {
    const UNINIT: ::std::mem::MaybeUninit<_JNIEnv> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_JNIEnv>(),
        8usize,
        concat!("Size of: ", stringify!(_JNIEnv))
    );
    assert_eq!(
        ::std::mem::align_of::<_JNIEnv>(),
        8usize,
        concat!("Alignment of ", stringify!(_JNIEnv))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).functions) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_JNIEnv),
            "::",
            stringify!(functions)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct JNIInvokeInterface {
    pub reserved0: *mut ::std::os::raw::c_void,
    pub reserved1: *mut ::std::os::raw::c_void,
    pub reserved2: *mut ::std::os::raw::c_void,
    pub DestroyJavaVM: ::std::option::Option<unsafe extern "C" fn(arg1: *mut JavaVM) -> jint>,
    pub AttachCurrentThread: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut JavaVM,
            arg2: *mut *mut JNIEnv,
            arg3: *mut ::std::os::raw::c_void,
        ) -> jint,
    >,
    pub DetachCurrentThread: ::std::option::Option<unsafe extern "C" fn(arg1: *mut JavaVM) -> jint>,
    pub GetEnv: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut JavaVM,
            arg2: *mut *mut ::std::os::raw::c_void,
            arg3: jint,
        ) -> jint,
    >,
    pub AttachCurrentThreadAsDaemon: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut JavaVM,
            arg2: *mut *mut JNIEnv,
            arg3: *mut ::std::os::raw::c_void,
        ) -> jint,
    >,
}
#[test]
fn bindgen_test_layout_JNIInvokeInterface() {
    const UNINIT: ::std::mem::MaybeUninit<JNIInvokeInterface> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<JNIInvokeInterface>(),
        64usize,
        concat!("Size of: ", stringify!(JNIInvokeInterface))
    );
    assert_eq!(
        ::std::mem::align_of::<JNIInvokeInterface>(),
        8usize,
        concat!("Alignment of ", stringify!(JNIInvokeInterface))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reserved0) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(JNIInvokeInterface),
            "::",
            stringify!(reserved0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reserved1) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(JNIInvokeInterface),
            "::",
            stringify!(reserved1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reserved2) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(JNIInvokeInterface),
            "::",
            stringify!(reserved2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DestroyJavaVM) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(JNIInvokeInterface),
            "::",
            stringify!(DestroyJavaVM)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).AttachCurrentThread) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(JNIInvokeInterface),
            "::",
            stringify!(AttachCurrentThread)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DetachCurrentThread) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(JNIInvokeInterface),
            "::",
            stringify!(DetachCurrentThread)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GetEnv) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(JNIInvokeInterface),
            "::",
            stringify!(GetEnv)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).AttachCurrentThreadAsDaemon) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(JNIInvokeInterface),
            "::",
            stringify!(AttachCurrentThreadAsDaemon)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _JavaVM {
    pub functions: *const JNIInvokeInterface,
}
#[test]
fn bindgen_test_layout__JavaVM() {
    const UNINIT: ::std::mem::MaybeUninit<_JavaVM> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_JavaVM>(),
        8usize,
        concat!("Size of: ", stringify!(_JavaVM))
    );
    assert_eq!(
        ::std::mem::align_of::<_JavaVM>(),
        8usize,
        concat!("Alignment of ", stringify!(_JavaVM))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).functions) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_JavaVM),
            "::",
            stringify!(functions)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct JavaVMAttachArgs {
    pub version: jint,
    pub name: *const ::std::os::raw::c_char,
    pub group: jobject,
}
#[test]
fn bindgen_test_layout_JavaVMAttachArgs() {
    const UNINIT: ::std::mem::MaybeUninit<JavaVMAttachArgs> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<JavaVMAttachArgs>(),
        24usize,
        concat!("Size of: ", stringify!(JavaVMAttachArgs))
    );
    assert_eq!(
        ::std::mem::align_of::<JavaVMAttachArgs>(),
        8usize,
        concat!("Alignment of ", stringify!(JavaVMAttachArgs))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).version) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(JavaVMAttachArgs),
            "::",
            stringify!(version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(JavaVMAttachArgs),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).group) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(JavaVMAttachArgs),
            "::",
            stringify!(group)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct JavaVMOption {
    pub optionString: *const ::std::os::raw::c_char,
    pub extraInfo: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_JavaVMOption() {
    const UNINIT: ::std::mem::MaybeUninit<JavaVMOption> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<JavaVMOption>(),
        16usize,
        concat!("Size of: ", stringify!(JavaVMOption))
    );
    assert_eq!(
        ::std::mem::align_of::<JavaVMOption>(),
        8usize,
        concat!("Alignment of ", stringify!(JavaVMOption))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).optionString) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(JavaVMOption),
            "::",
            stringify!(optionString)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).extraInfo) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(JavaVMOption),
            "::",
            stringify!(extraInfo)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct JavaVMInitArgs {
    pub version: jint,
    pub nOptions: jint,
    pub options: *mut JavaVMOption,
    pub ignoreUnrecognized: jboolean,
}
#[test]
fn bindgen_test_layout_JavaVMInitArgs() {
    const UNINIT: ::std::mem::MaybeUninit<JavaVMInitArgs> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<JavaVMInitArgs>(),
        24usize,
        concat!("Size of: ", stringify!(JavaVMInitArgs))
    );
    assert_eq!(
        ::std::mem::align_of::<JavaVMInitArgs>(),
        8usize,
        concat!("Alignment of ", stringify!(JavaVMInitArgs))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).version) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(JavaVMInitArgs),
            "::",
            stringify!(version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nOptions) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(JavaVMInitArgs),
            "::",
            stringify!(nOptions)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).options) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(JavaVMInitArgs),
            "::",
            stringify!(options)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ignoreUnrecognized) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(JavaVMInitArgs),
            "::",
            stringify!(ignoreUnrecognized)
        )
    );
}
extern "C" {
    pub fn JNI_GetDefaultJavaVMInitArgs(arg1: *mut ::std::os::raw::c_void) -> jint;
}
extern "C" {
    pub fn JNI_CreateJavaVM(
        arg1: *mut *mut JavaVM,
        arg2: *mut *mut JNIEnv,
        arg3: *mut ::std::os::raw::c_void,
    ) -> jint;
}
extern "C" {
    pub fn JNI_GetCreatedJavaVMs(arg1: *mut *mut JavaVM, arg2: jsize, arg3: *mut jsize) -> jint;
}
extern "C" {
    pub fn JNI_OnLoad(vm: *mut JavaVM, reserved: *mut ::std::os::raw::c_void) -> jint;
}
extern "C" {
    pub fn JNI_OnUnload(vm: *mut JavaVM, reserved: *mut ::std::os::raw::c_void);
}
extern "C" {
    #[doc = " Return the AHardwareBuffer wrapped by a Java HardwareBuffer object.\n\n This method does not acquire any additional reference to the AHardwareBuffer\n that is returned. To keep the AHardwareBuffer alive after the Java\n HardwareBuffer object is closed, explicitly or by the garbage collector, be\n sure to use AHardwareBuffer_acquire() to acquire an additional reference.\n\n Available since API level 26."]
    pub fn AHardwareBuffer_fromHardwareBuffer(
        env: *mut JNIEnv,
        hardwareBufferObj: jobject,
    ) -> *mut AHardwareBuffer;
}
extern "C" {
    #[doc = " Return a new Java HardwareBuffer object that wraps the passed native\n AHardwareBuffer object. The Java HardwareBuffer will acquire a reference to\n the internal buffer and manage its lifetime. For example:\n\n <pre><code>\n AHardwareBuffer* buffer;\n AHardwareBuffer_allocate(..., &buffer);  // `buffer` has reference count 1\n jobject java_result = AHardwareBuffer_toHardwareBuffer(buffer);  // `buffer` has reference count 2.\n AHardwareBuffer_release(buffer); // `buffer` has reference count 1\n return result;  // The underlying buffer is kept alive by `java_result` and\n                 // will be set to 0 when it is closed on the Java side with\n                 // HardwareBuffer::close().\n </code></pre>\n\n Available since API level 26."]
    pub fn AHardwareBuffer_toHardwareBuffer(
        env: *mut JNIEnv,
        hardwareBuffer: *mut AHardwareBuffer,
    ) -> jobject;
}
#[doc = " For internal use only."]
pub const android_LogPriority_ANDROID_LOG_UNKNOWN: android_LogPriority = 0;
#[doc = " The default priority, for internal use only."]
pub const android_LogPriority_ANDROID_LOG_DEFAULT: android_LogPriority = 1;
#[doc = " Verbose logging. Should typically be disabled for a release apk."]
pub const android_LogPriority_ANDROID_LOG_VERBOSE: android_LogPriority = 2;
#[doc = " Debug logging. Should typically be disabled for a release apk."]
pub const android_LogPriority_ANDROID_LOG_DEBUG: android_LogPriority = 3;
#[doc = " Informational logging. Should typically be disabled for a release apk."]
pub const android_LogPriority_ANDROID_LOG_INFO: android_LogPriority = 4;
#[doc = " Warning logging. For use with recoverable failures."]
pub const android_LogPriority_ANDROID_LOG_WARN: android_LogPriority = 5;
#[doc = " Error logging. For use with unrecoverable failures."]
pub const android_LogPriority_ANDROID_LOG_ERROR: android_LogPriority = 6;
#[doc = " Fatal logging. For use when aborting."]
pub const android_LogPriority_ANDROID_LOG_FATAL: android_LogPriority = 7;
#[doc = " For internal use only."]
pub const android_LogPriority_ANDROID_LOG_SILENT: android_LogPriority = 8;
#[doc = " Android log priority values, in increasing order of priority."]
pub type android_LogPriority = ::std::os::raw::c_uint;
extern "C" {
    #[doc = " Writes the constant string `text` to the log, with priority `prio` and tag\n `tag`."]
    pub fn __android_log_write(
        prio: ::std::os::raw::c_int,
        tag: *const ::std::os::raw::c_char,
        text: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Writes a formatted string to the log, with priority `prio` and tag `tag`.\n The details of formatting are the same as for\n [printf(3)](http://man7.org/linux/man-pages/man3/printf.3.html)."]
    pub fn __android_log_print(
        prio: ::std::os::raw::c_int,
        tag: *const ::std::os::raw::c_char,
        fmt: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Equivalent to `__android_log_print`, but taking a `va_list`.\n (If `__android_log_print` is like `printf`, this is like `vprintf`.)"]
    pub fn __android_log_vprint(
        prio: ::std::os::raw::c_int,
        tag: *const ::std::os::raw::c_char,
        fmt: *const ::std::os::raw::c_char,
        ap: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Writes an assertion failure to the log (as `ANDROID_LOG_FATAL`) and to\n stderr, before calling\n [abort(3)](http://man7.org/linux/man-pages/man3/abort.3.html).\n\n If `fmt` is non-null, `cond` is unused. If `fmt` is null, the string\n `Assertion failed: %s` is used with `cond` as the string argument.\n If both `fmt` and `cond` are null, a default string is provided.\n\n Most callers should use\n [assert(3)](http://man7.org/linux/man-pages/man3/assert.3.html) from\n `&lt;assert.h&gt;` instead, or the `__assert` and `__assert2` functions\n provided by bionic if more control is needed. They support automatically\n including the source filename and line number more conveniently than this\n function."]
    pub fn __android_log_assert(
        cond: *const ::std::os::raw::c_char,
        tag: *const ::std::os::raw::c_char,
        fmt: *const ::std::os::raw::c_char,
        ...
    ) -> !;
}
pub const log_id_LOG_ID_MIN: log_id = 0;
#[doc = " The main log buffer. This is the only log buffer available to apps."]
pub const log_id_LOG_ID_MAIN: log_id = 0;
#[doc = " The radio log buffer."]
pub const log_id_LOG_ID_RADIO: log_id = 1;
#[doc = " The event log buffer."]
pub const log_id_LOG_ID_EVENTS: log_id = 2;
#[doc = " The system log buffer."]
pub const log_id_LOG_ID_SYSTEM: log_id = 3;
#[doc = " The crash log buffer."]
pub const log_id_LOG_ID_CRASH: log_id = 4;
#[doc = " The statistics log buffer."]
pub const log_id_LOG_ID_STATS: log_id = 5;
#[doc = " The security log buffer."]
pub const log_id_LOG_ID_SECURITY: log_id = 6;
#[doc = " The kernel log buffer."]
pub const log_id_LOG_ID_KERNEL: log_id = 7;
#[doc = " The kernel log buffer."]
pub const log_id_LOG_ID_MAX: log_id = 8;
#[doc = " Let the logging function choose the best log target."]
pub const log_id_LOG_ID_DEFAULT: log_id = 2147483647;
#[doc = " Identifies a specific log buffer for __android_log_buf_write()\n and __android_log_buf_print()."]
pub type log_id = ::std::os::raw::c_uint;
#[doc = " Identifies a specific log buffer for __android_log_buf_write()\n and __android_log_buf_print()."]
pub use self::log_id as log_id_t;
extern "C" {
    #[doc = " Writes the constant string `text` to the log buffer `id`,\n with priority `prio` and tag `tag`.\n\n Apps should use __android_log_write() instead."]
    pub fn __android_log_buf_write(
        bufID: ::std::os::raw::c_int,
        prio: ::std::os::raw::c_int,
        tag: *const ::std::os::raw::c_char,
        text: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Writes a formatted string to log buffer `id`,\n with priority `prio` and tag `tag`.\n The details of formatting are the same as for\n [printf(3)](http://man7.org/linux/man-pages/man3/printf.3.html).\n\n Apps should use __android_log_print() instead."]
    pub fn __android_log_buf_print(
        bufID: ::std::os::raw::c_int,
        prio: ::std::os::raw::c_int,
        tag: *const ::std::os::raw::c_char,
        fmt: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
#[doc = " Logger data struct used for writing log messages to liblog via __android_log_write_logger_data()\n and sending log messages to user defined loggers specified in __android_log_set_logger()."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __android_log_message {
    #[doc = " Must be set to sizeof(__android_log_message) and is used for versioning."]
    pub struct_size: usize,
    #[doc = " {@link log_id_t} values."]
    pub buffer_id: i32,
    #[doc = " {@link android_LogPriority} values."]
    pub priority: i32,
    #[doc = " The tag for the log message."]
    pub tag: *const ::std::os::raw::c_char,
    #[doc = " Optional file name, may be set to nullptr."]
    pub file: *const ::std::os::raw::c_char,
    #[doc = " Optional line number, ignore if file is nullptr."]
    pub line: u32,
    #[doc = " The log message itself."]
    pub message: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout___android_log_message() {
    const UNINIT: ::std::mem::MaybeUninit<__android_log_message> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__android_log_message>(),
        48usize,
        concat!("Size of: ", stringify!(__android_log_message))
    );
    assert_eq!(
        ::std::mem::align_of::<__android_log_message>(),
        8usize,
        concat!("Alignment of ", stringify!(__android_log_message))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).struct_size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__android_log_message),
            "::",
            stringify!(struct_size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).buffer_id) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__android_log_message),
            "::",
            stringify!(buffer_id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).priority) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(__android_log_message),
            "::",
            stringify!(priority)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tag) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__android_log_message),
            "::",
            stringify!(tag)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).file) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(__android_log_message),
            "::",
            stringify!(file)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).line) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(__android_log_message),
            "::",
            stringify!(line)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).message) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(__android_log_message),
            "::",
            stringify!(message)
        )
    );
}
#[doc = " Prototype for the 'logger' function that is called for every log message."]
pub type __android_logger_function =
    ::std::option::Option<unsafe extern "C" fn(log_message: *const __android_log_message)>;
#[doc = " Prototype for the 'abort' function that is called when liblog will abort due to\n __android_log_assert() failures."]
pub type __android_aborter_function =
    ::std::option::Option<unsafe extern "C" fn(abort_message: *const ::std::os::raw::c_char)>;
extern "C" {
    #[doc = " Writes the log message specified by log_message.  log_message includes additional file name and\n line number information that a logger may use.  log_message is versioned for backwards\n compatibility.\n This assumes that loggability has already been checked through __android_log_is_loggable().\n Higher level logging libraries, such as libbase, first check loggability, then format their\n buffers, then pass the message to liblog via this function, and therefore we do not want to\n duplicate the loggability check here.\n\n @param log_message the log message itself, see __android_log_message.\n\n Available since API level 30."]
    pub fn __android_log_write_log_message(log_message: *mut __android_log_message);
}
extern "C" {
    #[doc = " Sets a user defined logger function.  All log messages sent to liblog will be set to the\n function pointer specified by logger for processing.  It is not expected that log messages are\n already terminated with a new line.  This function should add new lines if required for line\n separation.\n\n @param logger the new function that will handle log messages.\n\n Available since API level 30."]
    pub fn __android_log_set_logger(logger: __android_logger_function);
}
extern "C" {
    #[doc = " Writes the log message to logd.  This is an __android_logger_function and can be provided to\n __android_log_set_logger().  It is the default logger when running liblog on a device.\n\n @param log_message the log message to write, see __android_log_message.\n\n Available since API level 30."]
    pub fn __android_log_logd_logger(log_message: *const __android_log_message);
}
extern "C" {
    #[doc = " Writes the log message to stderr.  This is an __android_logger_function and can be provided to\n __android_log_set_logger().  It is the default logger when running liblog on host.\n\n @param log_message the log message to write, see __android_log_message.\n\n Available since API level 30."]
    pub fn __android_log_stderr_logger(log_message: *const __android_log_message);
}
extern "C" {
    #[doc = " Sets a user defined aborter function that is called for __android_log_assert() failures.  This\n user defined aborter function is highly recommended to abort and be noreturn, but is not strictly\n required to.\n\n @param aborter the new aborter function, see __android_aborter_function.\n\n Available since API level 30."]
    pub fn __android_log_set_aborter(aborter: __android_aborter_function);
}
extern "C" {
    #[doc = " Calls the stored aborter function.  This allows for other logging libraries to use the same\n aborter function by calling this function in liblog.\n\n @param abort_message an additional message supplied when aborting, for example this is used to\n                      call android_set_abort_message() in __android_log_default_aborter().\n\n Available since API level 30."]
    pub fn __android_log_call_aborter(abort_message: *const ::std::os::raw::c_char);
}
extern "C" {
    #[doc = " Sets android_set_abort_message() on device then aborts().  This is the default aborter.\n\n @param abort_message an additional message supplied when aborting.  This functions calls\n                      android_set_abort_message() with its contents.\n\n Available since API level 30."]
    pub fn __android_log_default_aborter(abort_message: *const ::std::os::raw::c_char) -> !;
}
extern "C" {
    #[doc = " Use the per-tag properties \"log.tag.<tagname>\" along with the minimum priority from\n __android_log_set_minimum_priority() to determine if a log message with a given prio and tag will\n be printed.  A non-zero result indicates yes, zero indicates false.\n\n If both a priority for a tag and a minimum priority are set by\n __android_log_set_minimum_priority(), then the lowest of the two values are to determine the\n minimum priority needed to log.  If only one is set, then that value is used to determine the\n minimum priority needed.  If none are set, then default_priority is used.\n\n @param prio         the priority to test, takes android_LogPriority values.\n @param tag          the tag to test.\n @param default_prio the default priority to use if no properties or minimum priority are set.\n @return an integer where 1 indicates that the message is loggable and 0 indicates that it is not.\n\n Available since API level 30."]
    pub fn __android_log_is_loggable(
        prio: ::std::os::raw::c_int,
        tag: *const ::std::os::raw::c_char,
        default_prio: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Use the per-tag properties \"log.tag.<tagname>\" along with the minimum priority from\n __android_log_set_minimum_priority() to determine if a log message with a given prio and tag will\n be printed.  A non-zero result indicates yes, zero indicates false.\n\n If both a priority for a tag and a minimum priority are set by\n __android_log_set_minimum_priority(), then the lowest of the two values are to determine the\n minimum priority needed to log.  If only one is set, then that value is used to determine the\n minimum priority needed.  If none are set, then default_priority is used.\n\n @param prio         the priority to test, takes android_LogPriority values.\n @param tag          the tag to test.\n @param len          the length of the tag.\n @param default_prio the default priority to use if no properties or minimum priority are set.\n @return an integer where 1 indicates that the message is loggable and 0 indicates that it is not.\n\n Available since API level 30."]
    pub fn __android_log_is_loggable_len(
        prio: ::std::os::raw::c_int,
        tag: *const ::std::os::raw::c_char,
        len: usize,
        default_prio: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Sets the minimum priority that will be logged for this process.\n\n @param priority the new minimum priority to set, takes android_LogPriority values.\n @return the previous set minimum priority as android_LogPriority values, or\n         ANDROID_LOG_DEFAULT if none was set.\n\n Available since API level 30."]
    pub fn __android_log_set_minimum_priority(priority: i32) -> i32;
}
extern "C" {
    #[doc = " Gets the minimum priority that will be logged for this process.  If none has been set by a\n previous __android_log_set_minimum_priority() call, this returns ANDROID_LOG_DEFAULT.\n\n @return the current minimum priority as android_LogPriority values, or\n         ANDROID_LOG_DEFAULT if none is set.\n\n Available since API level 30."]
    pub fn __android_log_get_minimum_priority() -> i32;
}
extern "C" {
    #[doc = " Sets the default tag if no tag is provided when writing a log message.  Defaults to\n getprogname().  This truncates tag to the maximum log message size, though appropriate tags\n should be much smaller.\n\n @param tag the new log tag.\n\n Available since API level 30."]
    pub fn __android_log_set_default_tag(tag: *const ::std::os::raw::c_char);
}
pub type __s8 = ::std::os::raw::c_schar;
pub type __u8 = ::std::os::raw::c_uchar;
pub type __s16 = ::std::os::raw::c_short;
pub type __u16 = ::std::os::raw::c_ushort;
pub type __s32 = ::std::os::raw::c_int;
pub type __u32 = ::std::os::raw::c_uint;
pub type __s64 = ::std::os::raw::c_longlong;
pub type __u64 = ::std::os::raw::c_ulonglong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __kernel_fd_set {
    pub fds_bits: [::std::os::raw::c_ulong; 16usize],
}
#[test]
fn bindgen_test_layout___kernel_fd_set() {
    const UNINIT: ::std::mem::MaybeUninit<__kernel_fd_set> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__kernel_fd_set>(),
        128usize,
        concat!("Size of: ", stringify!(__kernel_fd_set))
    );
    assert_eq!(
        ::std::mem::align_of::<__kernel_fd_set>(),
        8usize,
        concat!("Alignment of ", stringify!(__kernel_fd_set))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fds_bits) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__kernel_fd_set),
            "::",
            stringify!(fds_bits)
        )
    );
}
pub type __kernel_sighandler_t =
    ::std::option::Option<unsafe extern "C" fn(arg1: ::std::os::raw::c_int)>;
pub type __kernel_key_t = ::std::os::raw::c_int;
pub type __kernel_mqd_t = ::std::os::raw::c_int;
pub type __kernel_old_uid_t = ::std::os::raw::c_ushort;
pub type __kernel_old_gid_t = ::std::os::raw::c_ushort;
pub type __kernel_old_dev_t = ::std::os::raw::c_ulong;
pub type __kernel_long_t = ::std::os::raw::c_long;
pub type __kernel_ulong_t = ::std::os::raw::c_ulong;
pub type __kernel_ino_t = __kernel_ulong_t;
pub type __kernel_mode_t = ::std::os::raw::c_uint;
pub type __kernel_pid_t = ::std::os::raw::c_int;
pub type __kernel_ipc_pid_t = ::std::os::raw::c_int;
pub type __kernel_uid_t = ::std::os::raw::c_uint;
pub type __kernel_gid_t = ::std::os::raw::c_uint;
pub type __kernel_suseconds_t = __kernel_long_t;
pub type __kernel_daddr_t = ::std::os::raw::c_int;
pub type __kernel_uid32_t = ::std::os::raw::c_uint;
pub type __kernel_gid32_t = ::std::os::raw::c_uint;
pub type __kernel_size_t = __kernel_ulong_t;
pub type __kernel_ssize_t = __kernel_long_t;
pub type __kernel_ptrdiff_t = __kernel_long_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __kernel_fsid_t {
    pub val: [::std::os::raw::c_int; 2usize],
}
#[test]
fn bindgen_test_layout___kernel_fsid_t() {
    const UNINIT: ::std::mem::MaybeUninit<__kernel_fsid_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__kernel_fsid_t>(),
        8usize,
        concat!("Size of: ", stringify!(__kernel_fsid_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__kernel_fsid_t>(),
        4usize,
        concat!("Alignment of ", stringify!(__kernel_fsid_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).val) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__kernel_fsid_t),
            "::",
            stringify!(val)
        )
    );
}
pub type __kernel_off_t = __kernel_long_t;
pub type __kernel_loff_t = ::std::os::raw::c_longlong;
pub type __kernel_old_time_t = __kernel_long_t;
pub type __kernel_time_t = __kernel_long_t;
pub type __kernel_time64_t = ::std::os::raw::c_longlong;
pub type __kernel_clock_t = __kernel_long_t;
pub type __kernel_timer_t = ::std::os::raw::c_int;
pub type __kernel_clockid_t = ::std::os::raw::c_int;
pub type __kernel_caddr_t = *mut ::std::os::raw::c_char;
pub type __kernel_uid16_t = ::std::os::raw::c_ushort;
pub type __kernel_gid16_t = ::std::os::raw::c_ushort;
pub type __le16 = __u16;
pub type __be16 = __u16;
pub type __le32 = __u32;
pub type __be32 = __u32;
pub type __le64 = __u64;
pub type __be64 = __u64;
pub type __sum16 = __u16;
pub type __wsum = __u32;
pub type __poll_t = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pthread_attr_t {
    pub flags: u32,
    pub stack_base: *mut ::std::os::raw::c_void,
    pub stack_size: usize,
    pub guard_size: usize,
    pub sched_policy: i32,
    pub sched_priority: i32,
    pub __reserved: [::std::os::raw::c_char; 16usize],
}
#[test]
fn bindgen_test_layout_pthread_attr_t() {
    const UNINIT: ::std::mem::MaybeUninit<pthread_attr_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pthread_attr_t>(),
        56usize,
        concat!("Size of: ", stringify!(pthread_attr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_attr_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_attr_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).flags) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_attr_t),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).stack_base) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_attr_t),
            "::",
            stringify!(stack_base)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).stack_size) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_attr_t),
            "::",
            stringify!(stack_size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).guard_size) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_attr_t),
            "::",
            stringify!(guard_size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sched_policy) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_attr_t),
            "::",
            stringify!(sched_policy)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sched_priority) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_attr_t),
            "::",
            stringify!(sched_priority)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__reserved) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_attr_t),
            "::",
            stringify!(__reserved)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pthread_barrier_t {
    pub __private: [i64; 4usize],
}
#[test]
fn bindgen_test_layout_pthread_barrier_t() {
    const UNINIT: ::std::mem::MaybeUninit<pthread_barrier_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pthread_barrier_t>(),
        32usize,
        concat!("Size of: ", stringify!(pthread_barrier_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_barrier_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_barrier_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__private) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_barrier_t),
            "::",
            stringify!(__private)
        )
    );
}
pub type pthread_barrierattr_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pthread_cond_t {
    pub __private: [i32; 12usize],
}
#[test]
fn bindgen_test_layout_pthread_cond_t() {
    const UNINIT: ::std::mem::MaybeUninit<pthread_cond_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pthread_cond_t>(),
        48usize,
        concat!("Size of: ", stringify!(pthread_cond_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_cond_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_cond_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__private) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_cond_t),
            "::",
            stringify!(__private)
        )
    );
}
pub type pthread_condattr_t = ::std::os::raw::c_long;
pub type pthread_key_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pthread_mutex_t {
    pub __private: [i32; 10usize],
}
#[test]
fn bindgen_test_layout_pthread_mutex_t() {
    const UNINIT: ::std::mem::MaybeUninit<pthread_mutex_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pthread_mutex_t>(),
        40usize,
        concat!("Size of: ", stringify!(pthread_mutex_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_mutex_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_mutex_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__private) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutex_t),
            "::",
            stringify!(__private)
        )
    );
}
pub type pthread_mutexattr_t = ::std::os::raw::c_long;
pub type pthread_once_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pthread_rwlock_t {
    pub __private: [i32; 14usize],
}
#[test]
fn bindgen_test_layout_pthread_rwlock_t() {
    const UNINIT: ::std::mem::MaybeUninit<pthread_rwlock_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pthread_rwlock_t>(),
        56usize,
        concat!("Size of: ", stringify!(pthread_rwlock_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_rwlock_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_rwlock_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__private) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlock_t),
            "::",
            stringify!(__private)
        )
    );
}
pub type pthread_rwlockattr_t = ::std::os::raw::c_long;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pthread_spinlock_t {
    pub __private: i64,
}
#[test]
fn bindgen_test_layout_pthread_spinlock_t() {
    const UNINIT: ::std::mem::MaybeUninit<pthread_spinlock_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pthread_spinlock_t>(),
        8usize,
        concat!("Size of: ", stringify!(pthread_spinlock_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_spinlock_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_spinlock_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__private) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_spinlock_t),
            "::",
            stringify!(__private)
        )
    );
}
pub type pthread_t = ::std::os::raw::c_long;
pub type __gid_t = __kernel_gid32_t;
pub type gid_t = __gid_t;
pub type __uid_t = __kernel_uid32_t;
pub type uid_t = __uid_t;
pub type __pid_t = __kernel_pid_t;
pub type pid_t = __pid_t;
pub type __id_t = u32;
pub type id_t = __id_t;
pub type blkcnt_t = ::std::os::raw::c_ulong;
pub type blksize_t = ::std::os::raw::c_ulong;
pub type caddr_t = __kernel_caddr_t;
pub type clock_t = __kernel_clock_t;
pub type __clockid_t = __kernel_clockid_t;
pub type clockid_t = __clockid_t;
pub type daddr_t = __kernel_daddr_t;
pub type fsblkcnt_t = ::std::os::raw::c_ulong;
pub type fsfilcnt_t = ::std::os::raw::c_ulong;
pub type __mode_t = __kernel_mode_t;
pub type mode_t = __mode_t;
pub type __key_t = __kernel_key_t;
pub type key_t = __key_t;
pub type __ino_t = __kernel_ino_t;
pub type ino_t = __ino_t;
pub type ino64_t = u64;
pub type __nlink_t = u32;
pub type nlink_t = __nlink_t;
pub type __timer_t = *mut ::std::os::raw::c_void;
pub type timer_t = __timer_t;
pub type __suseconds_t = __kernel_suseconds_t;
pub type suseconds_t = __suseconds_t;
pub type __useconds_t = u32;
pub type useconds_t = __useconds_t;
pub type dev_t = u64;
pub type __time_t = __kernel_time_t;
pub type time_t = __time_t;
pub type off_t = i64;
pub type loff_t = off_t;
pub type off64_t = loff_t;
pub type __socklen_t = u32;
pub type socklen_t = __socklen_t;
pub type __va_list = __builtin_va_list;
pub type uint_t = ::std::os::raw::c_uint;
pub type uint = ::std::os::raw::c_uint;
pub type u_char = ::std::os::raw::c_uchar;
pub type u_short = ::std::os::raw::c_ushort;
pub type u_int = ::std::os::raw::c_uint;
pub type u_long = ::std::os::raw::c_ulong;
pub type u_int32_t = u32;
pub type u_int16_t = u16;
pub type u_int8_t = u8;
pub type u_int64_t = u64;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct AAssetManager {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct AAssetDir {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct AAsset {
    _unused: [u8; 0],
}
#[doc = " No specific information about how data will be accessed."]
pub const AASSET_MODE_UNKNOWN: _bindgen_ty_1 = 0;
#[doc = " Read chunks, and seek forward and backward."]
pub const AASSET_MODE_RANDOM: _bindgen_ty_1 = 1;
#[doc = " Read sequentially, with an occasional forward seek."]
pub const AASSET_MODE_STREAMING: _bindgen_ty_1 = 2;
#[doc = " Caller plans to ask for a read-only buffer with all data."]
pub const AASSET_MODE_BUFFER: _bindgen_ty_1 = 3;
#[doc = " Available access modes for opening assets with {@link AAssetManager_open}"]
pub type _bindgen_ty_1 = ::std::os::raw::c_uint;
extern "C" {
    #[doc = " Open the named directory within the asset hierarchy.  The directory can then\n be inspected with the AAssetDir functions.  To open the top-level directory,\n pass in \"\" as the dirName.\n\n The object returned here should be freed by calling AAssetDir_close()."]
    pub fn AAssetManager_openDir(
        mgr: *mut AAssetManager,
        dirName: *const ::std::os::raw::c_char,
    ) -> *mut AAssetDir;
}
extern "C" {
    #[doc = " Open an asset.\n\n The object returned here should be freed by calling AAsset_close()."]
    pub fn AAssetManager_open(
        mgr: *mut AAssetManager,
        filename: *const ::std::os::raw::c_char,
        mode: ::std::os::raw::c_int,
    ) -> *mut AAsset;
}
extern "C" {
    #[doc = " Iterate over the files in an asset directory.  A NULL string is returned\n when all the file names have been returned.\n\n The returned file name is suitable for passing to AAssetManager_open().\n\n The string returned here is owned by the AssetDir implementation and is not\n guaranteed to remain valid if any other calls are made on this AAssetDir\n instance."]
    pub fn AAssetDir_getNextFileName(assetDir: *mut AAssetDir) -> *const ::std::os::raw::c_char;
}
extern "C" {
    #[doc = " Reset the iteration state of AAssetDir_getNextFileName() to the beginning."]
    pub fn AAssetDir_rewind(assetDir: *mut AAssetDir);
}
extern "C" {
    #[doc = " Close an opened AAssetDir, freeing any related resources."]
    pub fn AAssetDir_close(assetDir: *mut AAssetDir);
}
extern "C" {
    #[doc = " Attempt to read 'count' bytes of data from the current offset.\n\n Returns the number of bytes read, zero on EOF, or < 0 on error."]
    pub fn AAsset_read(
        asset: *mut AAsset,
        buf: *mut ::std::os::raw::c_void,
        count: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Seek to the specified offset within the asset data.  'whence' uses the\n same constants as lseek()/fseek().\n\n Returns the new position on success, or (off_t) -1 on error."]
    pub fn AAsset_seek(asset: *mut AAsset, offset: off_t, whence: ::std::os::raw::c_int) -> off_t;
}
extern "C" {
    #[doc = " Seek to the specified offset within the asset data.  'whence' uses the\n same constants as lseek()/fseek().\n\n Uses 64-bit data type for large files as opposed to the 32-bit type used\n by AAsset_seek.\n\n Returns the new position on success, or (off64_t) -1 on error."]
    pub fn AAsset_seek64(
        asset: *mut AAsset,
        offset: off64_t,
        whence: ::std::os::raw::c_int,
    ) -> off64_t;
}
extern "C" {
    #[doc = " Close the asset, freeing all associated resources."]
    pub fn AAsset_close(asset: *mut AAsset);
}
extern "C" {
    #[doc = " Get a pointer to a buffer holding the entire contents of the assset.\n\n Returns NULL on failure."]
    pub fn AAsset_getBuffer(asset: *mut AAsset) -> *const ::std::os::raw::c_void;
}
extern "C" {
    #[doc = " Report the total size of the asset data."]
    pub fn AAsset_getLength(asset: *mut AAsset) -> off_t;
}
extern "C" {
    #[doc = " Report the total size of the asset data. Reports the size using a 64-bit\n number insted of 32-bit as AAsset_getLength."]
    pub fn AAsset_getLength64(asset: *mut AAsset) -> off64_t;
}
extern "C" {
    #[doc = " Report the total amount of asset data that can be read from the current position."]
    pub fn AAsset_getRemainingLength(asset: *mut AAsset) -> off_t;
}
extern "C" {
    #[doc = " Report the total amount of asset data that can be read from the current position.\n\n Uses a 64-bit number instead of a 32-bit number as AAsset_getRemainingLength does."]
    pub fn AAsset_getRemainingLength64(asset: *mut AAsset) -> off64_t;
}
extern "C" {
    #[doc = " Open a new file descriptor that can be used to read the asset data. If the\n start or length cannot be represented by a 32-bit number, it will be\n truncated. If the file is large, use AAsset_openFileDescriptor64 instead.\n\n Returns < 0 if direct fd access is not possible (for example, if the asset is\n compressed)."]
    pub fn AAsset_openFileDescriptor(
        asset: *mut AAsset,
        outStart: *mut off_t,
        outLength: *mut off_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Open a new file descriptor that can be used to read the asset data.\n\n Uses a 64-bit number for the offset and length instead of 32-bit instead of\n as AAsset_openFileDescriptor does.\n\n Returns < 0 if direct fd access is not possible (for example, if the asset is\n compressed)."]
    pub fn AAsset_openFileDescriptor64(
        asset: *mut AAsset,
        outStart: *mut off64_t,
        outLength: *mut off64_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Returns whether this asset's internal buffer is allocated in ordinary RAM (i.e. not\n mmapped)."]
    pub fn AAsset_isAllocated(asset: *mut AAsset) -> ::std::os::raw::c_int;
}
#[doc = " Unknown key code."]
pub const AKEYCODE_UNKNOWN: _bindgen_ty_2 = 0;
#[doc = " Soft Left key.\n Usually situated below the display on phones and used as a multi-function\n feature key for selecting a software defined function shown on the bottom left\n of the display."]
pub const AKEYCODE_SOFT_LEFT: _bindgen_ty_2 = 1;
#[doc = " Soft Right key.\n Usually situated below the display on phones and used as a multi-function\n feature key for selecting a software defined function shown on the bottom right\n of the display."]
pub const AKEYCODE_SOFT_RIGHT: _bindgen_ty_2 = 2;
#[doc = " Home key.\n This key is handled by the framework and is never delivered to applications."]
pub const AKEYCODE_HOME: _bindgen_ty_2 = 3;
#[doc = " Back key."]
pub const AKEYCODE_BACK: _bindgen_ty_2 = 4;
#[doc = " Call key."]
pub const AKEYCODE_CALL: _bindgen_ty_2 = 5;
#[doc = " End Call key."]
pub const AKEYCODE_ENDCALL: _bindgen_ty_2 = 6;
#[doc = " '0' key."]
pub const AKEYCODE_0: _bindgen_ty_2 = 7;
#[doc = " '1' key."]
pub const AKEYCODE_1: _bindgen_ty_2 = 8;
#[doc = " '2' key."]
pub const AKEYCODE_2: _bindgen_ty_2 = 9;
#[doc = " '3' key."]
pub const AKEYCODE_3: _bindgen_ty_2 = 10;
#[doc = " '4' key."]
pub const AKEYCODE_4: _bindgen_ty_2 = 11;
#[doc = " '5' key."]
pub const AKEYCODE_5: _bindgen_ty_2 = 12;
#[doc = " '6' key."]
pub const AKEYCODE_6: _bindgen_ty_2 = 13;
#[doc = " '7' key."]
pub const AKEYCODE_7: _bindgen_ty_2 = 14;
#[doc = " '8' key."]
pub const AKEYCODE_8: _bindgen_ty_2 = 15;
#[doc = " '9' key."]
pub const AKEYCODE_9: _bindgen_ty_2 = 16;
#[doc = " '*' key."]
pub const AKEYCODE_STAR: _bindgen_ty_2 = 17;
#[doc = " '#' key."]
pub const AKEYCODE_POUND: _bindgen_ty_2 = 18;
#[doc = " Directional Pad Up key.\n May also be synthesized from trackball motions."]
pub const AKEYCODE_DPAD_UP: _bindgen_ty_2 = 19;
#[doc = " Directional Pad Down key.\n May also be synthesized from trackball motions."]
pub const AKEYCODE_DPAD_DOWN: _bindgen_ty_2 = 20;
#[doc = " Directional Pad Left key.\n May also be synthesized from trackball motions."]
pub const AKEYCODE_DPAD_LEFT: _bindgen_ty_2 = 21;
#[doc = " Directional Pad Right key.\n May also be synthesized from trackball motions."]
pub const AKEYCODE_DPAD_RIGHT: _bindgen_ty_2 = 22;
#[doc = " Directional Pad Center key.\n May also be synthesized from trackball motions."]
pub const AKEYCODE_DPAD_CENTER: _bindgen_ty_2 = 23;
#[doc = " Volume Up key.\n Adjusts the speaker volume up."]
pub const AKEYCODE_VOLUME_UP: _bindgen_ty_2 = 24;
#[doc = " Volume Down key.\n Adjusts the speaker volume down."]
pub const AKEYCODE_VOLUME_DOWN: _bindgen_ty_2 = 25;
#[doc = " Power key."]
pub const AKEYCODE_POWER: _bindgen_ty_2 = 26;
#[doc = " Camera key.\n Used to launch a camera application or take pictures."]
pub const AKEYCODE_CAMERA: _bindgen_ty_2 = 27;
#[doc = " Clear key."]
pub const AKEYCODE_CLEAR: _bindgen_ty_2 = 28;
#[doc = " 'A' key."]
pub const AKEYCODE_A: _bindgen_ty_2 = 29;
#[doc = " 'B' key."]
pub const AKEYCODE_B: _bindgen_ty_2 = 30;
#[doc = " 'C' key."]
pub const AKEYCODE_C: _bindgen_ty_2 = 31;
#[doc = " 'D' key."]
pub const AKEYCODE_D: _bindgen_ty_2 = 32;
#[doc = " 'E' key."]
pub const AKEYCODE_E: _bindgen_ty_2 = 33;
#[doc = " 'F' key."]
pub const AKEYCODE_F: _bindgen_ty_2 = 34;
#[doc = " 'G' key."]
pub const AKEYCODE_G: _bindgen_ty_2 = 35;
#[doc = " 'H' key."]
pub const AKEYCODE_H: _bindgen_ty_2 = 36;
#[doc = " 'I' key."]
pub const AKEYCODE_I: _bindgen_ty_2 = 37;
#[doc = " 'J' key."]
pub const AKEYCODE_J: _bindgen_ty_2 = 38;
#[doc = " 'K' key."]
pub const AKEYCODE_K: _bindgen_ty_2 = 39;
#[doc = " 'L' key."]
pub const AKEYCODE_L: _bindgen_ty_2 = 40;
#[doc = " 'M' key."]
pub const AKEYCODE_M: _bindgen_ty_2 = 41;
#[doc = " 'N' key."]
pub const AKEYCODE_N: _bindgen_ty_2 = 42;
#[doc = " 'O' key."]
pub const AKEYCODE_O: _bindgen_ty_2 = 43;
#[doc = " 'P' key."]
pub const AKEYCODE_P: _bindgen_ty_2 = 44;
#[doc = " 'Q' key."]
pub const AKEYCODE_Q: _bindgen_ty_2 = 45;
#[doc = " 'R' key."]
pub const AKEYCODE_R: _bindgen_ty_2 = 46;
#[doc = " 'S' key."]
pub const AKEYCODE_S: _bindgen_ty_2 = 47;
#[doc = " 'T' key."]
pub const AKEYCODE_T: _bindgen_ty_2 = 48;
#[doc = " 'U' key."]
pub const AKEYCODE_U: _bindgen_ty_2 = 49;
#[doc = " 'V' key."]
pub const AKEYCODE_V: _bindgen_ty_2 = 50;
#[doc = " 'W' key."]
pub const AKEYCODE_W: _bindgen_ty_2 = 51;
#[doc = " 'X' key."]
pub const AKEYCODE_X: _bindgen_ty_2 = 52;
#[doc = " 'Y' key."]
pub const AKEYCODE_Y: _bindgen_ty_2 = 53;
#[doc = " 'Z' key."]
pub const AKEYCODE_Z: _bindgen_ty_2 = 54;
#[doc = " ',' key."]
pub const AKEYCODE_COMMA: _bindgen_ty_2 = 55;
#[doc = " '.' key."]
pub const AKEYCODE_PERIOD: _bindgen_ty_2 = 56;
#[doc = " Left Alt modifier key."]
pub const AKEYCODE_ALT_LEFT: _bindgen_ty_2 = 57;
#[doc = " Right Alt modifier key."]
pub const AKEYCODE_ALT_RIGHT: _bindgen_ty_2 = 58;
#[doc = " Left Shift modifier key."]
pub const AKEYCODE_SHIFT_LEFT: _bindgen_ty_2 = 59;
#[doc = " Right Shift modifier key."]
pub const AKEYCODE_SHIFT_RIGHT: _bindgen_ty_2 = 60;
#[doc = " Tab key."]
pub const AKEYCODE_TAB: _bindgen_ty_2 = 61;
#[doc = " Space key."]
pub const AKEYCODE_SPACE: _bindgen_ty_2 = 62;
#[doc = " Symbol modifier key.\n Used to enter alternate symbols."]
pub const AKEYCODE_SYM: _bindgen_ty_2 = 63;
#[doc = " Explorer special function key.\n Used to launch a browser application."]
pub const AKEYCODE_EXPLORER: _bindgen_ty_2 = 64;
#[doc = " Envelope special function key.\n Used to launch a mail application."]
pub const AKEYCODE_ENVELOPE: _bindgen_ty_2 = 65;
#[doc = " Enter key."]
pub const AKEYCODE_ENTER: _bindgen_ty_2 = 66;
#[doc = " Backspace key.\n Deletes characters before the insertion point, unlike {@link AKEYCODE_FORWARD_DEL}."]
pub const AKEYCODE_DEL: _bindgen_ty_2 = 67;
#[doc = " '`' (backtick) key."]
pub const AKEYCODE_GRAVE: _bindgen_ty_2 = 68;
#[doc = " '-'."]
pub const AKEYCODE_MINUS: _bindgen_ty_2 = 69;
#[doc = " '=' key."]
pub const AKEYCODE_EQUALS: _bindgen_ty_2 = 70;
#[doc = " '[' key."]
pub const AKEYCODE_LEFT_BRACKET: _bindgen_ty_2 = 71;
#[doc = " ']' key."]
pub const AKEYCODE_RIGHT_BRACKET: _bindgen_ty_2 = 72;
#[doc = " '\\' key."]
pub const AKEYCODE_BACKSLASH: _bindgen_ty_2 = 73;
#[doc = " ';' key."]
pub const AKEYCODE_SEMICOLON: _bindgen_ty_2 = 74;
#[doc = " ''' (apostrophe) key."]
pub const AKEYCODE_APOSTROPHE: _bindgen_ty_2 = 75;
#[doc = " '/' key."]
pub const AKEYCODE_SLASH: _bindgen_ty_2 = 76;
#[doc = " '@' key."]
pub const AKEYCODE_AT: _bindgen_ty_2 = 77;
#[doc = " Number modifier key.\n Used to enter numeric symbols.\n This key is not {@link AKEYCODE_NUM_LOCK}; it is more like {@link AKEYCODE_ALT_LEFT}."]
pub const AKEYCODE_NUM: _bindgen_ty_2 = 78;
#[doc = " Headset Hook key.\n Used to hang up calls and stop media."]
pub const AKEYCODE_HEADSETHOOK: _bindgen_ty_2 = 79;
#[doc = " Camera Focus key.\n Used to focus the camera."]
pub const AKEYCODE_FOCUS: _bindgen_ty_2 = 80;
#[doc = " '+' key."]
pub const AKEYCODE_PLUS: _bindgen_ty_2 = 81;
#[doc = " Menu key."]
pub const AKEYCODE_MENU: _bindgen_ty_2 = 82;
#[doc = " Notification key."]
pub const AKEYCODE_NOTIFICATION: _bindgen_ty_2 = 83;
#[doc = " Search key."]
pub const AKEYCODE_SEARCH: _bindgen_ty_2 = 84;
#[doc = " Play/Pause media key."]
pub const AKEYCODE_MEDIA_PLAY_PAUSE: _bindgen_ty_2 = 85;
#[doc = " Stop media key."]
pub const AKEYCODE_MEDIA_STOP: _bindgen_ty_2 = 86;
#[doc = " Play Next media key."]
pub const AKEYCODE_MEDIA_NEXT: _bindgen_ty_2 = 87;
#[doc = " Play Previous media key."]
pub const AKEYCODE_MEDIA_PREVIOUS: _bindgen_ty_2 = 88;
#[doc = " Rewind media key."]
pub const AKEYCODE_MEDIA_REWIND: _bindgen_ty_2 = 89;
#[doc = " Fast Forward media key."]
pub const AKEYCODE_MEDIA_FAST_FORWARD: _bindgen_ty_2 = 90;
#[doc = " Mute key.\n Mutes the microphone, unlike {@link AKEYCODE_VOLUME_MUTE}."]
pub const AKEYCODE_MUTE: _bindgen_ty_2 = 91;
#[doc = " Page Up key."]
pub const AKEYCODE_PAGE_UP: _bindgen_ty_2 = 92;
#[doc = " Page Down key."]
pub const AKEYCODE_PAGE_DOWN: _bindgen_ty_2 = 93;
#[doc = " Picture Symbols modifier key.\n Used to switch symbol sets (Emoji, Kao-moji)."]
pub const AKEYCODE_PICTSYMBOLS: _bindgen_ty_2 = 94;
#[doc = " Switch Charset modifier key.\n Used to switch character sets (Kanji, Katakana)."]
pub const AKEYCODE_SWITCH_CHARSET: _bindgen_ty_2 = 95;
#[doc = " A Button key.\n On a game controller, the A button should be either the button labeled A\n or the first button on the bottom row of controller buttons."]
pub const AKEYCODE_BUTTON_A: _bindgen_ty_2 = 96;
#[doc = " B Button key.\n On a game controller, the B button should be either the button labeled B\n or the second button on the bottom row of controller buttons."]
pub const AKEYCODE_BUTTON_B: _bindgen_ty_2 = 97;
#[doc = " C Button key.\n On a game controller, the C button should be either the button labeled C\n or the third button on the bottom row of controller buttons."]
pub const AKEYCODE_BUTTON_C: _bindgen_ty_2 = 98;
#[doc = " X Button key.\n On a game controller, the X button should be either the button labeled X\n or the first button on the upper row of controller buttons."]
pub const AKEYCODE_BUTTON_X: _bindgen_ty_2 = 99;
#[doc = " Y Button key.\n On a game controller, the Y button should be either the button labeled Y\n or the second button on the upper row of controller buttons."]
pub const AKEYCODE_BUTTON_Y: _bindgen_ty_2 = 100;
#[doc = " Z Button key.\n On a game controller, the Z button should be either the button labeled Z\n or the third button on the upper row of controller buttons."]
pub const AKEYCODE_BUTTON_Z: _bindgen_ty_2 = 101;
#[doc = " L1 Button key.\n On a game controller, the L1 button should be either the button labeled L1 (or L)\n or the top left trigger button."]
pub const AKEYCODE_BUTTON_L1: _bindgen_ty_2 = 102;
#[doc = " R1 Button key.\n On a game controller, the R1 button should be either the button labeled R1 (or R)\n or the top right trigger button."]
pub const AKEYCODE_BUTTON_R1: _bindgen_ty_2 = 103;
#[doc = " L2 Button key.\n On a game controller, the L2 button should be either the button labeled L2\n or the bottom left trigger button."]
pub const AKEYCODE_BUTTON_L2: _bindgen_ty_2 = 104;
#[doc = " R2 Button key.\n On a game controller, the R2 button should be either the button labeled R2\n or the bottom right trigger button."]
pub const AKEYCODE_BUTTON_R2: _bindgen_ty_2 = 105;
#[doc = " Left Thumb Button key.\n On a game controller, the left thumb button indicates that the left (or only)\n joystick is pressed."]
pub const AKEYCODE_BUTTON_THUMBL: _bindgen_ty_2 = 106;
#[doc = " Right Thumb Button key.\n On a game controller, the right thumb button indicates that the right\n joystick is pressed."]
pub const AKEYCODE_BUTTON_THUMBR: _bindgen_ty_2 = 107;
#[doc = " Start Button key.\n On a game controller, the button labeled Start."]
pub const AKEYCODE_BUTTON_START: _bindgen_ty_2 = 108;
#[doc = " Select Button key.\n On a game controller, the button labeled Select."]
pub const AKEYCODE_BUTTON_SELECT: _bindgen_ty_2 = 109;
#[doc = " Mode Button key.\n On a game controller, the button labeled Mode."]
pub const AKEYCODE_BUTTON_MODE: _bindgen_ty_2 = 110;
#[doc = " Escape key."]
pub const AKEYCODE_ESCAPE: _bindgen_ty_2 = 111;
#[doc = " Forward Delete key.\n Deletes characters ahead of the insertion point, unlike {@link AKEYCODE_DEL}."]
pub const AKEYCODE_FORWARD_DEL: _bindgen_ty_2 = 112;
#[doc = " Left Control modifier key."]
pub const AKEYCODE_CTRL_LEFT: _bindgen_ty_2 = 113;
#[doc = " Right Control modifier key."]
pub const AKEYCODE_CTRL_RIGHT: _bindgen_ty_2 = 114;
#[doc = " Caps Lock key."]
pub const AKEYCODE_CAPS_LOCK: _bindgen_ty_2 = 115;
#[doc = " Scroll Lock key."]
pub const AKEYCODE_SCROLL_LOCK: _bindgen_ty_2 = 116;
#[doc = " Left Meta modifier key."]
pub const AKEYCODE_META_LEFT: _bindgen_ty_2 = 117;
#[doc = " Right Meta modifier key."]
pub const AKEYCODE_META_RIGHT: _bindgen_ty_2 = 118;
#[doc = " Function modifier key."]
pub const AKEYCODE_FUNCTION: _bindgen_ty_2 = 119;
#[doc = " System Request / Print Screen key."]
pub const AKEYCODE_SYSRQ: _bindgen_ty_2 = 120;
#[doc = " Break / Pause key."]
pub const AKEYCODE_BREAK: _bindgen_ty_2 = 121;
#[doc = " Home Movement key.\n Used for scrolling or moving the cursor around to the start of a line\n or to the top of a list."]
pub const AKEYCODE_MOVE_HOME: _bindgen_ty_2 = 122;
#[doc = " End Movement key.\n Used for scrolling or moving the cursor around to the end of a line\n or to the bottom of a list."]
pub const AKEYCODE_MOVE_END: _bindgen_ty_2 = 123;
#[doc = " Insert key.\n Toggles insert / overwrite edit mode."]
pub const AKEYCODE_INSERT: _bindgen_ty_2 = 124;
#[doc = " Forward key.\n Navigates forward in the history stack.  Complement of {@link AKEYCODE_BACK}."]
pub const AKEYCODE_FORWARD: _bindgen_ty_2 = 125;
#[doc = " Play media key."]
pub const AKEYCODE_MEDIA_PLAY: _bindgen_ty_2 = 126;
#[doc = " Pause media key."]
pub const AKEYCODE_MEDIA_PAUSE: _bindgen_ty_2 = 127;
#[doc = " Close media key.\n May be used to close a CD tray, for example."]
pub const AKEYCODE_MEDIA_CLOSE: _bindgen_ty_2 = 128;
#[doc = " Eject media key.\n May be used to eject a CD tray, for example."]
pub const AKEYCODE_MEDIA_EJECT: _bindgen_ty_2 = 129;
#[doc = " Record media key."]
pub const AKEYCODE_MEDIA_RECORD: _bindgen_ty_2 = 130;
#[doc = " F1 key."]
pub const AKEYCODE_F1: _bindgen_ty_2 = 131;
#[doc = " F2 key."]
pub const AKEYCODE_F2: _bindgen_ty_2 = 132;
#[doc = " F3 key."]
pub const AKEYCODE_F3: _bindgen_ty_2 = 133;
#[doc = " F4 key."]
pub const AKEYCODE_F4: _bindgen_ty_2 = 134;
#[doc = " F5 key."]
pub const AKEYCODE_F5: _bindgen_ty_2 = 135;
#[doc = " F6 key."]
pub const AKEYCODE_F6: _bindgen_ty_2 = 136;
#[doc = " F7 key."]
pub const AKEYCODE_F7: _bindgen_ty_2 = 137;
#[doc = " F8 key."]
pub const AKEYCODE_F8: _bindgen_ty_2 = 138;
#[doc = " F9 key."]
pub const AKEYCODE_F9: _bindgen_ty_2 = 139;
#[doc = " F10 key."]
pub const AKEYCODE_F10: _bindgen_ty_2 = 140;
#[doc = " F11 key."]
pub const AKEYCODE_F11: _bindgen_ty_2 = 141;
#[doc = " F12 key."]
pub const AKEYCODE_F12: _bindgen_ty_2 = 142;
#[doc = " Num Lock key.\n This is the Num Lock key; it is different from {@link AKEYCODE_NUM}.\n This key alters the behavior of other keys on the numeric keypad."]
pub const AKEYCODE_NUM_LOCK: _bindgen_ty_2 = 143;
#[doc = " Numeric keypad '0' key."]
pub const AKEYCODE_NUMPAD_0: _bindgen_ty_2 = 144;
#[doc = " Numeric keypad '1' key."]
pub const AKEYCODE_NUMPAD_1: _bindgen_ty_2 = 145;
#[doc = " Numeric keypad '2' key."]
pub const AKEYCODE_NUMPAD_2: _bindgen_ty_2 = 146;
#[doc = " Numeric keypad '3' key."]
pub const AKEYCODE_NUMPAD_3: _bindgen_ty_2 = 147;
#[doc = " Numeric keypad '4' key."]
pub const AKEYCODE_NUMPAD_4: _bindgen_ty_2 = 148;
#[doc = " Numeric keypad '5' key."]
pub const AKEYCODE_NUMPAD_5: _bindgen_ty_2 = 149;
#[doc = " Numeric keypad '6' key."]
pub const AKEYCODE_NUMPAD_6: _bindgen_ty_2 = 150;
#[doc = " Numeric keypad '7' key."]
pub const AKEYCODE_NUMPAD_7: _bindgen_ty_2 = 151;
#[doc = " Numeric keypad '8' key."]
pub const AKEYCODE_NUMPAD_8: _bindgen_ty_2 = 152;
#[doc = " Numeric keypad '9' key."]
pub const AKEYCODE_NUMPAD_9: _bindgen_ty_2 = 153;
#[doc = " Numeric keypad '/' key (for division)."]
pub const AKEYCODE_NUMPAD_DIVIDE: _bindgen_ty_2 = 154;
#[doc = " Numeric keypad '*' key (for multiplication)."]
pub const AKEYCODE_NUMPAD_MULTIPLY: _bindgen_ty_2 = 155;
#[doc = " Numeric keypad '-' key (for subtraction)."]
pub const AKEYCODE_NUMPAD_SUBTRACT: _bindgen_ty_2 = 156;
#[doc = " Numeric keypad '+' key (for addition)."]
pub const AKEYCODE_NUMPAD_ADD: _bindgen_ty_2 = 157;
#[doc = " Numeric keypad '.' key (for decimals or digit grouping)."]
pub const AKEYCODE_NUMPAD_DOT: _bindgen_ty_2 = 158;
#[doc = " Numeric keypad ',' key (for decimals or digit grouping)."]
pub const AKEYCODE_NUMPAD_COMMA: _bindgen_ty_2 = 159;
#[doc = " Numeric keypad Enter key."]
pub const AKEYCODE_NUMPAD_ENTER: _bindgen_ty_2 = 160;
#[doc = " Numeric keypad '=' key."]
pub const AKEYCODE_NUMPAD_EQUALS: _bindgen_ty_2 = 161;
#[doc = " Numeric keypad '(' key."]
pub const AKEYCODE_NUMPAD_LEFT_PAREN: _bindgen_ty_2 = 162;
#[doc = " Numeric keypad ')' key."]
pub const AKEYCODE_NUMPAD_RIGHT_PAREN: _bindgen_ty_2 = 163;
#[doc = " Volume Mute key.\n Mutes the speaker, unlike {@link AKEYCODE_MUTE}.\n This key should normally be implemented as a toggle such that the first press\n mutes the speaker and the second press restores the original volume."]
pub const AKEYCODE_VOLUME_MUTE: _bindgen_ty_2 = 164;
#[doc = " Info key.\n Common on TV remotes to show additional information related to what is\n currently being viewed."]
pub const AKEYCODE_INFO: _bindgen_ty_2 = 165;
#[doc = " Channel up key.\n On TV remotes, increments the television channel."]
pub const AKEYCODE_CHANNEL_UP: _bindgen_ty_2 = 166;
#[doc = " Channel down key.\n On TV remotes, decrements the television channel."]
pub const AKEYCODE_CHANNEL_DOWN: _bindgen_ty_2 = 167;
#[doc = " Zoom in key."]
pub const AKEYCODE_ZOOM_IN: _bindgen_ty_2 = 168;
#[doc = " Zoom out key."]
pub const AKEYCODE_ZOOM_OUT: _bindgen_ty_2 = 169;
#[doc = " TV key.\n On TV remotes, switches to viewing live TV."]
pub const AKEYCODE_TV: _bindgen_ty_2 = 170;
#[doc = " Window key.\n On TV remotes, toggles picture-in-picture mode or other windowing functions."]
pub const AKEYCODE_WINDOW: _bindgen_ty_2 = 171;
#[doc = " Guide key.\n On TV remotes, shows a programming guide."]
pub const AKEYCODE_GUIDE: _bindgen_ty_2 = 172;
#[doc = " DVR key.\n On some TV remotes, switches to a DVR mode for recorded shows."]
pub const AKEYCODE_DVR: _bindgen_ty_2 = 173;
#[doc = " Bookmark key.\n On some TV remotes, bookmarks content or web pages."]
pub const AKEYCODE_BOOKMARK: _bindgen_ty_2 = 174;
#[doc = " Toggle captions key.\n Switches the mode for closed-captioning text, for example during television shows."]
pub const AKEYCODE_CAPTIONS: _bindgen_ty_2 = 175;
#[doc = " Settings key.\n Starts the system settings activity."]
pub const AKEYCODE_SETTINGS: _bindgen_ty_2 = 176;
#[doc = " TV power key.\n On TV remotes, toggles the power on a television screen."]
pub const AKEYCODE_TV_POWER: _bindgen_ty_2 = 177;
#[doc = " TV input key.\n On TV remotes, switches the input on a television screen."]
pub const AKEYCODE_TV_INPUT: _bindgen_ty_2 = 178;
#[doc = " Set-top-box power key.\n On TV remotes, toggles the power on an external Set-top-box."]
pub const AKEYCODE_STB_POWER: _bindgen_ty_2 = 179;
#[doc = " Set-top-box input key.\n On TV remotes, switches the input mode on an external Set-top-box."]
pub const AKEYCODE_STB_INPUT: _bindgen_ty_2 = 180;
#[doc = " A/V Receiver power key.\n On TV remotes, toggles the power on an external A/V Receiver."]
pub const AKEYCODE_AVR_POWER: _bindgen_ty_2 = 181;
#[doc = " A/V Receiver input key.\n On TV remotes, switches the input mode on an external A/V Receiver."]
pub const AKEYCODE_AVR_INPUT: _bindgen_ty_2 = 182;
#[doc = " Red \"programmable\" key.\n On TV remotes, acts as a contextual/programmable key."]
pub const AKEYCODE_PROG_RED: _bindgen_ty_2 = 183;
#[doc = " Green \"programmable\" key.\n On TV remotes, actsas a contextual/programmable key."]
pub const AKEYCODE_PROG_GREEN: _bindgen_ty_2 = 184;
#[doc = " Yellow \"programmable\" key.\n On TV remotes, acts as a contextual/programmable key."]
pub const AKEYCODE_PROG_YELLOW: _bindgen_ty_2 = 185;
#[doc = " Blue \"programmable\" key.\n On TV remotes, acts as a contextual/programmable key."]
pub const AKEYCODE_PROG_BLUE: _bindgen_ty_2 = 186;
#[doc = " App switch key.\n Should bring up the application switcher dialog."]
pub const AKEYCODE_APP_SWITCH: _bindgen_ty_2 = 187;
#[doc = " Generic Game Pad Button #1."]
pub const AKEYCODE_BUTTON_1: _bindgen_ty_2 = 188;
#[doc = " Generic Game Pad Button #2."]
pub const AKEYCODE_BUTTON_2: _bindgen_ty_2 = 189;
#[doc = " Generic Game Pad Button #3."]
pub const AKEYCODE_BUTTON_3: _bindgen_ty_2 = 190;
#[doc = " Generic Game Pad Button #4."]
pub const AKEYCODE_BUTTON_4: _bindgen_ty_2 = 191;
#[doc = " Generic Game Pad Button #5."]
pub const AKEYCODE_BUTTON_5: _bindgen_ty_2 = 192;
#[doc = " Generic Game Pad Button #6."]
pub const AKEYCODE_BUTTON_6: _bindgen_ty_2 = 193;
#[doc = " Generic Game Pad Button #7."]
pub const AKEYCODE_BUTTON_7: _bindgen_ty_2 = 194;
#[doc = " Generic Game Pad Button #8."]
pub const AKEYCODE_BUTTON_8: _bindgen_ty_2 = 195;
#[doc = " Generic Game Pad Button #9."]
pub const AKEYCODE_BUTTON_9: _bindgen_ty_2 = 196;
#[doc = " Generic Game Pad Button #10."]
pub const AKEYCODE_BUTTON_10: _bindgen_ty_2 = 197;
#[doc = " Generic Game Pad Button #11."]
pub const AKEYCODE_BUTTON_11: _bindgen_ty_2 = 198;
#[doc = " Generic Game Pad Button #12."]
pub const AKEYCODE_BUTTON_12: _bindgen_ty_2 = 199;
#[doc = " Generic Game Pad Button #13."]
pub const AKEYCODE_BUTTON_13: _bindgen_ty_2 = 200;
#[doc = " Generic Game Pad Button #14."]
pub const AKEYCODE_BUTTON_14: _bindgen_ty_2 = 201;
#[doc = " Generic Game Pad Button #15."]
pub const AKEYCODE_BUTTON_15: _bindgen_ty_2 = 202;
#[doc = " Generic Game Pad Button #16."]
pub const AKEYCODE_BUTTON_16: _bindgen_ty_2 = 203;
#[doc = " Language Switch key.\n Toggles the current input language such as switching between English and Japanese on\n a QWERTY keyboard.  On some devices, the same function may be performed by\n pressing Shift+Spacebar."]
pub const AKEYCODE_LANGUAGE_SWITCH: _bindgen_ty_2 = 204;
#[doc = " Manner Mode key.\n Toggles silent or vibrate mode on and off to make the device behave more politely\n in certain settings such as on a crowded train.  On some devices, the key may only\n operate when long-pressed."]
pub const AKEYCODE_MANNER_MODE: _bindgen_ty_2 = 205;
#[doc = " 3D Mode key.\n Toggles the display between 2D and 3D mode."]
pub const AKEYCODE_3D_MODE: _bindgen_ty_2 = 206;
#[doc = " Contacts special function key.\n Used to launch an address book application."]
pub const AKEYCODE_CONTACTS: _bindgen_ty_2 = 207;
#[doc = " Calendar special function key.\n Used to launch a calendar application."]
pub const AKEYCODE_CALENDAR: _bindgen_ty_2 = 208;
#[doc = " Music special function key.\n Used to launch a music player application."]
pub const AKEYCODE_MUSIC: _bindgen_ty_2 = 209;
#[doc = " Calculator special function key.\n Used to launch a calculator application."]
pub const AKEYCODE_CALCULATOR: _bindgen_ty_2 = 210;
#[doc = " Japanese full-width / half-width key."]
pub const AKEYCODE_ZENKAKU_HANKAKU: _bindgen_ty_2 = 211;
#[doc = " Japanese alphanumeric key."]
pub const AKEYCODE_EISU: _bindgen_ty_2 = 212;
#[doc = " Japanese non-conversion key."]
pub const AKEYCODE_MUHENKAN: _bindgen_ty_2 = 213;
#[doc = " Japanese conversion key."]
pub const AKEYCODE_HENKAN: _bindgen_ty_2 = 214;
#[doc = " Japanese katakana / hiragana key."]
pub const AKEYCODE_KATAKANA_HIRAGANA: _bindgen_ty_2 = 215;
#[doc = " Japanese Yen key."]
pub const AKEYCODE_YEN: _bindgen_ty_2 = 216;
#[doc = " Japanese Ro key."]
pub const AKEYCODE_RO: _bindgen_ty_2 = 217;
#[doc = " Japanese kana key."]
pub const AKEYCODE_KANA: _bindgen_ty_2 = 218;
#[doc = " Assist key.\n Launches the global assist activity.  Not delivered to applications."]
pub const AKEYCODE_ASSIST: _bindgen_ty_2 = 219;
#[doc = " Brightness Down key.\n Adjusts the screen brightness down."]
pub const AKEYCODE_BRIGHTNESS_DOWN: _bindgen_ty_2 = 220;
#[doc = " Brightness Up key.\n Adjusts the screen brightness up."]
pub const AKEYCODE_BRIGHTNESS_UP: _bindgen_ty_2 = 221;
#[doc = " Audio Track key.\n Switches the audio tracks."]
pub const AKEYCODE_MEDIA_AUDIO_TRACK: _bindgen_ty_2 = 222;
#[doc = " Sleep key.\n Puts the device to sleep.  Behaves somewhat like {@link AKEYCODE_POWER} but it\n has no effect if the device is already asleep."]
pub const AKEYCODE_SLEEP: _bindgen_ty_2 = 223;
#[doc = " Wakeup key.\n Wakes up the device.  Behaves somewhat like {@link AKEYCODE_POWER} but it\n has no effect if the device is already awake."]
pub const AKEYCODE_WAKEUP: _bindgen_ty_2 = 224;
#[doc = " Pairing key.\n Initiates peripheral pairing mode. Useful for pairing remote control\n devices or game controllers, especially if no other input mode is\n available."]
pub const AKEYCODE_PAIRING: _bindgen_ty_2 = 225;
#[doc = " Media Top Menu key.\n Goes to the top of media menu."]
pub const AKEYCODE_MEDIA_TOP_MENU: _bindgen_ty_2 = 226;
#[doc = " '11' key."]
pub const AKEYCODE_11: _bindgen_ty_2 = 227;
#[doc = " '12' key."]
pub const AKEYCODE_12: _bindgen_ty_2 = 228;
#[doc = " Last Channel key.\n Goes to the last viewed channel."]
pub const AKEYCODE_LAST_CHANNEL: _bindgen_ty_2 = 229;
#[doc = " TV data service key.\n Displays data services like weather, sports."]
pub const AKEYCODE_TV_DATA_SERVICE: _bindgen_ty_2 = 230;
#[doc = " Voice Assist key.\n Launches the global voice assist activity. Not delivered to applications."]
pub const AKEYCODE_VOICE_ASSIST: _bindgen_ty_2 = 231;
#[doc = " Radio key.\n Toggles TV service / Radio service."]
pub const AKEYCODE_TV_RADIO_SERVICE: _bindgen_ty_2 = 232;
#[doc = " Teletext key.\n Displays Teletext service."]
pub const AKEYCODE_TV_TELETEXT: _bindgen_ty_2 = 233;
#[doc = " Number entry key.\n Initiates to enter multi-digit channel nubmber when each digit key is assigned\n for selecting separate channel. Corresponds to Number Entry Mode (0x1D) of CEC\n User Control Code."]
pub const AKEYCODE_TV_NUMBER_ENTRY: _bindgen_ty_2 = 234;
#[doc = " Analog Terrestrial key.\n Switches to analog terrestrial broadcast service."]
pub const AKEYCODE_TV_TERRESTRIAL_ANALOG: _bindgen_ty_2 = 235;
#[doc = " Digital Terrestrial key.\n Switches to digital terrestrial broadcast service."]
pub const AKEYCODE_TV_TERRESTRIAL_DIGITAL: _bindgen_ty_2 = 236;
#[doc = " Satellite key.\n Switches to digital satellite broadcast service."]
pub const AKEYCODE_TV_SATELLITE: _bindgen_ty_2 = 237;
#[doc = " BS key.\n Switches to BS digital satellite broadcasting service available in Japan."]
pub const AKEYCODE_TV_SATELLITE_BS: _bindgen_ty_2 = 238;
#[doc = " CS key.\n Switches to CS digital satellite broadcasting service available in Japan."]
pub const AKEYCODE_TV_SATELLITE_CS: _bindgen_ty_2 = 239;
#[doc = " BS/CS key.\n Toggles between BS and CS digital satellite services."]
pub const AKEYCODE_TV_SATELLITE_SERVICE: _bindgen_ty_2 = 240;
#[doc = " Toggle Network key.\n Toggles selecting broacast services."]
pub const AKEYCODE_TV_NETWORK: _bindgen_ty_2 = 241;
#[doc = " Antenna/Cable key.\n Toggles broadcast input source between antenna and cable."]
pub const AKEYCODE_TV_ANTENNA_CABLE: _bindgen_ty_2 = 242;
#[doc = " HDMI #1 key.\n Switches to HDMI input #1."]
pub const AKEYCODE_TV_INPUT_HDMI_1: _bindgen_ty_2 = 243;
#[doc = " HDMI #2 key.\n Switches to HDMI input #2."]
pub const AKEYCODE_TV_INPUT_HDMI_2: _bindgen_ty_2 = 244;
#[doc = " HDMI #3 key.\n Switches to HDMI input #3."]
pub const AKEYCODE_TV_INPUT_HDMI_3: _bindgen_ty_2 = 245;
#[doc = " HDMI #4 key.\n Switches to HDMI input #4."]
pub const AKEYCODE_TV_INPUT_HDMI_4: _bindgen_ty_2 = 246;
#[doc = " Composite #1 key.\n Switches to composite video input #1."]
pub const AKEYCODE_TV_INPUT_COMPOSITE_1: _bindgen_ty_2 = 247;
#[doc = " Composite #2 key.\n Switches to composite video input #2."]
pub const AKEYCODE_TV_INPUT_COMPOSITE_2: _bindgen_ty_2 = 248;
#[doc = " Component #1 key.\n Switches to component video input #1."]
pub const AKEYCODE_TV_INPUT_COMPONENT_1: _bindgen_ty_2 = 249;
#[doc = " Component #2 key.\n Switches to component video input #2."]
pub const AKEYCODE_TV_INPUT_COMPONENT_2: _bindgen_ty_2 = 250;
#[doc = " VGA #1 key.\n Switches to VGA (analog RGB) input #1."]
pub const AKEYCODE_TV_INPUT_VGA_1: _bindgen_ty_2 = 251;
#[doc = " Audio description key.\n Toggles audio description off / on."]
pub const AKEYCODE_TV_AUDIO_DESCRIPTION: _bindgen_ty_2 = 252;
#[doc = " Audio description mixing volume up key.\n Louden audio description volume as compared with normal audio volume."]
pub const AKEYCODE_TV_AUDIO_DESCRIPTION_MIX_UP: _bindgen_ty_2 = 253;
#[doc = " Audio description mixing volume down key.\n Lessen audio description volume as compared with normal audio volume."]
pub const AKEYCODE_TV_AUDIO_DESCRIPTION_MIX_DOWN: _bindgen_ty_2 = 254;
#[doc = " Zoom mode key.\n Changes Zoom mode (Normal, Full, Zoom, Wide-zoom, etc.)"]
pub const AKEYCODE_TV_ZOOM_MODE: _bindgen_ty_2 = 255;
#[doc = " Contents menu key.\n Goes to the title list. Corresponds to Contents Menu (0x0B) of CEC User Control\n Code"]
pub const AKEYCODE_TV_CONTENTS_MENU: _bindgen_ty_2 = 256;
#[doc = " Media context menu key.\n Goes to the context menu of media contents. Corresponds to Media Context-sensitive\n Menu (0x11) of CEC User Control Code."]
pub const AKEYCODE_TV_MEDIA_CONTEXT_MENU: _bindgen_ty_2 = 257;
#[doc = " Timer programming key.\n Goes to the timer recording menu. Corresponds to Timer Programming (0x54) of\n CEC User Control Code."]
pub const AKEYCODE_TV_TIMER_PROGRAMMING: _bindgen_ty_2 = 258;
#[doc = " Help key."]
pub const AKEYCODE_HELP: _bindgen_ty_2 = 259;
#[doc = " Help key."]
pub const AKEYCODE_NAVIGATE_PREVIOUS: _bindgen_ty_2 = 260;
#[doc = " Help key."]
pub const AKEYCODE_NAVIGATE_NEXT: _bindgen_ty_2 = 261;
#[doc = " Help key."]
pub const AKEYCODE_NAVIGATE_IN: _bindgen_ty_2 = 262;
#[doc = " Help key."]
pub const AKEYCODE_NAVIGATE_OUT: _bindgen_ty_2 = 263;
#[doc = " Primary stem key for Wear\n Main power/reset button on watch."]
pub const AKEYCODE_STEM_PRIMARY: _bindgen_ty_2 = 264;
#[doc = " Generic stem key 1 for Wear"]
pub const AKEYCODE_STEM_1: _bindgen_ty_2 = 265;
#[doc = " Generic stem key 2 for Wear"]
pub const AKEYCODE_STEM_2: _bindgen_ty_2 = 266;
#[doc = " Generic stem key 3 for Wear"]
pub const AKEYCODE_STEM_3: _bindgen_ty_2 = 267;
#[doc = " Directional Pad Up-Left"]
pub const AKEYCODE_DPAD_UP_LEFT: _bindgen_ty_2 = 268;
#[doc = " Directional Pad Down-Left"]
pub const AKEYCODE_DPAD_DOWN_LEFT: _bindgen_ty_2 = 269;
#[doc = " Directional Pad Up-Right"]
pub const AKEYCODE_DPAD_UP_RIGHT: _bindgen_ty_2 = 270;
#[doc = " Directional Pad Down-Right"]
pub const AKEYCODE_DPAD_DOWN_RIGHT: _bindgen_ty_2 = 271;
#[doc = " Skip forward media key"]
pub const AKEYCODE_MEDIA_SKIP_FORWARD: _bindgen_ty_2 = 272;
#[doc = " Skip backward media key"]
pub const AKEYCODE_MEDIA_SKIP_BACKWARD: _bindgen_ty_2 = 273;
#[doc = " Step forward media key.\n Steps media forward one from at a time."]
pub const AKEYCODE_MEDIA_STEP_FORWARD: _bindgen_ty_2 = 274;
#[doc = " Step backward media key.\n Steps media backward one from at a time."]
pub const AKEYCODE_MEDIA_STEP_BACKWARD: _bindgen_ty_2 = 275;
#[doc = " Put device to sleep unless a wakelock is held."]
pub const AKEYCODE_SOFT_SLEEP: _bindgen_ty_2 = 276;
#[doc = " Cut key."]
pub const AKEYCODE_CUT: _bindgen_ty_2 = 277;
#[doc = " Copy key."]
pub const AKEYCODE_COPY: _bindgen_ty_2 = 278;
#[doc = " Paste key."]
pub const AKEYCODE_PASTE: _bindgen_ty_2 = 279;
#[doc = " fingerprint navigation key, up."]
pub const AKEYCODE_SYSTEM_NAVIGATION_UP: _bindgen_ty_2 = 280;
#[doc = " fingerprint navigation key, down."]
pub const AKEYCODE_SYSTEM_NAVIGATION_DOWN: _bindgen_ty_2 = 281;
#[doc = " fingerprint navigation key, left."]
pub const AKEYCODE_SYSTEM_NAVIGATION_LEFT: _bindgen_ty_2 = 282;
#[doc = " fingerprint navigation key, right."]
pub const AKEYCODE_SYSTEM_NAVIGATION_RIGHT: _bindgen_ty_2 = 283;
#[doc = " all apps"]
pub const AKEYCODE_ALL_APPS: _bindgen_ty_2 = 284;
#[doc = " refresh key"]
pub const AKEYCODE_REFRESH: _bindgen_ty_2 = 285;
#[doc = " Thumbs up key. Apps can use this to let user upvote content."]
pub const AKEYCODE_THUMBS_UP: _bindgen_ty_2 = 286;
#[doc = " Thumbs down key. Apps can use this to let user downvote content."]
pub const AKEYCODE_THUMBS_DOWN: _bindgen_ty_2 = 287;
#[doc = " Used to switch current account that is consuming content.\n May be consumed by system to switch current viewer profile."]
pub const AKEYCODE_PROFILE_SWITCH: _bindgen_ty_2 = 288;
#[doc = " Video Application key #1."]
pub const AKEYCODE_VIDEO_APP_1: _bindgen_ty_2 = 289;
#[doc = " Video Application key #2."]
pub const AKEYCODE_VIDEO_APP_2: _bindgen_ty_2 = 290;
#[doc = " Video Application key #3."]
pub const AKEYCODE_VIDEO_APP_3: _bindgen_ty_2 = 291;
#[doc = " Video Application key #4."]
pub const AKEYCODE_VIDEO_APP_4: _bindgen_ty_2 = 292;
#[doc = " Video Application key #5."]
pub const AKEYCODE_VIDEO_APP_5: _bindgen_ty_2 = 293;
#[doc = " Video Application key #6."]
pub const AKEYCODE_VIDEO_APP_6: _bindgen_ty_2 = 294;
#[doc = " Video Application key #7."]
pub const AKEYCODE_VIDEO_APP_7: _bindgen_ty_2 = 295;
#[doc = " Video Application key #8."]
pub const AKEYCODE_VIDEO_APP_8: _bindgen_ty_2 = 296;
#[doc = " Featured Application key #1."]
pub const AKEYCODE_FEATURED_APP_1: _bindgen_ty_2 = 297;
#[doc = " Featured Application key #2."]
pub const AKEYCODE_FEATURED_APP_2: _bindgen_ty_2 = 298;
#[doc = " Featured Application key #3."]
pub const AKEYCODE_FEATURED_APP_3: _bindgen_ty_2 = 299;
#[doc = " Featured Application key #4."]
pub const AKEYCODE_FEATURED_APP_4: _bindgen_ty_2 = 300;
#[doc = " Demo Application key #1."]
pub const AKEYCODE_DEMO_APP_1: _bindgen_ty_2 = 301;
#[doc = " Demo Application key #2."]
pub const AKEYCODE_DEMO_APP_2: _bindgen_ty_2 = 302;
#[doc = " Demo Application key #3."]
pub const AKEYCODE_DEMO_APP_3: _bindgen_ty_2 = 303;
#[doc = " Demo Application key #4."]
pub const AKEYCODE_DEMO_APP_4: _bindgen_ty_2 = 304;
#[doc = " Key codes."]
pub type _bindgen_ty_2 = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ALooper {
    _unused: [u8; 0],
}
extern "C" {
    #[doc = " Returns the looper associated with the calling thread, or NULL if\n there is not one."]
    pub fn ALooper_forThread() -> *mut ALooper;
}
#[doc = " This looper will accept calls to ALooper_addFd() that do not\n have a callback (that is provide NULL for the callback).  In\n this case the caller of ALooper_pollOnce() or ALooper_pollAll()\n MUST check the return from these functions to discover when\n data is available on such fds and process it."]
pub const ALOOPER_PREPARE_ALLOW_NON_CALLBACKS: _bindgen_ty_3 = 1;
#[doc = " Option for for ALooper_prepare()."]
pub type _bindgen_ty_3 = ::std::os::raw::c_uint;
extern "C" {
    #[doc = " Prepares a looper associated with the calling thread, and returns it.\n If the thread already has a looper, it is returned.  Otherwise, a new\n one is created, associated with the thread, and returned.\n\n The opts may be ALOOPER_PREPARE_ALLOW_NON_CALLBACKS or 0."]
    pub fn ALooper_prepare(opts: ::std::os::raw::c_int) -> *mut ALooper;
}
#[doc = " The poll was awoken using wake() before the timeout expired\n and no callbacks were executed and no other file descriptors were ready."]
pub const ALOOPER_POLL_WAKE: _bindgen_ty_4 = -1;
#[doc = " Result from ALooper_pollOnce() and ALooper_pollAll():\n One or more callbacks were executed."]
pub const ALOOPER_POLL_CALLBACK: _bindgen_ty_4 = -2;
#[doc = " Result from ALooper_pollOnce() and ALooper_pollAll():\n The timeout expired."]
pub const ALOOPER_POLL_TIMEOUT: _bindgen_ty_4 = -3;
#[doc = " Result from ALooper_pollOnce() and ALooper_pollAll():\n An error occurred."]
pub const ALOOPER_POLL_ERROR: _bindgen_ty_4 = -4;
#[doc = " Result from ALooper_pollOnce() and ALooper_pollAll()."]
pub type _bindgen_ty_4 = ::std::os::raw::c_int;
extern "C" {
    #[doc = " Acquire a reference on the given ALooper object.  This prevents the object\n from being deleted until the reference is removed.  This is only needed\n to safely hand an ALooper from one thread to another."]
    pub fn ALooper_acquire(looper: *mut ALooper);
}
extern "C" {
    #[doc = " Remove a reference that was previously acquired with ALooper_acquire()."]
    pub fn ALooper_release(looper: *mut ALooper);
}
#[doc = " The file descriptor is available for read operations."]
pub const ALOOPER_EVENT_INPUT: _bindgen_ty_5 = 1;
#[doc = " The file descriptor is available for write operations."]
pub const ALOOPER_EVENT_OUTPUT: _bindgen_ty_5 = 2;
#[doc = " The file descriptor has encountered an error condition.\n\n The looper always sends notifications about errors; it is not necessary\n to specify this event flag in the requested event set."]
pub const ALOOPER_EVENT_ERROR: _bindgen_ty_5 = 4;
#[doc = " The file descriptor was hung up.\n For example, indicates that the remote end of a pipe or socket was closed.\n\n The looper always sends notifications about hangups; it is not necessary\n to specify this event flag in the requested event set."]
pub const ALOOPER_EVENT_HANGUP: _bindgen_ty_5 = 8;
#[doc = " The file descriptor is invalid.\n For example, the file descriptor was closed prematurely.\n\n The looper always sends notifications about invalid file descriptors; it is not necessary\n to specify this event flag in the requested event set."]
pub const ALOOPER_EVENT_INVALID: _bindgen_ty_5 = 16;
#[doc = " Flags for file descriptor events that a looper can monitor.\n\n These flag bits can be combined to monitor multiple events at once."]
pub type _bindgen_ty_5 = ::std::os::raw::c_uint;
#[doc = " For callback-based event loops, this is the prototype of the function\n that is called when a file descriptor event occurs.\n It is given the file descriptor it is associated with,\n a bitmask of the poll events that were triggered (typically ALOOPER_EVENT_INPUT),\n and the data pointer that was originally supplied.\n\n Implementations should return 1 to continue receiving callbacks, or 0\n to have this file descriptor and callback unregistered from the looper."]
pub type ALooper_callbackFunc = ::std::option::Option<
    unsafe extern "C" fn(
        fd: ::std::os::raw::c_int,
        events: ::std::os::raw::c_int,
        data: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
extern "C" {
    #[doc = " Waits for events to be available, with optional timeout in milliseconds.\n Invokes callbacks for all file descriptors on which an event occurred.\n\n If the timeout is zero, returns immediately without blocking.\n If the timeout is negative, waits indefinitely until an event appears.\n\n Returns ALOOPER_POLL_WAKE if the poll was awoken using wake() before\n the timeout expired and no callbacks were invoked and no other file\n descriptors were ready.\n\n Returns ALOOPER_POLL_CALLBACK if one or more callbacks were invoked.\n\n Returns ALOOPER_POLL_TIMEOUT if there was no data before the given\n timeout expired.\n\n Returns ALOOPER_POLL_ERROR if an error occurred.\n\n Returns a value >= 0 containing an identifier (the same identifier\n `ident` passed to ALooper_addFd()) if its file descriptor has data\n and it has no callback function (requiring the caller here to\n handle it).  In this (and only this) case outFd, outEvents and\n outData will contain the poll events and data associated with the\n fd, otherwise they will be set to NULL.\n\n This method does not return until it has finished invoking the appropriate callbacks\n for all file descriptors that were signalled."]
    pub fn ALooper_pollOnce(
        timeoutMillis: ::std::os::raw::c_int,
        outFd: *mut ::std::os::raw::c_int,
        outEvents: *mut ::std::os::raw::c_int,
        outData: *mut *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Like ALooper_pollOnce(), but performs all pending callbacks until all\n data has been consumed or a file descriptor is available with no callback.\n This function will never return ALOOPER_POLL_CALLBACK."]
    pub fn ALooper_pollAll(
        timeoutMillis: ::std::os::raw::c_int,
        outFd: *mut ::std::os::raw::c_int,
        outEvents: *mut ::std::os::raw::c_int,
        outData: *mut *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Wakes the poll asynchronously.\n\n This method can be called on any thread.\n This method returns immediately."]
    pub fn ALooper_wake(looper: *mut ALooper);
}
extern "C" {
    #[doc = " Adds a new file descriptor to be polled by the looper.\n If the same file descriptor was previously added, it is replaced.\n\n \"fd\" is the file descriptor to be added.\n \"ident\" is an identifier for this event, which is returned from ALooper_pollOnce().\n The identifier must be >= 0, or ALOOPER_POLL_CALLBACK if providing a non-NULL callback.\n \"events\" are the poll events to wake up on.  Typically this is ALOOPER_EVENT_INPUT.\n \"callback\" is the function to call when there is an event on the file descriptor.\n \"data\" is a private data pointer to supply to the callback.\n\n There are two main uses of this function:\n\n (1) If \"callback\" is non-NULL, then this function will be called when there is\n data on the file descriptor.  It should execute any events it has pending,\n appropriately reading from the file descriptor.  The 'ident' is ignored in this case.\n\n (2) If \"callback\" is NULL, the 'ident' will be returned by ALooper_pollOnce\n when its file descriptor has data available, requiring the caller to take\n care of processing it.\n\n Returns 1 if the file descriptor was added or -1 if an error occurred.\n\n This method can be called on any thread.\n This method may block briefly if it needs to wake the poll."]
    pub fn ALooper_addFd(
        looper: *mut ALooper,
        fd: ::std::os::raw::c_int,
        ident: ::std::os::raw::c_int,
        events: ::std::os::raw::c_int,
        callback: ALooper_callbackFunc,
        data: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Removes a previously added file descriptor from the looper.\n\n When this method returns, it is safe to close the file descriptor since the looper\n will no longer have a reference to it.  However, it is possible for the callback to\n already be running or for it to run one last time if the file descriptor was already\n signalled.  Calling code is responsible for ensuring that this case is safely handled.\n For example, if the callback takes care of removing itself during its own execution either\n by returning 0 or by calling this method, then it can be guaranteed to not be invoked\n again at any later time unless registered anew.\n\n Returns 1 if the file descriptor was removed, 0 if none was previously registered\n or -1 if an error occurred.\n\n This method can be called on any thread.\n This method may block briefly if it needs to wake the poll."]
    pub fn ALooper_removeFd(
        looper: *mut ALooper,
        fd: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
#[doc = " The key state is unknown or the requested key itself is not supported."]
pub const AKEY_STATE_UNKNOWN: _bindgen_ty_6 = -1;
#[doc = " The key is up."]
pub const AKEY_STATE_UP: _bindgen_ty_6 = 0;
#[doc = " The key is down."]
pub const AKEY_STATE_DOWN: _bindgen_ty_6 = 1;
#[doc = " The key is down but is a virtual key press that is being emulated by the system."]
pub const AKEY_STATE_VIRTUAL: _bindgen_ty_6 = 2;
#[doc = " Key states (may be returned by queries about the current state of a\n particular key code, scan code or switch)."]
pub type _bindgen_ty_6 = ::std::os::raw::c_int;
#[doc = " No meta keys are pressed."]
pub const AMETA_NONE: _bindgen_ty_7 = 0;
#[doc = " This mask is used to check whether one of the ALT meta keys is pressed."]
pub const AMETA_ALT_ON: _bindgen_ty_7 = 2;
#[doc = " This mask is used to check whether the left ALT meta key is pressed."]
pub const AMETA_ALT_LEFT_ON: _bindgen_ty_7 = 16;
#[doc = " This mask is used to check whether the right ALT meta key is pressed."]
pub const AMETA_ALT_RIGHT_ON: _bindgen_ty_7 = 32;
#[doc = " This mask is used to check whether one of the SHIFT meta keys is pressed."]
pub const AMETA_SHIFT_ON: _bindgen_ty_7 = 1;
#[doc = " This mask is used to check whether the left SHIFT meta key is pressed."]
pub const AMETA_SHIFT_LEFT_ON: _bindgen_ty_7 = 64;
#[doc = " This mask is used to check whether the right SHIFT meta key is pressed."]
pub const AMETA_SHIFT_RIGHT_ON: _bindgen_ty_7 = 128;
#[doc = " This mask is used to check whether the SYM meta key is pressed."]
pub const AMETA_SYM_ON: _bindgen_ty_7 = 4;
#[doc = " This mask is used to check whether the FUNCTION meta key is pressed."]
pub const AMETA_FUNCTION_ON: _bindgen_ty_7 = 8;
#[doc = " This mask is used to check whether one of the CTRL meta keys is pressed."]
pub const AMETA_CTRL_ON: _bindgen_ty_7 = 4096;
#[doc = " This mask is used to check whether the left CTRL meta key is pressed."]
pub const AMETA_CTRL_LEFT_ON: _bindgen_ty_7 = 8192;
#[doc = " This mask is used to check whether the right CTRL meta key is pressed."]
pub const AMETA_CTRL_RIGHT_ON: _bindgen_ty_7 = 16384;
#[doc = " This mask is used to check whether one of the META meta keys is pressed."]
pub const AMETA_META_ON: _bindgen_ty_7 = 65536;
#[doc = " This mask is used to check whether the left META meta key is pressed."]
pub const AMETA_META_LEFT_ON: _bindgen_ty_7 = 131072;
#[doc = " This mask is used to check whether the right META meta key is pressed."]
pub const AMETA_META_RIGHT_ON: _bindgen_ty_7 = 262144;
#[doc = " This mask is used to check whether the CAPS LOCK meta key is on."]
pub const AMETA_CAPS_LOCK_ON: _bindgen_ty_7 = 1048576;
#[doc = " This mask is used to check whether the NUM LOCK meta key is on."]
pub const AMETA_NUM_LOCK_ON: _bindgen_ty_7 = 2097152;
#[doc = " This mask is used to check whether the SCROLL LOCK meta key is on."]
pub const AMETA_SCROLL_LOCK_ON: _bindgen_ty_7 = 4194304;
#[doc = " Meta key / modifier state."]
pub type _bindgen_ty_7 = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct AInputEvent {
    _unused: [u8; 0],
}
#[doc = " Indicates that the input event is a key event."]
pub const AINPUT_EVENT_TYPE_KEY: _bindgen_ty_8 = 1;
#[doc = " Indicates that the input event is a motion event."]
pub const AINPUT_EVENT_TYPE_MOTION: _bindgen_ty_8 = 2;
#[doc = " Focus event"]
pub const AINPUT_EVENT_TYPE_FOCUS: _bindgen_ty_8 = 3;
#[doc = " Capture event"]
pub const AINPUT_EVENT_TYPE_CAPTURE: _bindgen_ty_8 = 4;
#[doc = " Drag event"]
pub const AINPUT_EVENT_TYPE_DRAG: _bindgen_ty_8 = 5;
#[doc = " TouchMode event"]
pub const AINPUT_EVENT_TYPE_TOUCH_MODE: _bindgen_ty_8 = 6;
#[doc = " Input event types."]
pub type _bindgen_ty_8 = ::std::os::raw::c_uint;
#[doc = " The key has been pressed down."]
pub const AKEY_EVENT_ACTION_DOWN: _bindgen_ty_9 = 0;
#[doc = " The key has been released."]
pub const AKEY_EVENT_ACTION_UP: _bindgen_ty_9 = 1;
#[doc = " Multiple duplicate key events have occurred in a row, or a\n complex string is being delivered.  The repeat_count property\n of the key event contains the number of times the given key\n code should be executed."]
pub const AKEY_EVENT_ACTION_MULTIPLE: _bindgen_ty_9 = 2;
#[doc = " Key event actions."]
pub type _bindgen_ty_9 = ::std::os::raw::c_uint;
#[doc = " This mask is set if the device woke because of this key event."]
pub const AKEY_EVENT_FLAG_WOKE_HERE: _bindgen_ty_10 = 1;
#[doc = " This mask is set if the key event was generated by a software keyboard."]
pub const AKEY_EVENT_FLAG_SOFT_KEYBOARD: _bindgen_ty_10 = 2;
#[doc = " This mask is set if we don't want the key event to cause us to leave touch mode."]
pub const AKEY_EVENT_FLAG_KEEP_TOUCH_MODE: _bindgen_ty_10 = 4;
#[doc = " This mask is set if an event was known to come from a trusted\n part of the system.  That is, the event is known to come from\n the user, and could not have been spoofed by a third party\n component."]
pub const AKEY_EVENT_FLAG_FROM_SYSTEM: _bindgen_ty_10 = 8;
#[doc = " This mask is used for compatibility, to identify enter keys that are\n coming from an IME whose enter key has been auto-labelled \"next\" or\n \"done\".  This allows TextView to dispatch these as normal enter keys\n for old applications, but still do the appropriate action when\n receiving them."]
pub const AKEY_EVENT_FLAG_EDITOR_ACTION: _bindgen_ty_10 = 16;
#[doc = " When associated with up key events, this indicates that the key press\n has been canceled.  Typically this is used with virtual touch screen\n keys, where the user can slide from the virtual key area on to the\n display: in that case, the application will receive a canceled up\n event and should not perform the action normally associated with the\n key.  Note that for this to work, the application can not perform an\n action for a key until it receives an up or the long press timeout has\n expired."]
pub const AKEY_EVENT_FLAG_CANCELED: _bindgen_ty_10 = 32;
#[doc = " This key event was generated by a virtual (on-screen) hard key area.\n Typically this is an area of the touchscreen, outside of the regular\n display, dedicated to \"hardware\" buttons."]
pub const AKEY_EVENT_FLAG_VIRTUAL_HARD_KEY: _bindgen_ty_10 = 64;
#[doc = " This flag is set for the first key repeat that occurs after the\n long press timeout."]
pub const AKEY_EVENT_FLAG_LONG_PRESS: _bindgen_ty_10 = 128;
#[doc = " Set when a key event has #AKEY_EVENT_FLAG_CANCELED set because a long\n press action was executed while it was down."]
pub const AKEY_EVENT_FLAG_CANCELED_LONG_PRESS: _bindgen_ty_10 = 256;
#[doc = " Set for #AKEY_EVENT_ACTION_UP when this event's key code is still being\n tracked from its initial down.  That is, somebody requested that tracking\n started on the key down and a long press has not caused\n the tracking to be canceled."]
pub const AKEY_EVENT_FLAG_TRACKING: _bindgen_ty_10 = 512;
#[doc = " Set when a key event has been synthesized to implement default behavior\n for an event that the application did not handle.\n Fallback key events are generated by unhandled trackball motions\n (to emulate a directional keypad) and by certain unhandled key presses\n that are declared in the key map (such as special function numeric keypad\n keys when numlock is off)."]
pub const AKEY_EVENT_FLAG_FALLBACK: _bindgen_ty_10 = 1024;
#[doc = " Key event flags."]
pub type _bindgen_ty_10 = ::std::os::raw::c_uint;
#[doc = " Bit mask of the parts of the action code that are the action itself."]
pub const AMOTION_EVENT_ACTION_MASK: _bindgen_ty_11 = 255;
#[doc = " Bits in the action code that represent a pointer index, used with\n #AMOTION_EVENT_ACTION_POINTER_DOWN and AMOTION_EVENT_ACTION_POINTER_UP.  Shifting\n down by #AMOTION_EVENT_ACTION_POINTER_INDEX_SHIFT provides the actual pointer\n index where the data for the pointer going up or down can be found."]
pub const AMOTION_EVENT_ACTION_POINTER_INDEX_MASK: _bindgen_ty_11 = 65280;
#[doc = " A pressed gesture has started, the motion contains the initial starting location."]
pub const AMOTION_EVENT_ACTION_DOWN: _bindgen_ty_11 = 0;
#[doc = " A pressed gesture has finished, the motion contains the final release location\n as well as any intermediate points since the last down or move event."]
pub const AMOTION_EVENT_ACTION_UP: _bindgen_ty_11 = 1;
#[doc = " A change has happened during a press gesture (between #AMOTION_EVENT_ACTION_DOWN and\n #AMOTION_EVENT_ACTION_UP).  The motion contains the most recent point, as well as\n any intermediate points since the last down or move event."]
pub const AMOTION_EVENT_ACTION_MOVE: _bindgen_ty_11 = 2;
#[doc = " The current gesture has been aborted.\n You will not receive any more points in it.  You should treat this as\n an up event, but not perform any action that you normally would."]
pub const AMOTION_EVENT_ACTION_CANCEL: _bindgen_ty_11 = 3;
#[doc = " A movement has happened outside of the normal bounds of the UI element.\n This does not provide a full gesture, but only the initial location of the movement/touch."]
pub const AMOTION_EVENT_ACTION_OUTSIDE: _bindgen_ty_11 = 4;
#[doc = " A non-primary pointer has gone down.\n The bits in #AMOTION_EVENT_ACTION_POINTER_INDEX_MASK indicate which pointer changed."]
pub const AMOTION_EVENT_ACTION_POINTER_DOWN: _bindgen_ty_11 = 5;
#[doc = " A non-primary pointer has gone up.\n The bits in #AMOTION_EVENT_ACTION_POINTER_INDEX_MASK indicate which pointer changed."]
pub const AMOTION_EVENT_ACTION_POINTER_UP: _bindgen_ty_11 = 6;
#[doc = " A change happened but the pointer is not down (unlike #AMOTION_EVENT_ACTION_MOVE).\n The motion contains the most recent point, as well as any intermediate points since\n the last hover move event."]
pub const AMOTION_EVENT_ACTION_HOVER_MOVE: _bindgen_ty_11 = 7;
#[doc = " The motion event contains relative vertical and/or horizontal scroll offsets.\n Use {@link AMotionEvent_getAxisValue} to retrieve the information from\n #AMOTION_EVENT_AXIS_VSCROLL and #AMOTION_EVENT_AXIS_HSCROLL.\n The pointer may or may not be down when this event is dispatched.\n This action is always delivered to the winder under the pointer, which\n may not be the window currently touched."]
pub const AMOTION_EVENT_ACTION_SCROLL: _bindgen_ty_11 = 8;
#[doc = " The pointer is not down but has entered the boundaries of a window or view."]
pub const AMOTION_EVENT_ACTION_HOVER_ENTER: _bindgen_ty_11 = 9;
#[doc = " The pointer is not down but has exited the boundaries of a window or view."]
pub const AMOTION_EVENT_ACTION_HOVER_EXIT: _bindgen_ty_11 = 10;
#[doc = " The pointer is not down but has exited the boundaries of a window or view."]
pub const AMOTION_EVENT_ACTION_BUTTON_PRESS: _bindgen_ty_11 = 11;
#[doc = " The pointer is not down but has exited the boundaries of a window or view."]
pub const AMOTION_EVENT_ACTION_BUTTON_RELEASE: _bindgen_ty_11 = 12;
#[doc = " Motion event actions"]
pub type _bindgen_ty_11 = ::std::os::raw::c_uint;
#[doc = " This flag indicates that the window that received this motion event is partly\n or wholly obscured by another visible window above it.  This flag is set to true\n even if the event did not directly pass through the obscured area.\n A security sensitive application can check this flag to identify situations in which\n a malicious application may have covered up part of its content for the purpose\n of misleading the user or hijacking touches.  An appropriate response might be\n to drop the suspect touches or to take additional precautions to confirm the user's\n actual intent."]
pub const AMOTION_EVENT_FLAG_WINDOW_IS_OBSCURED: _bindgen_ty_12 = 1;
#[doc = " Motion event flags."]
pub type _bindgen_ty_12 = ::std::os::raw::c_uint;
#[doc = " No edges intersected."]
pub const AMOTION_EVENT_EDGE_FLAG_NONE: _bindgen_ty_13 = 0;
#[doc = " Flag indicating the motion event intersected the top edge of the screen."]
pub const AMOTION_EVENT_EDGE_FLAG_TOP: _bindgen_ty_13 = 1;
#[doc = " Flag indicating the motion event intersected the bottom edge of the screen."]
pub const AMOTION_EVENT_EDGE_FLAG_BOTTOM: _bindgen_ty_13 = 2;
#[doc = " Flag indicating the motion event intersected the left edge of the screen."]
pub const AMOTION_EVENT_EDGE_FLAG_LEFT: _bindgen_ty_13 = 4;
#[doc = " Flag indicating the motion event intersected the right edge of the screen."]
pub const AMOTION_EVENT_EDGE_FLAG_RIGHT: _bindgen_ty_13 = 8;
#[doc = " Motion event edge touch flags."]
pub type _bindgen_ty_13 = ::std::os::raw::c_uint;
#[doc = " Axis constant: X axis of a motion event.\n\n - For a touch screen, reports the absolute X screen position of the center of\n the touch contact area.  The units are display pixels.\n - For a touch pad, reports the absolute X surface position of the center of the touch\n contact area. The units are device-dependent.\n - For a mouse, reports the absolute X screen position of the mouse pointer.\n The units are display pixels.\n - For a trackball, reports the relative horizontal displacement of the trackball.\n The value is normalized to a range from -1.0 (left) to 1.0 (right).\n - For a joystick, reports the absolute X position of the joystick.\n The value is normalized to a range from -1.0 (left) to 1.0 (right)."]
pub const AMOTION_EVENT_AXIS_X: _bindgen_ty_14 = 0;
#[doc = " Axis constant: Y axis of a motion event.\n\n - For a touch screen, reports the absolute Y screen position of the center of\n the touch contact area.  The units are display pixels.\n - For a touch pad, reports the absolute Y surface position of the center of the touch\n contact area. The units are device-dependent.\n - For a mouse, reports the absolute Y screen position of the mouse pointer.\n The units are display pixels.\n - For a trackball, reports the relative vertical displacement of the trackball.\n The value is normalized to a range from -1.0 (up) to 1.0 (down).\n - For a joystick, reports the absolute Y position of the joystick.\n The value is normalized to a range from -1.0 (up or far) to 1.0 (down or near)."]
pub const AMOTION_EVENT_AXIS_Y: _bindgen_ty_14 = 1;
#[doc = " Axis constant: Pressure axis of a motion event.\n\n - For a touch screen or touch pad, reports the approximate pressure applied to the surface\n by a finger or other tool.  The value is normalized to a range from\n 0 (no pressure at all) to 1 (normal pressure), although values higher than 1\n may be generated depending on the calibration of the input device.\n - For a trackball, the value is set to 1 if the trackball button is pressed\n or 0 otherwise.\n - For a mouse, the value is set to 1 if the primary mouse button is pressed\n or 0 otherwise."]
pub const AMOTION_EVENT_AXIS_PRESSURE: _bindgen_ty_14 = 2;
#[doc = " Axis constant: Size axis of a motion event.\n\n - For a touch screen or touch pad, reports the approximate size of the contact area in\n relation to the maximum detectable size for the device.  The value is normalized\n to a range from 0 (smallest detectable size) to 1 (largest detectable size),\n although it is not a linear scale. This value is of limited use.\n To obtain calibrated size information, see\n {@link AMOTION_EVENT_AXIS_TOUCH_MAJOR} or {@link AMOTION_EVENT_AXIS_TOOL_MAJOR}."]
pub const AMOTION_EVENT_AXIS_SIZE: _bindgen_ty_14 = 3;
#[doc = " Axis constant: TouchMajor axis of a motion event.\n\n - For a touch screen, reports the length of the major axis of an ellipse that\n represents the touch area at the point of contact.\n The units are display pixels.\n - For a touch pad, reports the length of the major axis of an ellipse that\n represents the touch area at the point of contact.\n The units are device-dependent."]
pub const AMOTION_EVENT_AXIS_TOUCH_MAJOR: _bindgen_ty_14 = 4;
#[doc = " Axis constant: TouchMinor axis of a motion event.\n\n - For a touch screen, reports the length of the minor axis of an ellipse that\n represents the touch area at the point of contact.\n The units are display pixels.\n - For a touch pad, reports the length of the minor axis of an ellipse that\n represents the touch area at the point of contact.\n The units are device-dependent.\n\n When the touch is circular, the major and minor axis lengths will be equal to one another."]
pub const AMOTION_EVENT_AXIS_TOUCH_MINOR: _bindgen_ty_14 = 5;
#[doc = " Axis constant: ToolMajor axis of a motion event.\n\n - For a touch screen, reports the length of the major axis of an ellipse that\n represents the size of the approaching finger or tool used to make contact.\n - For a touch pad, reports the length of the major axis of an ellipse that\n represents the size of the approaching finger or tool used to make contact.\n The units are device-dependent.\n\n When the touch is circular, the major and minor axis lengths will be equal to one another.\n\n The tool size may be larger than the touch size since the tool may not be fully\n in contact with the touch sensor."]
pub const AMOTION_EVENT_AXIS_TOOL_MAJOR: _bindgen_ty_14 = 6;
#[doc = " Axis constant: ToolMinor axis of a motion event.\n\n - For a touch screen, reports the length of the minor axis of an ellipse that\n represents the size of the approaching finger or tool used to make contact.\n - For a touch pad, reports the length of the minor axis of an ellipse that\n represents the size of the approaching finger or tool used to make contact.\n The units are device-dependent.\n\n When the touch is circular, the major and minor axis lengths will be equal to one another.\n\n The tool size may be larger than the touch size since the tool may not be fully\n in contact with the touch sensor."]
pub const AMOTION_EVENT_AXIS_TOOL_MINOR: _bindgen_ty_14 = 7;
#[doc = " Axis constant: Orientation axis of a motion event.\n\n - For a touch screen or touch pad, reports the orientation of the finger\n or tool in radians relative to the vertical plane of the device.\n An angle of 0 radians indicates that the major axis of contact is oriented\n upwards, is perfectly circular or is of unknown orientation.  A positive angle\n indicates that the major axis of contact is oriented to the right.  A negative angle\n indicates that the major axis of contact is oriented to the left.\n The full range is from -PI/2 radians (finger pointing fully left) to PI/2 radians\n (finger pointing fully right).\n - For a stylus, the orientation indicates the direction in which the stylus\n is pointing in relation to the vertical axis of the current orientation of the screen.\n The range is from -PI radians to PI radians, where 0 is pointing up,\n -PI/2 radians is pointing left, -PI or PI radians is pointing down, and PI/2 radians\n is pointing right.  See also #AMOTION_EVENT_AXIS_TILT."]
pub const AMOTION_EVENT_AXIS_ORIENTATION: _bindgen_ty_14 = 8;
#[doc = " Axis constant: Vertical Scroll axis of a motion event.\n\n - For a mouse, reports the relative movement of the vertical scroll wheel.\n The value is normalized to a range from -1.0 (down) to 1.0 (up).\n\n This axis should be used to scroll views vertically."]
pub const AMOTION_EVENT_AXIS_VSCROLL: _bindgen_ty_14 = 9;
#[doc = " Axis constant: Horizontal Scroll axis of a motion event.\n\n - For a mouse, reports the relative movement of the horizontal scroll wheel.\n The value is normalized to a range from -1.0 (left) to 1.0 (right).\n\n This axis should be used to scroll views horizontally."]
pub const AMOTION_EVENT_AXIS_HSCROLL: _bindgen_ty_14 = 10;
#[doc = " Axis constant: Z axis of a motion event.\n\n - For a joystick, reports the absolute Z position of the joystick.\n The value is normalized to a range from -1.0 (high) to 1.0 (low).\n <em>On game pads with two analog joysticks, this axis is often reinterpreted\n to report the absolute X position of the second joystick instead.</em>"]
pub const AMOTION_EVENT_AXIS_Z: _bindgen_ty_14 = 11;
#[doc = " Axis constant: X Rotation axis of a motion event.\n\n - For a joystick, reports the absolute rotation angle about the X axis.\n The value is normalized to a range from -1.0 (counter-clockwise) to 1.0 (clockwise)."]
pub const AMOTION_EVENT_AXIS_RX: _bindgen_ty_14 = 12;
#[doc = " Axis constant: Y Rotation axis of a motion event.\n\n - For a joystick, reports the absolute rotation angle about the Y axis.\n The value is normalized to a range from -1.0 (counter-clockwise) to 1.0 (clockwise)."]
pub const AMOTION_EVENT_AXIS_RY: _bindgen_ty_14 = 13;
#[doc = " Axis constant: Z Rotation axis of a motion event.\n\n - For a joystick, reports the absolute rotation angle about the Z axis.\n The value is normalized to a range from -1.0 (counter-clockwise) to 1.0 (clockwise).\n On game pads with two analog joysticks, this axis is often reinterpreted\n to report the absolute Y position of the second joystick instead."]
pub const AMOTION_EVENT_AXIS_RZ: _bindgen_ty_14 = 14;
#[doc = " Axis constant: Hat X axis of a motion event.\n\n - For a joystick, reports the absolute X position of the directional hat control.\n The value is normalized to a range from -1.0 (left) to 1.0 (right)."]
pub const AMOTION_EVENT_AXIS_HAT_X: _bindgen_ty_14 = 15;
#[doc = " Axis constant: Hat Y axis of a motion event.\n\n - For a joystick, reports the absolute Y position of the directional hat control.\n The value is normalized to a range from -1.0 (up) to 1.0 (down)."]
pub const AMOTION_EVENT_AXIS_HAT_Y: _bindgen_ty_14 = 16;
#[doc = " Axis constant: Left Trigger axis of a motion event.\n\n - For a joystick, reports the absolute position of the left trigger control.\n The value is normalized to a range from 0.0 (released) to 1.0 (fully pressed)."]
pub const AMOTION_EVENT_AXIS_LTRIGGER: _bindgen_ty_14 = 17;
#[doc = " Axis constant: Right Trigger axis of a motion event.\n\n - For a joystick, reports the absolute position of the right trigger control.\n The value is normalized to a range from 0.0 (released) to 1.0 (fully pressed)."]
pub const AMOTION_EVENT_AXIS_RTRIGGER: _bindgen_ty_14 = 18;
#[doc = " Axis constant: Throttle axis of a motion event.\n\n - For a joystick, reports the absolute position of the throttle control.\n The value is normalized to a range from 0.0 (fully open) to 1.0 (fully closed)."]
pub const AMOTION_EVENT_AXIS_THROTTLE: _bindgen_ty_14 = 19;
#[doc = " Axis constant: Rudder axis of a motion event.\n\n - For a joystick, reports the absolute position of the rudder control.\n The value is normalized to a range from -1.0 (turn left) to 1.0 (turn right)."]
pub const AMOTION_EVENT_AXIS_RUDDER: _bindgen_ty_14 = 20;
#[doc = " Axis constant: Wheel axis of a motion event.\n\n - For a joystick, reports the absolute position of the steering wheel control.\n The value is normalized to a range from -1.0 (turn left) to 1.0 (turn right)."]
pub const AMOTION_EVENT_AXIS_WHEEL: _bindgen_ty_14 = 21;
#[doc = " Axis constant: Gas axis of a motion event.\n\n - For a joystick, reports the absolute position of the gas (accelerator) control.\n The value is normalized to a range from 0.0 (no acceleration)\n to 1.0 (maximum acceleration)."]
pub const AMOTION_EVENT_AXIS_GAS: _bindgen_ty_14 = 22;
#[doc = " Axis constant: Brake axis of a motion event.\n\n - For a joystick, reports the absolute position of the brake control.\n The value is normalized to a range from 0.0 (no braking) to 1.0 (maximum braking)."]
pub const AMOTION_EVENT_AXIS_BRAKE: _bindgen_ty_14 = 23;
#[doc = " Axis constant: Distance axis of a motion event.\n\n - For a stylus, reports the distance of the stylus from the screen.\n A value of 0.0 indicates direct contact and larger values indicate increasing\n distance from the surface."]
pub const AMOTION_EVENT_AXIS_DISTANCE: _bindgen_ty_14 = 24;
#[doc = " Axis constant: Tilt axis of a motion event.\n\n - For a stylus, reports the tilt angle of the stylus in radians where\n 0 radians indicates that the stylus is being held perpendicular to the\n surface, and PI/2 radians indicates that the stylus is being held flat\n against the surface."]
pub const AMOTION_EVENT_AXIS_TILT: _bindgen_ty_14 = 25;
#[doc = " Axis constant:  Generic scroll axis of a motion event.\n\n - This is used for scroll axis motion events that can't be classified as strictly\n   vertical or horizontal. The movement of a rotating scroller is an example of this."]
pub const AMOTION_EVENT_AXIS_SCROLL: _bindgen_ty_14 = 26;
#[doc = " Axis constant: The movement of x position of a motion event.\n\n - For a mouse, reports a difference of x position between the previous position.\n This is useful when pointer is captured, in that case the mouse pointer doesn't\n change the location but this axis reports the difference which allows the app\n to see how the mouse is moved."]
pub const AMOTION_EVENT_AXIS_RELATIVE_X: _bindgen_ty_14 = 27;
#[doc = " Axis constant: The movement of y position of a motion event.\n\n Same as #AMOTION_EVENT_AXIS_RELATIVE_X, but for y position."]
pub const AMOTION_EVENT_AXIS_RELATIVE_Y: _bindgen_ty_14 = 28;
#[doc = " Axis constant: Generic 1 axis of a motion event.\n The interpretation of a generic axis is device-specific."]
pub const AMOTION_EVENT_AXIS_GENERIC_1: _bindgen_ty_14 = 32;
#[doc = " Axis constant: Generic 2 axis of a motion event.\n The interpretation of a generic axis is device-specific."]
pub const AMOTION_EVENT_AXIS_GENERIC_2: _bindgen_ty_14 = 33;
#[doc = " Axis constant: Generic 3 axis of a motion event.\n The interpretation of a generic axis is device-specific."]
pub const AMOTION_EVENT_AXIS_GENERIC_3: _bindgen_ty_14 = 34;
#[doc = " Axis constant: Generic 4 axis of a motion event.\n The interpretation of a generic axis is device-specific."]
pub const AMOTION_EVENT_AXIS_GENERIC_4: _bindgen_ty_14 = 35;
#[doc = " Axis constant: Generic 5 axis of a motion event.\n The interpretation of a generic axis is device-specific."]
pub const AMOTION_EVENT_AXIS_GENERIC_5: _bindgen_ty_14 = 36;
#[doc = " Axis constant: Generic 6 axis of a motion event.\n The interpretation of a generic axis is device-specific."]
pub const AMOTION_EVENT_AXIS_GENERIC_6: _bindgen_ty_14 = 37;
#[doc = " Axis constant: Generic 7 axis of a motion event.\n The interpretation of a generic axis is device-specific."]
pub const AMOTION_EVENT_AXIS_GENERIC_7: _bindgen_ty_14 = 38;
#[doc = " Axis constant: Generic 8 axis of a motion event.\n The interpretation of a generic axis is device-specific."]
pub const AMOTION_EVENT_AXIS_GENERIC_8: _bindgen_ty_14 = 39;
#[doc = " Axis constant: Generic 9 axis of a motion event.\n The interpretation of a generic axis is device-specific."]
pub const AMOTION_EVENT_AXIS_GENERIC_9: _bindgen_ty_14 = 40;
#[doc = " Axis constant: Generic 10 axis of a motion event.\n The interpretation of a generic axis is device-specific."]
pub const AMOTION_EVENT_AXIS_GENERIC_10: _bindgen_ty_14 = 41;
#[doc = " Axis constant: Generic 11 axis of a motion event.\n The interpretation of a generic axis is device-specific."]
pub const AMOTION_EVENT_AXIS_GENERIC_11: _bindgen_ty_14 = 42;
#[doc = " Axis constant: Generic 12 axis of a motion event.\n The interpretation of a generic axis is device-specific."]
pub const AMOTION_EVENT_AXIS_GENERIC_12: _bindgen_ty_14 = 43;
#[doc = " Axis constant: Generic 13 axis of a motion event.\n The interpretation of a generic axis is device-specific."]
pub const AMOTION_EVENT_AXIS_GENERIC_13: _bindgen_ty_14 = 44;
#[doc = " Axis constant: Generic 14 axis of a motion event.\n The interpretation of a generic axis is device-specific."]
pub const AMOTION_EVENT_AXIS_GENERIC_14: _bindgen_ty_14 = 45;
#[doc = " Axis constant: Generic 15 axis of a motion event.\n The interpretation of a generic axis is device-specific."]
pub const AMOTION_EVENT_AXIS_GENERIC_15: _bindgen_ty_14 = 46;
#[doc = " Axis constant: Generic 16 axis of a motion event.\n The interpretation of a generic axis is device-specific."]
pub const AMOTION_EVENT_AXIS_GENERIC_16: _bindgen_ty_14 = 47;
#[doc = " Constants that identify each individual axis of a motion event.\n @anchor AMOTION_EVENT_AXIS"]
pub type _bindgen_ty_14 = ::std::os::raw::c_uint;
#[doc = " primary"]
pub const AMOTION_EVENT_BUTTON_PRIMARY: _bindgen_ty_15 = 1;
#[doc = " secondary"]
pub const AMOTION_EVENT_BUTTON_SECONDARY: _bindgen_ty_15 = 2;
#[doc = " tertiary"]
pub const AMOTION_EVENT_BUTTON_TERTIARY: _bindgen_ty_15 = 4;
#[doc = " back"]
pub const AMOTION_EVENT_BUTTON_BACK: _bindgen_ty_15 = 8;
#[doc = " forward"]
pub const AMOTION_EVENT_BUTTON_FORWARD: _bindgen_ty_15 = 16;
#[doc = " forward"]
pub const AMOTION_EVENT_BUTTON_STYLUS_PRIMARY: _bindgen_ty_15 = 32;
#[doc = " forward"]
pub const AMOTION_EVENT_BUTTON_STYLUS_SECONDARY: _bindgen_ty_15 = 64;
#[doc = " Constants that identify buttons that are associated with motion events.\n Refer to the documentation on the MotionEvent class for descriptions of each button."]
pub type _bindgen_ty_15 = ::std::os::raw::c_uint;
#[doc = " unknown"]
pub const AMOTION_EVENT_TOOL_TYPE_UNKNOWN: _bindgen_ty_16 = 0;
#[doc = " finger"]
pub const AMOTION_EVENT_TOOL_TYPE_FINGER: _bindgen_ty_16 = 1;
#[doc = " stylus"]
pub const AMOTION_EVENT_TOOL_TYPE_STYLUS: _bindgen_ty_16 = 2;
#[doc = " mouse"]
pub const AMOTION_EVENT_TOOL_TYPE_MOUSE: _bindgen_ty_16 = 3;
#[doc = " eraser"]
pub const AMOTION_EVENT_TOOL_TYPE_ERASER: _bindgen_ty_16 = 4;
#[doc = " palm"]
pub const AMOTION_EVENT_TOOL_TYPE_PALM: _bindgen_ty_16 = 5;
#[doc = " Constants that identify tool types.\n Refer to the documentation on the MotionEvent class for descriptions of each tool type."]
pub type _bindgen_ty_16 = ::std::os::raw::c_uint;
#[doc = " Classification constant: None.\n\n No additional information is available about the current motion event stream."]
pub const AMotionClassification_AMOTION_EVENT_CLASSIFICATION_NONE: AMotionClassification = 0;
#[doc = " Classification constant: Ambiguous gesture.\n\n The user's intent with respect to the current event stream is not yet determined. Events\n starting in #AMOTION_EVENT_CLASSIFICATION_AMBIGUOUS_GESTURE will eventually resolve into\n either #AMOTION_EVENT_CLASSIFICATION_DEEP_PRESS or #AMOTION_EVENT_CLASSIFICATION_NONE.\n Gestural actions, such as scrolling, should be inhibited until the classification resolves\n to another value or the event stream ends."]
pub const AMotionClassification_AMOTION_EVENT_CLASSIFICATION_AMBIGUOUS_GESTURE:
    AMotionClassification = 1;
#[doc = " Classification constant: Deep press.\n\n The current event stream represents the user intentionally pressing harder on the screen.\n This classification type should be used to accelerate the long press behaviour."]
pub const AMotionClassification_AMOTION_EVENT_CLASSIFICATION_DEEP_PRESS: AMotionClassification = 2;
#[doc = " Constants that identify different gesture classification types."]
pub type AMotionClassification = u32;
#[doc = " mask"]
pub const AINPUT_SOURCE_CLASS_MASK: _bindgen_ty_17 = 255;
#[doc = " none"]
pub const AINPUT_SOURCE_CLASS_NONE: _bindgen_ty_17 = 0;
#[doc = " button"]
pub const AINPUT_SOURCE_CLASS_BUTTON: _bindgen_ty_17 = 1;
#[doc = " pointer"]
pub const AINPUT_SOURCE_CLASS_POINTER: _bindgen_ty_17 = 2;
#[doc = " navigation"]
pub const AINPUT_SOURCE_CLASS_NAVIGATION: _bindgen_ty_17 = 4;
#[doc = " position"]
pub const AINPUT_SOURCE_CLASS_POSITION: _bindgen_ty_17 = 8;
#[doc = " joystick"]
pub const AINPUT_SOURCE_CLASS_JOYSTICK: _bindgen_ty_17 = 16;
#[doc = " Input source masks.\n\n Refer to the documentation on android.view.InputDevice for more details about input sources\n and their correct interpretation."]
pub type _bindgen_ty_17 = ::std::os::raw::c_uint;
#[doc = " unknown"]
pub const AINPUT_SOURCE_UNKNOWN: _bindgen_ty_18 = 0;
#[doc = " keyboard"]
pub const AINPUT_SOURCE_KEYBOARD: _bindgen_ty_18 = 257;
#[doc = " dpad"]
pub const AINPUT_SOURCE_DPAD: _bindgen_ty_18 = 513;
#[doc = " gamepad"]
pub const AINPUT_SOURCE_GAMEPAD: _bindgen_ty_18 = 1025;
#[doc = " touchscreen"]
pub const AINPUT_SOURCE_TOUCHSCREEN: _bindgen_ty_18 = 4098;
#[doc = " mouse"]
pub const AINPUT_SOURCE_MOUSE: _bindgen_ty_18 = 8194;
#[doc = " stylus"]
pub const AINPUT_SOURCE_STYLUS: _bindgen_ty_18 = 16386;
#[doc = " bluetooth stylus"]
pub const AINPUT_SOURCE_BLUETOOTH_STYLUS: _bindgen_ty_18 = 49154;
#[doc = " trackball"]
pub const AINPUT_SOURCE_TRACKBALL: _bindgen_ty_18 = 65540;
#[doc = " mouse relative"]
pub const AINPUT_SOURCE_MOUSE_RELATIVE: _bindgen_ty_18 = 131076;
#[doc = " touchpad"]
pub const AINPUT_SOURCE_TOUCHPAD: _bindgen_ty_18 = 1048584;
#[doc = " navigation"]
pub const AINPUT_SOURCE_TOUCH_NAVIGATION: _bindgen_ty_18 = 2097152;
#[doc = " joystick"]
pub const AINPUT_SOURCE_JOYSTICK: _bindgen_ty_18 = 16777232;
#[doc = " HDMI"]
pub const AINPUT_SOURCE_HDMI: _bindgen_ty_18 = 33554433;
#[doc = " sensor"]
pub const AINPUT_SOURCE_SENSOR: _bindgen_ty_18 = 67108864;
#[doc = " rotary encoder"]
pub const AINPUT_SOURCE_ROTARY_ENCODER: _bindgen_ty_18 = 4194304;
#[doc = " any"]
pub const AINPUT_SOURCE_ANY: _bindgen_ty_18 = 4294967040;
#[doc = " Input sources."]
pub type _bindgen_ty_18 = ::std::os::raw::c_uint;
#[doc = " none"]
pub const AINPUT_KEYBOARD_TYPE_NONE: _bindgen_ty_19 = 0;
#[doc = " non alphabetic"]
pub const AINPUT_KEYBOARD_TYPE_NON_ALPHABETIC: _bindgen_ty_19 = 1;
#[doc = " alphabetic"]
pub const AINPUT_KEYBOARD_TYPE_ALPHABETIC: _bindgen_ty_19 = 2;
#[doc = " Keyboard types.\n\n Refer to the documentation on android.view.InputDevice for more details.\n Note: When adding a new keyboard type here InputDeviceInfo::setKeyboardType needs to be updated."]
pub type _bindgen_ty_19 = ::std::os::raw::c_uint;
#[doc = " x"]
pub const AINPUT_MOTION_RANGE_X: _bindgen_ty_20 = 0;
#[doc = " y"]
pub const AINPUT_MOTION_RANGE_Y: _bindgen_ty_20 = 1;
#[doc = " pressure"]
pub const AINPUT_MOTION_RANGE_PRESSURE: _bindgen_ty_20 = 2;
#[doc = " size"]
pub const AINPUT_MOTION_RANGE_SIZE: _bindgen_ty_20 = 3;
#[doc = " touch major"]
pub const AINPUT_MOTION_RANGE_TOUCH_MAJOR: _bindgen_ty_20 = 4;
#[doc = " touch minor"]
pub const AINPUT_MOTION_RANGE_TOUCH_MINOR: _bindgen_ty_20 = 5;
#[doc = " tool major"]
pub const AINPUT_MOTION_RANGE_TOOL_MAJOR: _bindgen_ty_20 = 6;
#[doc = " tool minor"]
pub const AINPUT_MOTION_RANGE_TOOL_MINOR: _bindgen_ty_20 = 7;
#[doc = " orientation"]
pub const AINPUT_MOTION_RANGE_ORIENTATION: _bindgen_ty_20 = 8;
#[doc = " Constants used to retrieve information about the range of motion for a particular\n coordinate of a motion event.\n\n Refer to the documentation on android.view.InputDevice for more details about input sources\n and their correct interpretation.\n\n @deprecated These constants are deprecated. Use {@link AMOTION_EVENT_AXIS AMOTION_EVENT_AXIS_*}\n constants instead."]
pub type _bindgen_ty_20 = ::std::os::raw::c_uint;
extern "C" {
    #[doc = " Get the input event type."]
    pub fn AInputEvent_getType(event: *const AInputEvent) -> i32;
}
extern "C" {
    #[doc = " Get the id for the device that an input event came from.\n\n Input events can be generated by multiple different input devices.\n Use the input device id to obtain information about the input\n device that was responsible for generating a particular event.\n\n An input device id of 0 indicates that the event didn't come from a physical device;\n other numbers are arbitrary and you shouldn't depend on the values.\n Use the provided input device query API to obtain information about input devices."]
    pub fn AInputEvent_getDeviceId(event: *const AInputEvent) -> i32;
}
extern "C" {
    #[doc = " Get the input event source."]
    pub fn AInputEvent_getSource(event: *const AInputEvent) -> i32;
}
extern "C" {
    #[doc = " Releases interface objects created by {@link AKeyEvent_fromJava()}\n and {@link AMotionEvent_fromJava()}.\n After returning, the specified {@link AInputEvent}* object becomes invalid and should no longer\n be used. The underlying Java object remains valid and does not change its state.\n\n Available since API level 31."]
    pub fn AInputEvent_release(event: *const AInputEvent);
}
extern "C" {
    #[doc = " Get the key event action."]
    pub fn AKeyEvent_getAction(key_event: *const AInputEvent) -> i32;
}
extern "C" {
    #[doc = " Get the key event flags."]
    pub fn AKeyEvent_getFlags(key_event: *const AInputEvent) -> i32;
}
extern "C" {
    #[doc = " Get the key code of the key event.\n This is the physical key that was pressed, not the Unicode character."]
    pub fn AKeyEvent_getKeyCode(key_event: *const AInputEvent) -> i32;
}
extern "C" {
    #[doc = " Get the hardware key id of this key event.\n These values are not reliable and vary from device to device."]
    pub fn AKeyEvent_getScanCode(key_event: *const AInputEvent) -> i32;
}
extern "C" {
    #[doc = " Get the meta key state."]
    pub fn AKeyEvent_getMetaState(key_event: *const AInputEvent) -> i32;
}
extern "C" {
    #[doc = " Get the repeat count of the event.\n For both key up an key down events, this is the number of times the key has\n repeated with the first down starting at 0 and counting up from there.  For\n multiple key events, this is the number of down/up pairs that have occurred."]
    pub fn AKeyEvent_getRepeatCount(key_event: *const AInputEvent) -> i32;
}
extern "C" {
    #[doc = " Get the time of the most recent key down event, in the\n java.lang.System.nanoTime() time base.  If this is a down event,\n this will be the same as eventTime.\n Note that when chording keys, this value is the down time of the most recently\n pressed key, which may not be the same physical key of this event."]
    pub fn AKeyEvent_getDownTime(key_event: *const AInputEvent) -> i64;
}
extern "C" {
    #[doc = " Get the time this event occurred, in the\n java.lang.System.nanoTime() time base."]
    pub fn AKeyEvent_getEventTime(key_event: *const AInputEvent) -> i64;
}
extern "C" {
    #[doc = " Creates a native {@link AInputEvent}* object that is a copy of the specified Java\n android.view.KeyEvent. The result may be used with generic and KeyEvent-specific AInputEvent_*\n functions. The object returned by this function must be disposed using\n {@link AInputEvent_release()}.\n\n Available since API level 31."]
    pub fn AKeyEvent_fromJava(env: *mut JNIEnv, keyEvent: jobject) -> *const AInputEvent;
}
extern "C" {
    #[doc = " Get the combined motion event action code and pointer index."]
    pub fn AMotionEvent_getAction(motion_event: *const AInputEvent) -> i32;
}
extern "C" {
    #[doc = " Get the motion event flags."]
    pub fn AMotionEvent_getFlags(motion_event: *const AInputEvent) -> i32;
}
extern "C" {
    #[doc = " Get the state of any meta / modifier keys that were in effect when the\n event was generated."]
    pub fn AMotionEvent_getMetaState(motion_event: *const AInputEvent) -> i32;
}
extern "C" {
    #[doc = " Get the button state of all buttons that are pressed."]
    pub fn AMotionEvent_getButtonState(motion_event: *const AInputEvent) -> i32;
}
extern "C" {
    #[doc = " Get a bitfield indicating which edges, if any, were touched by this motion event.\n For touch events, clients can use this to determine if the user's finger was\n touching the edge of the display."]
    pub fn AMotionEvent_getEdgeFlags(motion_event: *const AInputEvent) -> i32;
}
extern "C" {
    #[doc = " Get the time when the user originally pressed down to start a stream of\n position events, in the java.lang.System.nanoTime() time base."]
    pub fn AMotionEvent_getDownTime(motion_event: *const AInputEvent) -> i64;
}
extern "C" {
    #[doc = " Get the time when this specific event was generated,\n in the java.lang.System.nanoTime() time base."]
    pub fn AMotionEvent_getEventTime(motion_event: *const AInputEvent) -> i64;
}
extern "C" {
    #[doc = " Get the X coordinate offset.\n For touch events on the screen, this is the delta that was added to the raw\n screen coordinates to adjust for the absolute position of the containing windows\n and views."]
    pub fn AMotionEvent_getXOffset(motion_event: *const AInputEvent) -> f32;
}
extern "C" {
    #[doc = " Get the Y coordinate offset.\n For touch events on the screen, this is the delta that was added to the raw\n screen coordinates to adjust for the absolute position of the containing windows\n and views."]
    pub fn AMotionEvent_getYOffset(motion_event: *const AInputEvent) -> f32;
}
extern "C" {
    #[doc = " Get the precision of the X coordinates being reported.\n You can multiply this number with an X coordinate sample to find the\n actual hardware value of the X coordinate."]
    pub fn AMotionEvent_getXPrecision(motion_event: *const AInputEvent) -> f32;
}
extern "C" {
    #[doc = " Get the precision of the Y coordinates being reported.\n You can multiply this number with a Y coordinate sample to find the\n actual hardware value of the Y coordinate."]
    pub fn AMotionEvent_getYPrecision(motion_event: *const AInputEvent) -> f32;
}
extern "C" {
    #[doc = " Get the number of pointers of data contained in this event.\n Always >= 1."]
    pub fn AMotionEvent_getPointerCount(motion_event: *const AInputEvent) -> usize;
}
extern "C" {
    #[doc = " Get the pointer identifier associated with a particular pointer\n data index in this event.  The identifier tells you the actual pointer\n number associated with the data, accounting for individual pointers\n going up and down since the start of the current gesture."]
    pub fn AMotionEvent_getPointerId(motion_event: *const AInputEvent, pointer_index: usize)
        -> i32;
}
extern "C" {
    #[doc = " Get the tool type of a pointer for the given pointer index.\n The tool type indicates the type of tool used to make contact such as a\n finger or stylus, if known."]
    pub fn AMotionEvent_getToolType(motion_event: *const AInputEvent, pointer_index: usize) -> i32;
}
extern "C" {
    #[doc = " Get the original raw X coordinate of this event.\n For touch events on the screen, this is the original location of the event\n on the screen, before it had been adjusted for the containing window\n and views."]
    pub fn AMotionEvent_getRawX(motion_event: *const AInputEvent, pointer_index: usize) -> f32;
}
extern "C" {
    #[doc = " Get the original raw X coordinate of this event.\n For touch events on the screen, this is the original location of the event\n on the screen, before it had been adjusted for the containing window\n and views."]
    pub fn AMotionEvent_getRawY(motion_event: *const AInputEvent, pointer_index: usize) -> f32;
}
extern "C" {
    #[doc = " Get the current X coordinate of this event for the given pointer index.\n Whole numbers are pixels; the value may have a fraction for input devices\n that are sub-pixel precise."]
    pub fn AMotionEvent_getX(motion_event: *const AInputEvent, pointer_index: usize) -> f32;
}
extern "C" {
    #[doc = " Get the current Y coordinate of this event for the given pointer index.\n Whole numbers are pixels; the value may have a fraction for input devices\n that are sub-pixel precise."]
    pub fn AMotionEvent_getY(motion_event: *const AInputEvent, pointer_index: usize) -> f32;
}
extern "C" {
    #[doc = " Get the current pressure of this event for the given pointer index.\n The pressure generally ranges from 0 (no pressure at all) to 1 (normal pressure),\n although values higher than 1 may be generated depending on the calibration of\n the input device."]
    pub fn AMotionEvent_getPressure(motion_event: *const AInputEvent, pointer_index: usize) -> f32;
}
